{
  "title": "Alpha",
  "content": "Alpha  (uppercase , lowercase ; , , or ) is the first letter of the Greek alphabet. In the system of Greek numerals, it has a value of one. Alpha is derived from the Phoenician letter aleph , which is the West Semitic word for \"ox\". Letters that arose from alpha include the Latin letter A and the Cyrillic letter А.\n\nUses\n\nGreek\nIn Ancient Greek, alpha was pronounced  and could be either phonemically long ([aː]) or short ([a]). Where there is ambiguity, long and short alpha are sometimes written with a macron and breve today: .\n =    \"a time\"\n =    \"tongue\"\n\nIn Modern Greek, vowel length has been lost, and all instances of alpha simply represent the open front unrounded vowel .\n\nIn the polytonic orthography of Greek, alpha, like other vowel letters, can occur with several diacritic marks: any of three accent symbols (), and either of two breathing marks (), as well as combinations of these. It can also combine with the iota subscript ().\n\nGreek grammar\nIn the Attic–Ionic dialect of Ancient Greek, long alpha  fronted to  (eta). In Ionic, the shift took place in all positions. In Attic, the shift did not take place after epsilon, iota, and rho (; ). In Doric and Aeolic, long alpha is preserved in all positions.\nDoric, Aeolic, Attic   – Ionic  , \"country\"\nDoric, Aeolic   – Attic, Ionic  , \"report\"\n\nPrivative a is the Ancient Greek prefix  or  , added to words to negate them. It originates from the Proto-Indo-European * (syllabic nasal) and is cognate with English un-.\n\nCopulative a is the Greek prefix  or  . It comes from Proto-Indo-European *.\n\nMathematics and science\n\nThe letter alpha represents various concepts in physics and chemistry, including alpha radiation, angular acceleration, alpha particles, alpha carbon and strength of electromagnetic interaction (as fine-structure constant). Alpha also stands for thermal expansion coefficient of a compound in physical chemistry. It is also commonly used in mathematics in algebraic solutions representing quantities such as angles. Furthermore, in mathematics, the letter alpha is used to denote the area underneath a normal curve in statistics to denote significance level when proving null and alternative hypotheses. In ethology, it is used to name the dominant individual in a group of animals. In aerodynamics, the letter is used as a symbol for the angle of attack of an aircraft and the word \"alpha\" is used as a synonym for this property. In mathematical logic, α is sometimes used as a placeholder for ordinal numbers.\n\nThe proportionality operator \"∝\" (in Unicode: U+221D) is sometimes mistaken for alpha.\n\nThe uppercase letter alpha is not generally used as a symbol because it tends to be rendered identically to the uppercase Latin A.\n\nInternational Phonetic Alphabet\nIn the International Phonetic Alphabet, the letter ɑ, which looks similar to the lower-case alpha, represents the open back unrounded vowel.\n\nHistory and symbolism\n\nOrigin\nThe Phoenician alphabet was adopted for Greek in the early 8th century BC, perhaps in Euboea. \nThe majority of the letters of the Phoenician alphabet were adopted into Greek with much the same sounds as they had had in Phoenician, but ʼāleph, the Phoenician letter representing the glottal stop ,\nwas adopted as representing the vowel ; similarly, hē  and ʽayin  are Phoenician consonants that became Greek vowels, epsilon  and omicron , respectively.\n\nPlutarch\nPlutarch, in Moralia, presents a discussion on why the letter alpha stands first in the alphabet. Ammonius asks Plutarch what he, being a Boeotian, has to say for Cadmus, the Phoenician who reputedly settled in Thebes and introduced the alphabet to Greece, placing alpha first because it is the Phoenician name for ox—which, unlike Hesiod, the Phoenicians considered not the second or third, but the first of all necessities. \"Nothing at all,\" Plutarch replied. He then added that he would rather be assisted by Lamprias, his own grandfather, than by Dionysus' grandfather, i.e. Cadmus. For Lamprias had said that the first articulate sound made is \"alpha\", because it is very plain and simple—the air coming off the mouth does not require any motion of the tongue—and therefore this is the first sound that children make.\n\nAccording to Plutarch's natural order of attribution of the vowels to the planets, alpha was connected with the Moon.\n\nAlpha and Omega\n\nAs the first letter of the alphabet, Alpha as a Greek numeral came to represent the number 1.\nTherefore, Alpha, both as a symbol and term, is used to refer to the \"first\", or \"primary\", or \"principal\" (most significant) occurrence or status of a thing.\n \nThe New Testament has God declaring himself to be the \"Alpha and Omega, the beginning and the end, the first and the last.\" (Revelation 22:13, KJV, and see also 1:8).\n\nConsequently, the term \"alpha\" has also come to be used to denote \"primary\" position in social hierarchy, examples being the concept of dominant \"alpha\" members in groups of animals.\n\nComputer encodings\n Greek alpha / Coptic alfa\n\nFor accented Greek characters, see Greek diacritics: Computer encoding.\n\n Latin / IPA alpha\n\n Mathematical / Technical alpha\n\nReferences\n\nGreek letters\nVowel letters"
}