{
  "title": "Arabian Sea",
  "content": "The Arabian Sea () is a region of sea in the northern Indian Ocean, bounded on the west by the Arabian Peninsula, Gulf of Aden and Guardafui Channel, on the northwest by Gulf of Oman and Iran, on the north by Pakistan, on the east by India, and on the southeast by the Laccadive Sea and the Maldives, on the southwest by Somalia. Its total area is 3,862,000 km2 (1,491,000 sq mi) and its maximum depth is 4,652 meters (15,262 ft). The Gulf of Aden in the west connects the Arabian Sea to the Red Sea through the strait of Bab-el-Mandeb, and the Gulf of Oman is in the northwest, connecting it to the Persian Gulf.\n\nGeography\nThe Arabian Sea's surface area is about . The maximum width of the sea is approximately , and its maximum depth is . The biggest river flowing into the sea is the Indus River.\n\nThe Arabian Sea has two important branches — the Gulf of Aden in the southwest, connecting with the Red Sea through the strait of Bab-el-Mandeb; and the Gulf of Oman to the northwest, connecting with the Persian Gulf. There are also the gulfs of Khambhat and Kutch on the Indian Coast.\nThe Arabian Sea has been crossed by many important marine trade routes since the 3rd or 2nd millennium BCE. Major seaports include Kandla Port, Mundra Port, Pipavav Port, Dahej Port, Hazira Port, Mumbai Port, Nhava Sheva Port (Navi Mumbai), Mormugão Port (Goa), New Mangalore Port and Kochi Port in India, the Port of Karachi, Port Qasim, and the Gwadar Port in Pakistan, Chabahar Port in Iran and the Port of Salalah in Salalah, Oman. The largest islands in the Arabian Sea include Socotra (Yemen), Masirah Island (Oman), Lakshadweep (India) and Astola Island (Pakistan).\nThe countries with coastlines on the Arabian Sea are Yemen, Oman, Pakistan, Iran, India and the Maldives.\n\nLimits\nThe International Hydrographic Organization defines the limits of the Arabian Sea as follows:\n\nOn the west: the eastern limit of the Gulf of Aden.\nOn the north: a line joining Ràs al Hadd, east point of the Arabian Peninsula (22°32'N) and Ràs Jiyùni (61°43'E) on the coast of Pakistan.\nOn the south: a line running from the southern extremity of Addu Atoll in the Maldives, to the eastern extremity of Ràs Hafun (the easternmost point of Africa, 10°26'N).\nOn the east: the western limit of the Laccadive Sea a line running from Sadashivgad on the west coast of India () to Cora Divh () and thence down the west side of the Laccadive and Maldive archipelagos to the most southerly point of Addu Atoll in the Maldives.\n\nBorder and basin countries\nBorder and basin countries:\n - 2,500 km coastline\n - 1,050 km coastline\n\nAlternative names\n\nThe Arabian Sea historically and geographically has been referred to with different names by Arabian and European geographers and travelers, including Erythraean Sea, Indian Sea, Oman sea,  Erythraean, Persian Sea in para No 34-35 of the Voyage. In Indian folklore, it is referred to as Darya, Sindhu Sagar, and Arab Samudra.\n\nArab geographers, sailors and nomads used to call this sea by different names, including the Akhdar (Green) Sea, Bahre Fars (Persian Sea), the Ocean Sea, the Hindu sea, the Makran Sea, the sea of Oman; among them Zakariya al-Qazwini, Al-Masudi, Ibn Hawqal and Hafiz-i Abru. They wrote: \"The green sea and Indian sea and Persian sea are all one sea and in this sea there are strange creatures.\" in Iran and Turkey people call it Oman sea.\nIn the Periplus of the Erythraean Sea, as well as in some ancient maps, Erythraean Sea refers to the whole area of the northwestern Indian Ocean, including the Arabian Sea.\n\nTrade routes\n\nThe Arabian Sea has been an important marine trade route since the era of the coastal sailing vessels from possibly as early as the 3rd millennium BCE, certainly the late 2nd millennium BCE through the later days known as the Age of Sail. By the time of Julius Caesar, several well-established combined land-sea trade routes depended upon water transport through the sea around the rough inland terrain features to its north.\n\nThese routes usually began in the Far East or down river from Madhya Pradesh, India with transshipment via historic Bharuch (Bharakuccha), traversed past the inhospitable coast of modern-day Iran, then split around Hadhramaut, Yemen into two streams north into the Gulf of Aden and thence into the Levant, or south into Alexandria via Red Sea ports such as Axum. Each major route involved transhipping to pack animal caravan, travel through desert country and risk of bandits and extortionate tolls by local potentates.\n\nThis southern coastal route past the rough country in the southern Arabian Peninsula was significant, and the Egyptian Pharaohs built several shallow canals to service the trade, one more or less along the route of today's Suez Canal, and another from the Red Sea to the Nile River, both shallow works that were swallowed up by huge sand storms in antiquity. Later the kingdom of Axum arose in Ethiopia to rule a mercantile empire rooted in the trade with Europe via Alexandria.\n\nMajor ports\nJawaharlal Nehru Port in Mumbai is the largest port in the Arabian Sea, and the largest container port in India.\nMajor Indian ports in the Arabian Sea are Mundra Port, Kandla Port, Nava Sheva, Kochi Port, Mumbai Port, and Mormugão.\n\nThe Port of Karachi, Pakistan's largest and busiest seaport lies on the coast of the sea. It is located between the Karachi towns of Kiamari and Saddar.\n\nThe Gwadar Port of Pakistan is a warm-water, deep-sea port situated at Gwadar in Balochistan at the apex of the Arabian Sea and at the entrance of the Persian Gulf, about 460 km west of Karachi and approximately 75 km (47 mi) east of Pakistan's border with Iran. The port is located on the eastern bay of a natural hammerhead-shaped peninsula jutting out into the Arabian Sea from the coastline.\n\nPort of Salalah in Salalah, Oman is also a major port in the area. The International Task Force often uses the port as a base. There is a significant number of warships of all nations coming in and out of the port, which makes it a very safe bubble. The port handled just under 3.5m teu in 2009.\n\nIslands\n\nThere are several islands in the Arabian Sea, with the most important ones being Lakshadweep Islands (India), Socotra (Yemen), Masirah (Oman) and Astola Island (Pakistan).\n\nThe Lakshadweep Islands (formerly known as the Laccadive, Minicoy, and Aminidivi Islands) is a group of islands in the Laccadive Sea region of Arabian Sea, 200 to 440 km (120 to 270 mi) off the southwestern coast of India. The archipelago is a union territory and is governed by the Union Government of India. The islands form the smallest union territory of India with their total surface area being just . Next to these islands are the Maldives islands. These islands are all part of the Lakshadweep-Maldives-Chagos group of islands.\n\nZalzala Koh was an island which was around for only a few years. After the 2013 earthquake in Pakistan, the mud island was formed. By 2016 the island was finished.\n\nAstola Island, also known as Jezira Haft Talar in Balochi, or 'Island of the Seven Hills', is a small, uninhabited island in the northern tip of the Arabian Sea in Pakistan's territorial waters.\n\nSocotra, also spelled Soqotra, is the largest island, being part of a small archipelago of four islands. It lies some  east of the Horn of Africa and  south of the Arabian Peninsula.\n\nMasirah and the five Khuriya Muriya Islands are islands off the southeastern coast of Oman.\n\nMajor Cities \nThere are many major cities and towns in the coast of Arabian Sea. Some of the major cities are Mumbai, Muscat, Karachi, Aden, Salalah, Thiruvananthapuram, Kochi, Kozhikode, Tirur, Kollam, Mangalore, Bhavnagar, Jamnagar, Mogadishu, Gwadar, Abu Dhabi, Mundra, Dubai, Kannur, Panaji, Karwar, Udupi, Ratnagiri, Murdeshwar, Veraval , Colombo, Takamaka, and Dhiffushi.\n\nOxygen minimum zone\n\nThe Arabian Sea has one of the world's three largest oceanic oxygen minimum zones (OMZ), or “dead zones,” along with the eastern tropical North Pacific and the eastern tropical South Pacific. OMZs have very low levels of oxygen, sometimes undetectable by standard equipment. The Arabian Sea's OMZ has the lowest levels of oxygen in the world, especially in the Gulf of Oman. Causes of the OMZ may include untreated sewage as well as high temperatures on the Indian subcontinent, which increase winds blowing towards India, bringing up nutrients and reducing oxygen in the Arabian Sea's waters. In winter, phytoplankton suited to low-oxygen conditions turn the OMZ bright green.\n\nEnvironment and wildlife \nThe wildlife of the Arabian sea is diverse, and entirely unique because of the geographic distribution.\n\nArabian Sea warming\nRecent studies by Indian Institute of Tropical Meteorology confirmed that the Arabian Sea is warming monotonously; it possibly is due to by global warming.\n\nNative names\n\nRegional endonyms for the Arabian sea in languages of the coastal regions surrounding it.\n\nSee also\n Indian Ocean Rim Association\n North Indian Ocean tropical cyclone\n Piracy off the coast of Somalia\n\nReferences\n\nSources\n\n A book and Atlas\n\nExternal links\n\n Arabian Sea (World Wildlife Fund)\n\n \nArabian Peninsula\nMarine ecoregions\nIndia–Pakistan border\nOman–Yemen border\nBodies of water of Pakistan\nBodies of water of Oman\nSeas of Yemen\nSeas of Iran\nSeas of India\nBodies of water of Somalia\nBodies of water of Iran\nBodies of water of the Maldives\nSeas of the Indian Ocean\nSeas of Asia\nSeas of Africa"
}