{
  "title": "The ABC Song",
  "content": "\"The ABC Song\" is the best-known song used to recite the English alphabet in alphabetical order. It is commonly used to teach the alphabet to children in English-speaking countries. \"The ABC Song\" was first copyrighted in 1835 by Boston music publisher Charles Bradlee. The melody is from a 1761 French music book and is also used in other nursery rhymes like \"Twinkle, Twinkle, Little Star\". It is not known who first set the alphabet to this tune. Songs set to the same melody are also used to teach the alphabets of other languages.\n\nHistory \nThe melody of \"The ABC Song\" was first published in the French book of music Les Amusements d’une Heure et Demy () (1761) without lyrics. It was adapted in Mozart's Twelve Variations and used in many nursery rhymes around the world, including \"Ah! vous dirai-je, maman\", \"Twinkle, Twinkle, Little Star\" and later \"Baa, Baa, Black Sheep\", before being used in this song. It is unknown who set the alphabet to this tune. \n\n\"The ABC Song\" was first copyrighted in 1835 by Boston music publisher Charles Bradlee under the title \"The A.B.C., a German air with variations for the flute with an easy accompaniment for the piano forte.\" The melody was attributed to 18th-century composer Louis Le Maire.\n\n\"The ABC Song\" is commonly used in preschools across English-speaking countries. Due to the speed at which 'L, M, N, O, P' is spoken it is a common misconception among children still learning the alphabet to believe that it is in fact its own letter called \"elemenopee\". Some have proposed teaching slower versions of the song to avoid this issue, but attempts do so have been criticized for lacking the end rhymes and the 'L, M, N, O, P\" part being an essential part of the song. The television series Sesame Street has covered the song many times, collaborating with popular artists such as Stevie Wonder, Katy Perry, Nina Simone and Usher.\n\nComposition and variations \n\nLyrics: (each line represents two measures, or eight beats)\nA, B, C, D, E, F, G... ()\nH, I, J, K, L, M, N, O, P... (; \"L, M, N, O\" spoken twice as quickly as rest of rhyme)\nQ, R, S.../ T, U, V... (; pause between S and T, though in some variants, \"and\" is inserted)\nW... X.../ Y and(/&) Z. (; pause between X and Y, and W and X last for two beats)\nNow I know my ABCs.\nNext time, won't you sing with me?\n\nLyrics for the alternate Zed version: (each line represents two measures, or eight beats)\nA, B, C, D, E, F, G... ()\nH, I, J, K, L, M, N... ()\nO, P, Q, R, S, T, U… ()\nV, W... X, Y and(/&) Z. (; W lasts for two beats)\nNow I know my ABCs.\nNext time, won't you sing with me?\n\nPronunciation of \"Z\" \nIn the dialects spoken in most English-speaking countries, including the United Kingdom, the letter name for Z is pronounced /zɛd/ (Zed); although in American English, the dialect in mind by the composer, the letter is more commonly pronounced /ziː/ (Zee). In dialects which use the Zed pronunciation, the absent Zee-rhyme is generally not missed, although whilst singing the song, some children may accommodate for Zee which they would otherwise not use on a regular basis. Variants of the song exist to accommodate the Zed pronunciation. One such variation is shown below:\n\na-b-c-d-e-f-g\nh-i-j-k-l-m-n\no-p-q-r-s-t-u\nv-w-x-y-z(ed)\n\nThis version has no closing line and the tune is modified accordingly.  There is no lengthening of the W in this version.\n\nBackwards alphabet \nSeveral versions exist covering the alphabet backwards, i.e. Z to A. One version is shown below.\n\nz-y-x and(/&) w\nv-u-t, s-r-q\np-o-n-m-l-k-j\ni-h-g-f-e-d-c-b-a\nNow you know your ZYXs\nI bet that's not what you expected!\nThe e-d-c-b part is as fast as the l-m-n-o part in the normal alphabet song.\n\nVersions for other languages \nThe same melody used for \"The ABC Song\" has also been used for the German, French, and Arabic alphabets. A French-language version of the song is also taught in Canada, with generally no alterations to the melody except in the final line that requires adjustment to accommodate the two-syllable pronunciation of the French y.\n\nSee also\n\nTraditional alphabet songs in other languages \n\"A Haka Mana\" recites the syllabary of the Māori language to the tune of Stupid Cupid\n\"Alef-Bet\" by Debbie Friedman, a song commonly used in American Hebrew school classrooms to teach the letters of the Hebrew alphabet\n\"Iroha\", a recital of the Japanese syllabary\n\"Shiva Sutra\", Sanskrit\n\"Thousand Character Classic\", Chinese and Korean Hanja\n\"Ganada\" (), Korean Hangul\n\"Zengő ABC\" by Ferenc Móra, Hungarian\n\"Алфавит мы уже знаем\", Russian\n\"Adalama\" ( A, da, la, ma...), devised for Fulani speakers in West Africa to memorise the Adlam script.\nThere are several recordings of the Cherokee syllabary with this melody.\nA singable version for memorising the Déné/Carrier syllabics chart.\n\nNotes\n\nReferences \n\nSongs about language\nChildren's songs\nEarly childhood education\nSong\nTraditional children's songs"
}