{
  "title": "Acquis communautaire",
  "content": "The Community acquis or acquis communautaire (; ), sometimes called the EU acquis and often shortened to acquis, is the accumulated legislation, legal acts and court decisions that constitute the body of European Union law that came into being since 1993. The term is French: acquis meaning \"that which has been acquired or obtained\", and communautaire meaning \"of the community\".\n\nChapters\nDuring the process of the enlargement of the European Union, the acquis was divided into 31 chapters for the purpose of negotiation between the EU and the candidate member states for the fifth enlargement (the ten that joined in 2004 plus Romania and Bulgaria which joined in 2007). These chapters were:\n\nFree movement of goods\nFree movement of persons\nFreedom to provide services\nFree movement of capital\nCompany law\nCompetition policy\nAgriculture\nFisheries\nTransport policy\nTaxation\nEconomic and Monetary Union\nStatistics\nSocial policy and employment\nEnergy\nIndustrial policy\nSmall and medium-sized enterprises\nScience and research\nEducation and training\nTelecommunication and information technologies\nCulture and audio-visual policy\nRegional policy and co-ordination of structural instruments\nEnvironment\nConsumers and health protection\nCooperation in the field of Justice and Home Affairs\nCustoms union\nExternal relations\nCommon Foreign and Security Policy (CFSP)\nFinancial control\nFinancial and budgetary provisions\nInstitutions\nOthers\n\nFor the negotiations with Croatia (which joined in 2013), Iceland, Turkey, Montenegro, Serbia and in the future, with North Macedonia, Albania, Ukraine, Moldova and Bosnia and Herzegovina (candidate countries), the acquis is split up into 35 chapters instead, with the purpose of better balancing between the chapters: (dividing the most difficult ones into separate chapters for easier negotiation, uniting some easier chapters, moving some policies between chapters, as well as renaming a few of them in the process)\n\nFree movement of goods\nFreedom of movement for workers\nRight of establishment and freedom to provide services\nFree movement of capital\nPublic procurement\nCompany law\nIntellectual property law\nCompetition policy\nFinancial services\nInformation society and media\nAgriculture and rural development\nFood safety, veterinary and phytosanitary policy\nFisheries\nTransport policy\nEnergy\nTaxation\nEconomic and monetary policy\nStatistics\nSocial policy and employment (including anti-discrimination and equal opportunities for women and men)\nEnterprise and industrial policy\nTrans-European networks\nRegional policy and co-ordination of structural instruments\nJudiciary and fundamental rights\nJustice, freedom and security\nScience and research\nEducation and culture\nEnvironment\nConsumer and health protection\nCustoms union\nExternal relations\nForeign, security and defence policy\nFinancial control\nFinancial and budgetary provisions\nInstitutions\nOther issues\n\nCorrespondence between chapters of the 5th and the 6th Enlargement:\n\nSuch negotiations usually involved agreeing transitional periods before new member states needed to implement the laws of the European Union fully and before they and their citizens acquired full rights under the acquis.\n\nTerminology\nThe term acquis is also used to describe laws adopted under the Schengen Agreement, prior to its integration into the European Union legal order by the Treaty of Amsterdam, in which case one speaks of the Schengen acquis.\n\nThe term acquis has been borrowed by the World Trade Organization Appellate Body, in the case Japan – Taxes on Alcoholic Beverages, to refer to the accumulation of General Agreement on Tariffs and Trade (GATT) and WTO law (\"acquis gattien\"), though this usage is not well established.\n\nIt has been used to describe the achievements of the Council of Europe (an international organisation unconnected with the European Union):\n\nIt has also been applied to the body of \"principles, norms and commitments\" of the Organization for Security and Co-operation in Europe (OSCE):\n\nThe Organisation for Economic Co-operation and Development (OECD) introduced the concept of the OECD Acquis in its \"Strategy for enlargement and outreach\", May 2004.\n\nSee also\n Official Journal of the European Union\n Primacy of European Union law\n\nReferences\n\nExternal links\n\nEUR-Lex: European Union Law.\nJRC-Acquis, Aligned multilingual parallel corpus: 23,000 Acquis-related texts per language, available in 22 languages. Total size: 1 Billion words.\nTranslation Memory of the EU-Acquis: Up to 1 Million translation units each, for 231 language pairs.\n\nEuropean Union constitutional law"
}