{
  "title": "Admiralty (United Kingdom)",
  "content": "The Admiralty was a department of the Government of the United Kingdom responsible for the command of the Royal Navy until 1964, historically under its titular head, the Lord High Admiral – one of the Great Officers of State. For much of its history, from the early 18th century until its abolition, the role of the Lord High Admiral was almost invariably put \"in commission\" and exercised by the Lords Commissioner of the Admiralty, who sat on the governing Board of Admiralty, rather than by a single person. The Admiralty was replaced by the Admiralty Board in 1964, as part of the reforms that created the Ministry of Defence and its Navy Department (later Navy Command).\n\nBefore the Acts of Union 1707, the Office of the Admiralty and Marine Affairs administered the Royal Navy of the Kingdom of England, which merged with the Royal Scots Navy and the absorbed the responsibilities of the Lord High Admiral of the Kingdom of Scotland with the unification of the Kingdom of Great Britain. The Admiralty was among the most important departments of the British Government, because of the Royal Navy's role in the expansion and maintenance of the English overseas possessions in the 17th century, the British Empire in the 18th century, and subsequently.\n\nThe modern Admiralty Board, to which the functions of the Admiralty were transferred in 1964, is a committee of the tri-service Defence Council of the United Kingdom. This Admiralty Board meets only twice a year, and the day-to-day running of the Royal Navy is controlled by a Navy Board (not to be confused with the historic Navy Board). It is common for the various authorities now in charge of the Royal Navy to be referred to as simply 'The Admiralty'.\n\nThe title of Lord High Admiral of the United Kingdom was vested in the monarch from 1964 to 2011. The title was awarded to Prince Philip, Duke of Edinburgh by Queen Elizabeth II on his 90th birthday and since his 2021 death has reverted to the monarch.  There also continues to be a Vice-Admiral of the United Kingdom and a Rear-Admiral of the United Kingdom, both of which are honorary offices.\n\nHistory\n\nThe office of Admiral of England (later Lord Admiral, and later Lord High Admiral) was created around 1400; there had previously been Admirals of the northern and western seas. King Henry VIII established the Council of the Marine—later to become the Navy Board—in 1546, to oversee administrative affairs of the naval service. Operational control of the Royal Navy remained the responsibility of the Lord High Admiral, who was one of the nine Great Officers of State. This management approach would continue in force in the Royal Navy until 1832.\n\nKing Charles I put the office of Lord High Admiral into commission in 1628, and control of the Royal Navy passed to a committee in the form of the Board of Admiralty. The office of Lord High Admiral passed a number of times in and out of commission until 1709, after which the office was almost permanently in commission (the last Lord High Admiral being the future King William IV in the early 19th century).\n\nIn this organization a dual system operated the Lord High Admiral (from 1546) then Commissioners of the Admiralty (from 1628) exercised the function of general control (military administration) of the Navy and they were usually responsible for the conduct of any war, while the actual supply lines, support and services were managed by four principal officers, namely, the Treasurer, Comptroller, Surveyor and Clerk of the Acts, responsible individually for finance, supervision of accounts, Shipbuilding and maintenance of ships, and record of business. These principal officers came to be known as the Navy Board responsible for 'civil administration' of the navy, from 1546 to 1832.\n\nThis structure of administering the navy lasted for 285 years, however, the supply system was often inefficient and corrupt its deficiencies were due as much to its limitations of the times they operated in. The various functions within the Admiralty were not coordinated effectively and lacked inter-dependency with each other, with the result that in 1832, Sir James Graham abolished the Navy Board and merged its functions within those of the Board of Admiralty. At the time this had distinct advantages; however, it failed to retain the principle of distinctions between the Admiralty and supply, and a lot of bureaucracy followed with the merger.\n\nIn 1860 saw big growth in the development of technical crafts, the expansion of more admiralty branches that really began with age of steam that would have an enormous influence on the navy and naval thought. Between 1860 and 1908, there was no real study of strategy and of staff work conducted within the naval service; it was practically ignored. All the Navy's talent flowed to the great technical universities. This school of thought for the next 50 years was exclusively technically based. The first serious attempt to introduce a sole management body to administer the naval service manifested itself in the creation of the Admiralty Navy War Council in 1909.\n\nFollowing this, a new advisory body called the Admiralty War Staff was then instituted in 1912, headed by the Chief of the War Staff who was responsible for administering three new sub-divisions responsible for operations, intelligence and mobilisation. The new War Staff had hardly found its feet and it continually struggled with the opposition to its existence by senior officers they were categorically opposed to a staff. The deficiencies of the system within this department of state could be seen in the conduct of the Dardanelles campaign. There were no mechanisms in place to answer the big strategic questions. A Trade Division was created in 1914. Sir John Jellicoe came to the Admiralty in 1916. He re-organized the war staff as following: Chief of War Staff, Operations, Intelligence, Signal Section, Mobilisation, Trade.\n\nIt was not until 1917 that the admiralty department was again properly reorganized and began to function as a professional military staff. In May 1917, the term \"Admiralty War Staff\" was renamed and that department and its functional role were superseded by a new \"Admiralty Naval Staff\"; in addition, the newly created office of Chief of the Naval Staff was merged in the office of the First Sea Lord. Also appointed was a new post, that of Deputy Chief of the Naval Staff, and an Assistant Chief of the Naval Staff; all were given seats on the Board of Admiralty. This for the first time gave the naval staff direct representation on the board; the presence of three senior naval senior members on the board ensured the necessary authority to carry through any operation of war. The Deputy Chief of Naval Staff would direct all operations and movements of the fleet, while the Assistant Chief of Naval Staff would be responsible for mercantile movements and anti-submarine operations.\n\nThe office of Controller would be re-established to deal with all questions relating to supply; on 6 September 1917, a Deputy First Sea Lord, was added to the Board who would administer operations abroad and deal with questions of foreign policy. In October 1917, the development of the staff was carried one step further by the creation of two sub-committees of the Board—the Operations Committee and the Maintenance Committee. The First Lord of the Admiralty was chairman of both committees, and the Operations Committee consisted of the First Sea Lord and Chief of Naval Staff, the Deputy First Sea Lord, Assistant Chief of Naval Staff, and Fifth Sea Lord.\n\nFull operational control of the Royal Navy was finally handed over to the Chief of Naval Staff (CNS) by an order in Council, effective October 1917, under which he became responsible for the issuing of orders affecting all war operations directly to the fleet. It also empowered the CNS to issue orders in their own name, as opposed to them previously being issued by the Permanent Secretary of the Admiralty in the name of the Board. In 1964, the Admiralty—along with the War Office and the Air Ministry—were abolished as separate departments of state, and placed under one single new Ministry of Defence. Within the expanded Ministry of Defence are the new Admiralty Board which has a separate Navy Board responsible for the day-to-day running of the Royal Navy, the Army Board and the Air Force Board, each headed by the Secretary of State for Defence.\n\nOrganizational structure\n\nIn the 20th century the structure of the Admiralty Headquarters was predominantly organized into four parts:\n\n The Board of Admiralty, which directs and controls the whole machine chaired by a civilian government minister the First Lord of the Admiralty. His chief military adviser was the First Sea Lord and Chief of Naval Staff as the Senior Naval Lord to the board.\n The Admiralty Naval Staff, advised and assisted the Board in chief strategic and operational planning, in the distributing of fleets and the allocating of assets to major naval commands and stations and in formulating official policy on tactical doctrine and requirements in regard to men and material. In order to deliver this the Naval Staff was organised into specialist Divisions and Sections. When the Admiralty unified with the Ministry of Defence in 1964 they were re designated as Directorates of the Naval Staff.\n The Admiralty Departments, which provides the men, ships, aircraft and supplies to carry out the approved policy. The departments are superintended by the various offices of the Sea Lords.\n The Department of the Permanent Secretary which was the general co-ordinating agency, regulating naval finance, providing advice on policy, conducing all correspondence on behalf of the Board and maintaining admiralty records. Its primary component to deliver this is the Admiralty Secretariat, sections of the Secretariat (other than those which provide Common Services) were known as Branches.\n\nBoard of Admiralty\n\nWhen the office of Lord High Admiral was in commission, as it was for most of the 18th, 19th and 20th centuries, until it reverted to the Crown, it was exercised by a Board of Admiralty, officially known as the Commissioners for Exercising the Office of Lord High Admiral of the United Kingdom of Great Britain and Northern Ireland, &c. (alternatively of England, Great Britain or the United Kingdom of Great Britain and Ireland depending on the period). The Board of Admiralty consisted of a number of Lords Commissioners of the Admiralty. The Lords Commissioners were always a mixture of admirals, known as Naval Lords or Sea Lords and Civil Lords, normally politicians. The quorum of the Board was two commissioners and a secretary. The president of the Board was known as the First Lord of the Admiralty, who was a member of the Cabinet. After 1806, the First Lord of the Admiralty was always a civilian, while the professional head of the navy came to be (and is still today) known as the First Sea Lord.\n\nLords Commissioners of the Admiralty (1628–1964)\n\nThe Lords Commissioners of the Admiralty were the members of The Board of Admiralty, which exercised the office of Lord High Admiral when it was not vested in a single person. The commissioners were a mixture of politicians without naval experience and professional naval officers, the proportion of naval officers generally increasing over time.\n\nKey Officials\n\nFirst Lord of the Admiralty\n\nThe First Lord of the Admiralty or formally the Office of the First Lord of the Admiralty was the British government's senior civilian adviser on all naval affairs and the minister responsible for the direction and control of the Admiralty and Marine Affairs Office later the Department of Admiralty.(+) His office was supported by the Naval Secretariat.\n\nFirst Sea Lord and Chief of Naval Staff\n\nThe First Sea Lord and Chief of Naval Staff was the Chief Naval Adviser on the Board of Admiralty to the First Lord and superintended the offices of the sea lords and the admiralty naval staff.\n\nNavy Board\n\nThe Navy Board was an independent board from 1546 until 1628 when it became subordinate to, yet autonomous of the Board of Admiralty until 1832. Its principal commissioners of the Navy advised the board in relation to civil administration of the naval affairs. The Navy Board was based at the Navy Office.\n\nBoard of Admiralty civilian members responsible other important civil functions\n Office of the Civil Lord of the Admiralty.\n Office of the Additional Civil Lord of the Admiralty.\n Office of the Parliamentary and Financial Secretary to the Admiralty.\n\nAdmiralty Naval Staff\n\nIt evolved from *Admiralty Navy War Council, (1909–1912) which in turn became the Admiralty War Staff, (1912–1917) before finally becoming the Admiralty Naval Staff in 1917. It was the former senior command, operational planning, policy and strategy department within the British Admiralty. It was established in 1917 and existed until 1964 when the department of the Admiralty was abolished, and the staff departments function continued within the Navy Department of the Ministry of Defence until 1971 when its functions became part of the new Naval Staff, Navy Department of the Ministry of Defence.\n\nOffices of the Naval Staff\n Office of Deputy Chief of the Naval Staff.\n Office of the Vice Chief of the Naval Staff. \n Offices of the Assistant Chiefs of the Naval Staff.\n\nAdmiralty Departments\nThe Admiralty Departments were distinct and component parts of the Department of Admiralty that were superintended by the various offices of the Sea Lords responsible for them; they were primarily administrative, research, scientific and logistical support organisations. The departments role was to provide the men, ships, aircraft and supplies to carry out the approved policy of the Board of Admiralty and conveyed to them during 20th century by the Admiralty Naval Staff.\n\nOffices of the Sea Lords\n Office of the Deputy First Sea Lord \n Office of the Second Sea Lord. \n Office of the Third Sea Lord.\n Office of the Fourth Sea Lord.\n Office of Fifth Sea Lord\n\nDepartment of the Permanent Secretary\n\nThe Secretary's Department consisted of members of the civil service it was directed and controlled by a senior civil servant Permanent Secretary to the Board of Admiralty he was not a Lord Commissioner of the Admiralty, he functioned as a member of the board, and attended all of its meetings.\n\nOrganizational structure by time period\n\n\"Admiralty\" as a metonym for \"sea power\"\nIn some cases, the term admiralty is used in a wider sense, as meaning sea power or rule over the seas, rather than in strict reference to the institution exercising such power. For example, the well-known lines from Kipling's Song of the Dead:\n\nSee also\n\n Admiralty administration\n Admiralty buildings\n Admiralty chart\n Admiralty, Hong Kong\n Admiralty Inlet\n Admiralty Peak\n Navy Department (Ministry of Defence)\n List of lords high admiral\n List of first lords of the Admiralty\n List of lords commissioners of the Admiralty\n Lord High Admiral of Scotland\n St Boniface's Catholic College\n\nReferences\n\nFurther reading\n Daniel A. Baugh, Naval Administration in the Age of Walpole (Princeton, 1965).\n Sir John Barrow, An Autobiographical Memoir of Sir John Barrow, Bart., Late of the Admiralty (London, 1847).\n John Ehrman, The Navy in the War of William III: Its State and Direction (Cambridge, 1953).\n C. I. Hamilton, The Making of the Modern Admiralty: British Naval Policy-Making 1805–1927 (Cambridge: Cambridge University Press, 2011).\n C. I. Hamilton, \"Selections from the Phinn Committee of Inquiry of October–November 1853 into the State of the Office of Secretary to the Admiralty, in The Naval Miscellany, volume V, edited by N. A. M. Rodger, (London: Navy Records Society, London, 1984).\n C. S. Knighton, Pepys and the Navy (Stroud: Sutton Publishing, 2003).\n Christopher Lloyd, Mr Barrow of the Admiralty (London, 1970).\n Malcolm H. Murfett, The First Sea Lords: From Fisher to Mountbatten (Westport: Praeger, 1995).\n Lady Murray, The Making of a Civil Servant: Sir Oswyn Murray, Secretary of the Admiralty 1917–1936 (London, 1940).\n N.A.M. Rodger, The Admiralty (Lavenham, 1979)\n J.C. Sainty, Admiralty Officials, 1660–1870 (London, 1975)\n Sir Charles Walker, Thirty-Six Years at the Admiralty (London, 1933)\n\nExternal links \n\n The Admiralty at the Survey of London online\n\n \nDefunct departments of the Government of the United Kingdom\nRoyal Navy\n\nHistory of the Royal Navy\n\n1964 disestablishments in the United Kingdom\nUnited Kingdom in World War II\nMilitary history of the United Kingdom during World War II"
}