{
  "title": "Bloody Sunday (1972)",
  "content": "Bloody Sunday, or the Bogside Massacre, was a massacre on 30 January 1972 when British soldiers shot 26 unarmed civilians during a protest march in the Bogside area of Derry, Northern Ireland. Fourteen people died: thirteen were killed outright, while the death of another man four months later was attributed to his injuries. Many of the victims were shot while fleeing from the soldiers, and some were shot while trying to help the wounded. Other protesters were injured by shrapnel, rubber bullets, or batons, two were run down by British Army vehicles, and some were beaten. All of those shot were Catholics. The march had been organised by the Northern Ireland Civil Rights Association (NICRA) to protest against imprisonment without trial. The soldiers were from the 1st Battalion of the Parachute Regiment (\"1 Para\"), the same battalion implicated in the Ballymurphy massacre several months before.\n\nTwo investigations were held by the British government. The Widgery Tribunal, held in the aftermath, largely cleared the soldiers and British authorities of blame. It described some of the soldiers' shooting as \"bordering on the reckless\", but accepted their claims that they shot at gunmen and bomb-throwers. The report was widely criticised as a \"whitewash\". The Saville Inquiry, chaired by Lord Saville of Newdigate, was established in 1998 to reinvestigate the incident much more thoroughly. Following a twelve-year investigation, Saville's report was made public in 2010 and concluded that the killings were \"unjustified\" and \"unjustifiable\". It found that all of those shot were unarmed, that none were posing a serious threat, that no bombs were thrown and that soldiers \"knowingly put forward false accounts\" to justify their firing. The soldiers denied shooting the named victims but also denied shooting anyone by mistake. On publication of the report, British Prime Minister David Cameron formally apologised. Following this, police began a murder investigation into the killings. One former soldier was charged with murder, but the case was dropped two years later when evidence was deemed inadmissible. Following an appeal by the families of the victims, however, the Public Prosecution Service resumed the prosecution.\n\nBloody Sunday came to be regarded as one of the most significant events of the Troubles because so many civilians were killed by forces of the state, in view of the public and the press. It was the highest number of people killed in a shooting incident during the conflict and is considered the worst mass shooting in Northern Irish history. Bloody Sunday fuelled Catholic and Irish nationalist hostility to the British Army and worsened the conflict. Support for the Provisional Irish Republican Army (IRA) rose, and there was a surge of recruitment into the organisation, especially locally. The Republic of Ireland held a national day of mourning, and huge crowds besieged and burnt down the chancery of the British Embassy in Dublin.\n\nBackground\n\nThe City of Derry was perceived by many Catholics and Irish nationalists in Northern Ireland to be the epitome of what was described as \"fifty years of Unionist misrule\": despite having a nationalist majority, gerrymandering ensured elections to the City Corporation always returned a unionist majority. The city was perceived to be deprived of public investment: motorways were not extended to it, a university was opened in the smaller (Protestant-majority) town of Coleraine rather than Derry and, above all, the city's housing stock was in a generally poor state. Derry therefore became a major focus of the civil rights campaign led by organisations such as the Northern Ireland Civil Rights Association (NICRA) in the late 1960s. It was the scene of the major riot known as Battle of the Bogside in August 1969, which pushed the Northern Ireland administration to ask for military support.\n\nWhile many Catholics initially welcomed the British Army as a neutral force – in contrast to the Royal Ulster Constabulary (RUC), which was regarded as a sectarian police force – relations between them soon deteriorated.\n\nIn response to rising levels of violence across Northern Ireland, internment without trial was introduced on 9 August 1971. There was disorder across the region following the introduction of internment, with 21 people being killed in three days of violence. In Belfast, soldiers of the Parachute Regiment shot dead eleven civilians in what became known as the Ballymurphy Massacre. On 10 August, Bombardier Paul Challenor became the first soldier to be killed by the Provisional Irish Republican Army (Provisional IRA) in Derry, when he was shot by a sniper in the Creggan housing estate. A month after internment was introduced, a British soldier shot dead 14-year-old Catholic schoolgirl Annette McGavigan in Derry. Two months later, Kathleen Thompson, a 47-year-old mother of six was shot dead in her back garden in Derry by the British Army.\n\nIRA activity also increased across Northern Ireland, with thirty British soldiers being killed in the remaining months of 1971, in contrast to the ten soldiers killed during the pre-internment period of the year. A further six soldiers had been killed in Derry by end of 1971. At least 1,332 rounds were fired at the British Army, who also faced 211 explosions and 180 nail bombs, and who fired 364 rounds in return. Both the Provisional IRA and the Official IRA had built barricades and established no-go areas for the British Army and RUC in Derry. By the end of 1971, 29 barricades were in place to prevent access to what was known as Free Derry, sixteen of them impassable even to the British Army's one-ton armoured vehicles. IRA members openly mounted roadblocks in front of the media, and daily clashes took place between nationalist youths and the British Army at a spot known as \"aggro corner\". Due to rioting and incendiary devices, an estimated  worth of damage had been caused to local businesses.\n\nLead-up to the march\nOn 18 January 1972 the Northern Irish Prime Minister, Brian Faulkner, banned all parades and marches in the region until the end of the year. Four days later, in defiance of the ban, an anti-internment march was held at Magilligan strand, near Derry. Protesters marched to an internment camp but were stopped by soldiers of the Parachute Regiment. When some protesters threw stones and tried to go around the barbed wire, paratroopers drove them back by firing rubber bullets at close range and making baton charges. The paratroopers badly beat a number of protesters and had to be physically restrained by their own officers. These allegations of brutality by paratroopers were reported widely on television and in the press. Some in the British Army also thought there had been undue violence by the paratroopers.\n\nNICRA intended to hold another anti-internment march in Derry on 30 January. The authorities decided to allow it to proceed in the Bogside, but to stop it from reaching Guildhall Square, as planned by the organisers, to avoid rioting. Major General Robert Ford, then Commander of Land Forces in Northern Ireland, ordered that the 1st Battalion, Parachute Regiment (1 Para), should travel to Derry to be used to arrest rioters. The arrest operation was codenamed 'Operation Forecast'. The Saville Report criticised Ford for choosing the Parachute Regiment for the operation, as it had \"a reputation for using excessive physical violence\". March organiser and MP Ivan Cooper had been promised beforehand that no armed IRA members would be near the march, although Tony Geraghty wrote that some of the stewards were probably IRA members.\n\nEvents of the day\n\nThe paratroopers arrived in Derry on the morning of the march and took up positions. Brigadier Pat MacLellan was the operational commander and issued orders from Ebrington Barracks. He gave orders to Lieutenant Colonel Derek Wilford, commander of 1 Para. He in turn gave orders to Major Ted Loden, who commanded the company who would launch the arrest operation. The protesters planned on marching from Bishop's Field, in the Creggan housing estate, to the Guildhall in the city centre, where they would hold a rally. The march set off at about 2:45p.m. There were 10,000–15,000 people on the march, with many joining along its route. Lord Widgery, in his now discredited tribunal, said that there were only 3,000 to 5,000.\n\nThe march made its way along William Street but, as it neared the city centre, its path was blocked by British Army barriers. The organisers redirected the march down Rossville Street, intending to hold the rally at Free Derry Corner instead. However, some broke off from the march and began throwing stones at soldiers manning the barriers. The soldiers fired rubber bullets, CS gas and water cannons. Such clashes between soldiers and youths were common, and observers reported that the rioting was no more violent than usual.\n\nSome of the crowd spotted paratroopers occupying a derelict three-story building overlooking William Street, and began throwing stones up at the windows. At about 3:55p.m., these paratroopers opened fire. Civilians Damien Donaghy and John Johnston were shot and wounded while standing on waste ground opposite the building. These were the first shots fired. The soldiers claimed Donaghy was holding a black cylindrical object, but the Saville Inquiry concluded that all of those shot were unarmed.\n\nAt 4:07p.m., the paratroopers were ordered to go through the barriers and arrest rioters. The paratroopers, on foot and in armoured vehicles, chased people down Rossville Street and into the Bogside. Two people were knocked down by the vehicles. MacLellan had ordered that only one company of paratroopers be sent through the barriers, on foot, and that they should not chase people down Rossville Street. Wilford disobeyed this order, which meant there was no separation between rioters and peaceful marchers. There were many claims of paratroopers beating people, clubbing them with rifle butts, firing rubber bullets at them from close range, making threats to kill, and hurling abuse. The Saville Report agreed that soldiers \"used excessive force when arresting people […] as well as seriously assaulting them for no good reason while in their custody\".\n\nOne group of paratroopers took up position at a low wall about  in front of a rubble barricade that stretched across Rossville Street. There were people at the barricade and some were throwing stones at the soldiers, but were not near enough to hit them. The soldiers fired on the people at the barricade, killing six and wounding a seventh.\n\nA large group of people fled or were chased into the car park of Rossville Flats. This area was like a courtyard, surrounded on three sides by high-rise flats. The soldiers opened fire, killing one civilian and wounding six others. This fatality, Jackie Duddy, was running alongside a priest, Edward Daly, when he was shot in the back.\n\nAnother group of people fled into the car park of Glenfada Park, which was also surrounded by flats. Here, the soldiers shot at people across the car park, about  away. Two civilians were killed and at least four others wounded. The Saville Report says it is probable that at least one soldier fired randomly at the crowd from the hip. The paratroopers went through the car park and out the other side. Some soldiers went out the southwest corner, where they shot dead two civilians. The other soldiers went out the southeast corner and shot four more civilians, killing two.\n\nAbout ten minutes had elapsed between the time soldiers drove into the Bogside and the time the last of the civilians was shot. More than 100 rounds were fired by the soldiers. No warnings were given before soldiers opened fire.\n\nSome of those shot were given first aid by civilian volunteers, either on the scene or after being carried into nearby homes. They were then driven to hospital, either in civilian cars or in ambulances. The first ambulances arrived at 4:28p.m. The three boys killed at the rubble barricade were driven to hospital by paratroopers. Witnesses said paratroopers lifted the bodies by the hands and feet and dumped them in the back of their armoured personnel carrier as if they were \"pieces of meat\". The Saville Report agreed that this is an \"accurate description of what happened\", saying the paratroopers \"might well have felt themselves at risk, but in our view this does not excuse them\".\n\nCasualties\n\nIn all, 26 people were shot by the paratroopers; thirteen died on the day and another died of his injuries four months later. The dead were killed in four main areas: the rubble barricade across Rossville Street, the car park of Rossville Flats (on the north side of the flats), the forecourt of Rossville Flats (on the south side), and the car park of Glenfada Park.\n\nAll of the soldiers responsible insisted that they had shot at, and hit, gunmen or bomb-throwers. No soldier said he missed his target and hit someone else by mistake. The Saville Report concluded that all of those shot were unarmed and that none were posing a serious threat. It also concluded that none of the soldiers fired in response to attacks, or threatened attacks, by gunmen or bomb-throwers.\n\nThe casualties are listed in the order in which they were killed.\n\nJohn \"Jackie\" Duddy, age 17. Shot as he ran away from soldiers in the car park of Rossville Flats. The bullet struck him in the shoulder and entered his chest. Three witnesses said they saw a soldier take deliberate aim at the youth as he ran. He was the first fatality on Bloody Sunday. Both Saville and Widgery concluded that Duddy was unarmed.\nMichael Kelly, age 17. Shot in the stomach while standing at the rubble barricade on Rossville Street. Both Saville and Widgery concluded that Kelly was unarmed. The Saville Inquiry concluded that 'Soldier F' shot Kelly.\nHugh Gilmour, age 17. Shot as he ran away from soldiers near the rubble barricade. The bullet went through his left elbow and entered his chest. Widgery acknowledged that a photograph taken seconds after Gilmour was hit corroborated witness reports that he was unarmed. The Saville Inquiry concluded that 'Private U' shot Gilmour.\nWilliam Nash, age 19. Shot in the chest at the rubble barricade. Three people were shot while apparently going to his aid, including his father Alexander Nash.\nJohn Young, age 17. Shot in the face at the rubble barricade, apparently while crouching and going to the aid of William Nash.\nMichael McDaid, age 20. Shot in the face at the rubble barricade, apparently while crouching and going to the aid of William Nash.\nKevin McElhinney, age 17. Shot from behind, near the rubble barricade, while attempting to crawl to safety.\nJames \"Jim\" Wray, age 22. Shot in the back while running away from soldiers in Glenfada Park courtyard. He was then shot again in the back as he lay mortally wounded on the ground. Witnesses, who were not called to the Widgery Tribunal, stated that Wray was calling out that he could not move his legs before he was shot the second time. The Saville Inquiry concluded that he was shot by 'Soldier F'. \nWilliam McKinney, age 26. Shot in the back as he attempted to flee through Glenfada Park courtyard. The Saville Inquiry concluded that he was shot by 'Soldier F'.\nGerard \"Gerry\" McKinney, age 35. Shot in the chest at Abbey Park. A soldier, identified as 'Private G', ran through an alleyway from Glenfada Park and shot him from a few yards away. Witnesses said that when he saw the soldier, McKinney stopped and held up his arms, shouting, \"Don't shoot! Don't shoot!\", before being shot. The bullet apparently went through his body and struck Gerard Donaghy behind him.\nGerard \"Gerry\" Donaghy, age 17. Shot in the stomach at Abbey Park while standing behind Gerard McKinney. Both were apparently struck by the same bullet. Bystanders brought Donaghy to a nearby house. A doctor examined him, and his pockets were searched for identification. Two bystanders then attempted to drive Donaghy to hospital, but the car was stopped at a British Army checkpoint. They were ordered to leave the car and a soldier drove it to a Regimental Aid Post, where an Army medical officer pronounced Donaghy dead. Shortly after, soldiers found four nail bombs in his pockets. The civilians who searched him, the soldier who drove him to the Army post, and the Army medical officer all said that they did not see any bombs. This led to claims that soldiers planted the bombs on Donaghy to justify the killings.\n\nPatrick Doherty, age 31. Shot from behind while attempting to crawl to safety in the forecourt of Rossville Flats. The Saville Inquiry concluded that he was shot by 'Soldier F', who came out of Glenfada Park. Doherty was photographed, moments before and after he died, by French journalist Gilles Peress. Despite testimony from 'Soldier F' that he had shot a man holding a pistol, Widgery acknowledged that the photographs show Doherty was unarmed, and that forensic tests on his hands for gunshot residue proved negative.\nBernard \"Barney\" McGuigan, age 41. Shot in the back of the head when he walked out from cover to help Patrick Doherty. He had been waving a white handkerchief to indicate his peaceful intentions. The Saville Inquiry concluded that he was shot by 'Soldier F'.\nJohn Johnston, age 59. Shot in the leg and left shoulder on William Street fifteen minutes before the rest of the shooting started. Johnston was not on the march, but on his way to visit a friend in Glenfada Park. He died on 16 June 1972; his death has been attributed to the injuries he received on the day. He was the only fatality not to die immediately or soon after being shot.\n\nAftermath\n\nThirteen people were shot and killed, with another wounded man dying subsequently, which his family believed was from injuries suffered that day. Apart from the soldiers, all eyewitnesses—including marchers, local residents, and British and Irish journalists present—maintain that soldiers fired into an unarmed crowd, or were aiming at fleeing people and those helping the wounded. No British soldier was wounded by gunfire or bombs, nor were any bullets or nail bombs recovered to back up their claims. The British Army's version of events, outlined by the Ministry of Defence and repeated by Home Secretary Reginald Maudling in the House of Commons the day after Bloody Sunday, was that paratroopers returned fire at gunmen and bomb-throwers. Bernadette Devlin, the independent Irish socialist republican Member of Parliament (MP) for Mid Ulster, slapped Maudling for his comments, and was temporarily suspended from Parliament. Having seen the shootings firsthand, she was infuriated that the Speaker of the House of Commons, Selwyn Lloyd, repeatedly denied her the chance to speak about it in Parliament, although convention decreed that any MP witnessing an incident under discussion would be allowed to do so.\n\nOn Wednesday 2 February 1972, tens of thousands attended the funerals of eleven of the victims. In the Republic of Ireland it was observed as a national day of mourning, and there was a general strike, the biggest in Europe since the Second World War relative to population. Memorial services were held in Catholic and Protestant churches, as well as synagogues, throughout the Republic, while schools closed and public transport stopped running. Large crowds had besieged the chancery of the British embassy on Merrion Square in Dublin, and embassy staff had been evacuated. That Wednesday, tens of thousands of protesters marched to the chancery and thirteen symbolic coffins were placed outside the entrance. The Union Jack was burnt and the building was attacked with stones and petrol bombs. The outnumbered Gardaí tried to push back the crowd, but the building was burnt down. Anglo-Irish relations hit one of their lowest ebbs with the Irish Minister for Foreign Affairs, Patrick Hillery, going to the United Nations Security Council to demand the involvement of a UN peacekeeping force in the Northern Ireland conflict. Kieran Conway, the head of the IRA's intelligence-gathering department for a period in the 1970s, stated in his memoir that after the massacre, the IRA Southern Command in Dublin received up to 200 applications from Southern Irish citizens to fight the British.\n\nHarold Wilson, then the Leader of the Opposition in the House of Commons, reiterated his belief that a united Ireland was the only possible solution to Northern Ireland's Troubles. William Craig, then Stormont Home Affairs Minister, suggested that the west bank of Derry should be ceded to the Republic of Ireland.\n\nOn 22 February 1972, the Official IRA attempted to retaliate for Bloody Sunday by detonating a car bomb at Aldershot military barracks, headquarters of 16th Parachute Brigade, killing seven ancillary staff.\n\nAn inquest into the deaths was held in August 1973. The city's coroner, Hubert O'Neill, a retired British Army major, issued a statement at the completion of the inquest. He declared:\n\nShankill shootings\nSeveral months after Bloody Sunday, 1 Para—again under Lt Col Wilford's command—were involved in another controversial shooting incident. On 7 September, paratroopers raided the headquarters of the Ulster Defence Association (UDA) and houses in the Shankill area of Belfast. Two Protestant civilians were shot dead and others wounded by the paratroopers, who claimed they were returning fire at loyalist gunmen. This sparked angry demonstrations by local Protestants, and the UDA declared: \"Never has Ulster witnessed such licensed sadists and such blatant liars as the 1st Paras. These gun-happy louts must be removed from the streets\". A unit of the British Army's Ulster Defence Regiment refused to carry out duties until 1 Para was withdrawn from the Shankill.\n\nAt the end of 1972, Wilford, who was directly in charge of the soldiers involved in Bloody Sunday and Shankill, was appointed an Officer of the Order of the British Empire (OBE).\n\nWidgery Inquiry\nTwo days after Bloody Sunday, the British Parliament adopted a resolution for a tribunal into the shootings, resulting in Prime Minister Edward Heath commissioning the Lord Chief Justice, Lord Widgery, to undertake it. Many witnesses intended to boycott the tribunal as they lacked faith in Widgery's impartiality, but many were eventually persuaded to take part.\n\nWidgery's quickly-produced report—completed within ten weeks (on 10 April) and published within eleven weeks (on 19 April)—supported the British Army's account of the events of the day. It stated that the soldiers returned fire at gunmen and bomb-throwers. It said \"None of the deceased or wounded is proved to have been shot whilst handling a firearm or bomb. Some are wholly acquitted of complicity in such action; but there is a strong suspicion that some others had been firing weapons or handling bombs\". Among the evidence presented to the tribunal were the results of paraffin tests, used to identify lead residues from firing weapons, and that nail bombs had been found on the body of one of those killed. Tests for traces of explosives on the clothes of eleven of the dead proved negative, while those of the remaining man could not be tested as they had already been washed. It has been argued that firearms residue on some victims may have come from contact with the soldiers themselves who moved some of the bodies, or that lead residue on the hands of one (James Wray) was easily explained by the fact that his occupation involved using lead-based solder. Widgery held the march organisers responsible, concluding \"There would have been no deaths [...] if those who organised the illegal march had not thereby created a highly dangerous situation\".\n\nWidgery stated there was no evidence the paratroopers were sent to \"flush out any IRA gunmen in the Bogside\" or to punish its residents for opposing the British Army. The Saville Inquiry also trawled classified documents and found no evidence of such a plan, but said \"It is of course possible for plans to be hatched in secret and kept out of documents\".\n\nMost witnesses to the event disputed the report's conclusions and regarded it as a whitewash, the slogan, \"Widgery washes whiter\" – a play on the contemporary advertisement for Daz soap powder – emblazoned on walls in Derry, crystallised the views of many nationalists about the report.\n\nIn 1992, British Prime Minister John Major, replying to John Hume's request for a new public inquiry, stated: \"The Government made clear in 1974 that those who were killed on 'Bloody Sunday' should be regarded as innocent of any allegation that they were shot whilst handling firearms or explosives\". Major was succeeded by Tony Blair. Blair's chief aide, Jonathan Powell, later described Widgery as a \"complete and utter whitewash\".\n\nSaville Inquiry\n\nIn 1998, during the latter stages of the Northern Ireland peace process, Prime Minister Blair agreed to hold a public inquiry into Bloody Sunday. The inquiry, chaired by Lord Saville, was established in April 1998. The other judges were John Toohey, a former Justice of the High Court of Australia who had worked on Aboriginal issues (he replaced New Zealander Sir Edward Somers, who retired from the Inquiry in 2000 for personal reasons), and William Hoyt, former Chief Justice of New Brunswick and member of the Canadian Judicial Council. The inquiry heard testimony at the Guildhall in Derry from March 2000 until November 2004. The Saville Inquiry was much more comprehensive than the Widgery Tribunal, interviewing a wide range of witnesses including local residents, soldiers, journalists and politicians, and reviewing large amounts of photographs and footage. Lord Saville declined to comment on the Widgery report and made the point that this was a judicial inquiry into Bloody Sunday, not the Widgery Tribunal.\n\nColonel Wilford expressed anger at the decision to hold the inquiry and said he was proud of his actions on Bloody Sunday. Two years later, in 2000, Wilford said: \"There might have been things wrong in the sense that some innocent people, people who were not carrying a weapon, were wounded or even killed. But that was not done as a deliberate malicious act. It was done as an act of war\". In 2007, General (then Captain) Sir Mike Jackson, adjutant of 1 Para on Bloody Sunday, said: \"I have no doubt that innocent people were shot\". This was in sharp contrast to his insistence, for more than thirty years, that those killed had not been innocent.\n\nOne former paratrooper testified that a lieutenant told them the night before Bloody Sunday: \"Let's teach these buggers a lesson - we want some kills tomorrow\". He did not see anyone with a weapon nor hear any explosions, and said some fellow soldiers were thrilled and were shooting out of bravado or frustration. The paratrooper said several soldiers \"fired their own personal supply of dum-dums\", which were banned, and that one \"fired 10 dum-dums into the crowd but as he still had his official quota he got away with saying he never fired a shot\". Furthermore, the paratrooper said his original statement to the Widgery Inquiry was torn up and replaced by one \"bearing no relation with fact\".\n\nMany observers allege that the Ministry of Defence (MoD) acted in a way to impede the inquiry. Over 1,000 Army photographs and original Army helicopter video footage were never made available. Furthermore, guns used by the soldiers on Bloody Sunday, which could have been evidence in the inquiry, were lost by the MoD. The MoD claimed all the guns had been destroyed, but some were later recovered in various locations (such as Sierra Leone and Beirut) despite the obstruction.\n\nBy the time the inquiry had retired to write up its findings it had interviewed over 900 witnesses over seven years, making it the biggest investigation in British legal history. It was also the longest and most expensive, taking twelve years and costing . The inquiry was expected to report in late 2009 but was delayed until after the 2010 general election.\n\nReport\nThe report of the inquiry was published on 15 June 2010. It concluded, \"The firing by soldiers of 1 PARA on Bloody Sunday caused the deaths of 13 people and injury to a similar number, none of whom was posing a threat of causing death or serious injury\". It stated that British paratroopers \"lost control\", shooting fleeing civilians and those who tried to help the wounded. The civilians had not been warned by soldiers that they intended to shoot. Contrary to the soldiers' claims, the report concluded that the victims were unarmed, and no nail bombs or petrol bombs were thrown. \"None of them fired in response to attacks or threatened attacks by nail or petrol bombers\". It stated that while some soldiers probably fired out of fear and recklessness, others did not, and fired at civilians they knew were unarmed. The report stated that soldiers had concocted lies in attempting to hide their acts. Soldier H, who fired the most bullets, claimed to have fired 19 separate shots at a gunman behind a frosted glass window, but missed each time, and suggested all the bullets had gone through the same hole.\n\nThe inquiry concluded that an Official IRA sniper, positioned in a block of flats, fired one round at British soldiers, who were at the Presbyterian church on the other side of William Street. The bullet missed the soldiers and hit a drainpipe. The inquiry concluded that it was fired shortly after the British soldiers had shot Damien Donaghey and John Johnston in this area. It rejected the sniper's account that he fired in reprisal, concluding that he and another Official IRA member had already been in position and probably fired simply because the opportunity presented itself. The inquiry also concluded an Official IRA member fired a handgun at a British APC from behind a gable wall near Rossville Flats, but there is no evidence the soldiers noticed this. The IRA member said he fired three rounds in anger after seeing civilians shot. He was seen by Father Edward Daly and others, who shouted at him to stop.\n\nMartin McGuinness, a senior member of Sinn Féin and later the deputy First Minister of Northern Ireland, stated in his testimony that he was second-in-command of the Provisional IRA Derry Brigade and was at the march. Paddy Ward told the inquiry he was the local leader of Fianna Éireann, the IRA youth wing, in January 1972. He claimed that McGuinness and another unnamed IRA member gave him bomb detonators on the morning of Bloody Sunday, with the intent to attack premises in Derry city centre that day. McGuinness rejected the claims as \"fantasy\", while Gerry O'Hara, a Sinn Féin councillor in Derry, stated that he, not Ward, was Fianna leader at the time. The inquiry was unsure of McGuinness's movements on the day. It stated that while he had probably been armed with a Thompson submachine gun, there was insufficient evidence to state whether he fired it, but concluded \"we are sure that he did not engage in any activity that provided any of the soldiers with any justification for opening fire\".\n\nRegarding the soldiers in charge on Bloody Sunday, the inquiry arrived at the following findings:\n\nLieutenant Colonel Derek Wilford: Commander of 1 Para and directly responsible for the arrest operation. Found to have 'deliberately disobeyed' his superior, Brigadier Patrick MacLellan, by sending Support Company into the Bogside (and without informing MacLellan).\nMajor Ted Loden: Commander in charge of Support Company, following orders from Lieutenant Colonel Wilford. Cleared of misconduct; the report stated that Loden \"neither realised nor should have realised that his soldiers were or might be firing at people who were not posing [...] a threat\". The inquiry found that Loden could not be held responsible for claims (whether malicious or not) by some of the soldiers that they had received fire from snipers.\nCaptain Mike Jackson: Adjutant of 1 Para on Bloody Sunday. Cleared of sinister actions for compiling the \"Loden List of Engagements\". This was a brief account of what soldiers told Major Loden about why they had fired. This list played a role in the Army's initial explanations. The list did not include soldiers' names. Jackson told the inquiry it was simply a record of shots fired, not an investigative document. While the inquiry found the compiling of the list was 'far from ideal', it accepted Jackson's explanations.\nMajor General Robert Ford: Commander of land forces in Northern Ireland and set the British strategy to oversee the march in Derry. Cleared of any fault, but his choice of 1 Para, and in particular his selection of Wilford to be in control of arresting rioters, was found to be disconcerting, as \"1 PARA was a force with a reputation for using excessive physical violence, which thus ran the risk of exacerbating the tensions between the Army and nationalists\".\nBrigadier Pat MacLellan: Overall operational commander of the day. Cleared of any wrongdoing as he believed Wilford would follow orders by arresting rioters and then returning to base, and could not be blamed for Wilford's actions.\nMajor Michael Steele: With MacLellan in the operations room and in charge of passing on the orders of the day. The inquiry accepted that Steele did not know there was no longer a separation between rioters and peaceful marchers.\na Lance Corporal referred to as \"Soldier F\" was found responsible for five of the killings on Bloody Sunday.\nIntelligence officers Colonel Maurice Tugwell, and Colin Wallace (an Army press officer): Cleared of wrongdoing. The inquiry concluded the information Tugwell and Wallace released through the media was not a deliberate attempt to deceive the public, but rather due to the inaccurate information received.\n\nReporting on the findings of the Saville Inquiry in the House of Commons, British Prime Minister David Cameron said:\nCameron added: \"you do not defend the British Army by defending the indefensible\". He acknowledged that all those who died were unarmed when they were killed, and that a British soldier had fired the first shots at civilians. He also said that this was not premeditated, though \"there was no point in trying to soften or equivocate\" as \"what happened should never, ever have happened\". Cameron then apologised on behalf of the British Government, saying he was \"deeply sorry\". A survey by Angus Reid Public Opinion in June 2010 found that 61 per cent of Britons and 70 per cent of Northern Irish agreed with Cameron's apology.\n\nStephen Pollard, a solicitor representing several of the soldiers, claimed that the report had cherry picked the evidence and did not have justification for its findings.\n\nMurder investigation\nFollowing the publication of the Saville Report, a murder investigation was begun by the Police Service of Northern Ireland's Legacy Investigation Branch. On 10 November 2015, a 66-year-old former member of the Parachute Regiment was arrested for questioning over the deaths of William Nash, Michael McDaid and John Young. He was released on bail shortly after.\n\nThe Public Prosecution Service for Northern Ireland announced in March 2019 that there was enough evidence to prosecute \"Soldier F\" for the murders of James Wray and William McKinney, both of whom were shot in the back. He was also charged with four attempted murders. The Saville Inquiry concluded, based on the evidence, that \"Soldier F\" also killed Michael Kelly, Patrick Doherty and Barney McGuigan, but evidence from the inquiry was inadmissible to the prosecution and \"the only evidence capable of identifying the soldier who fired the relevant shots came from Soldier F's co-accused, Soldier G, who is deceased\".\n\nRelatives of the Bloody Sunday victims expressed dismay that only one soldier would face trial for some of the killings. In September 2020, it was ruled that there would be no charges against any other soldiers. The victims' relatives were supported by Irish nationalist political representatives. \"Soldier F\" received support from some Ulster loyalists and from the group Justice for Northern Ireland Veterans. The Democratic Unionist Party (DUP) called for former British soldiers to be given immunity from prosecution. Ulster Unionist Party (UUP) leader and former soldier, Doug Beattie, said that if soldiers \"went outside the law, then they have to face the law\".\n\nIn July 2021, the Public Prosecution Service decided it would no longer prosecute \"Soldier F\" because statements from 1972 were deemed inadmissible as evidence. On 13 July 2021 Social Democratic and Labour Party MP Colum Eastwood revealed the name of \"Soldier F\" using parliamentary privilege. On 17 July Village magazine published the identity of \"Soldier F\" and some pictures of him at the time of the massacre.\n\nIn March 2022, the High Court overturned the decision not to press charges against \"Soldier F\" following an appeal by the family of William McKinney and ordered the Public Prosecution Service to reconsider the case. The PPS subsequently appealed the court's decision to the Supreme Court of the United Kingdom, but permission to appeal was refused that September and the PPS were forced to continue with the prosecution. In October 2022, it was announced that the committal hearing against \"Soldier F\" would resume on 16 January 2023. On 24 January 2023 the case against \"Soldier F\" was resumed at Derry Magistrate's Court. Following an adjournment, the case resumed on 26 May 2023. On 25 August 2023 Judge Ted Magill ruled that five statements given to the Widgery Report implicating \"Soldier F\" could be used as evidence at trial.\n\nImpact on Northern Ireland divisions\nWhen it was first deployed on duty in Northern Ireland, the British Army was welcomed by many Catholics as a neutral force there to protect them from Protestant loyalist mobs, the RUC and the B-Specials. After Bloody Sunday many Catholics turned on the British Army, seeing it no longer as their protector but as their enemy. Young nationalists became increasingly attracted to armed republican groups. With the Official IRA and Official Sinn Féin having moved away from mainstream Irish republicanism towards Marxism, the Provisional IRA began to win the support of newly radicalised, disaffected youth.\n\nIn the following twenty years, the Provisional IRA and other smaller republican groups such as the Irish National Liberation Army stepped up their armed campaigns against the state and those seen as being in service to it. With rival paramilitary organisations appearing in both the republican and loyalist communities (such as the UDA, Ulster Volunteer Force (UVF), etc. on the loyalist side), the Troubles cost the lives of thousands of people.\n\nIn 1979, the Provisional IRA killed 18 British soldiers in the Warrenpoint ambush, most of them paratroopers. This happened the same day the IRA assassinated Lord Mountbatten. Republicans portrayed the attack as belated retaliation for Bloody Sunday, with graffiti declaring \"13 gone and not forgotten, we got 18 and Mountbatten\".\n\nIn 2012 a serving British soldier from Belfast was charged with inciting hatred, due to their use of online social media to post sectarian slurs about the killings along with banners of the Parachute Regiment.\n\nIn recent years, Parachute Regiment flags have been erected by some loyalists around the time of the Bloody Sunday anniversaries. In January 2013, shortly before the yearly Bloody Sunday remembrance march, several Parachute Regiment flags were flown in loyalist areas of Derry. The flying of the flags was condemned by nationalist politicians and relatives of the Bloody Sunday dead. The MoD also condemned the flying of the flags. The flags were replaced by Union Jacks. Later that year, the Parachute Regiment flag was flown alongside other loyalist flags in other parts of Northern Ireland. In 2014, loyalists erected the flags near the route of a Saint Patrick's Day parade in Cookstown.\n\nArtistic reaction\n\nPaul McCartney (who is of Irish descent) recorded the first song in response only two days after the incident. The single, entitled \"Give Ireland Back to the Irish\", expressed his views on the matter. This song was one of few McCartney released with Wings to be banned by the BBC.\n\nThe 1972 John Lennon album Some Time in New York City features a song entitled \"Sunday Bloody Sunday\", inspired by the incident, as well as the song \"The Luck of the Irish\", which dealt more with the Irish conflict in general. Lennon, who was of Irish descent, also spoke at a protest in New York in support of the victims and families of Bloody Sunday.\n\nIrish poet Thomas Kinsella's 1972 poem Butcher's Dozen is a satirical and angry response to the Widgery Tribunal and the events of Bloody Sunday.\n\nBlack Sabbath's Geezer Butler (also of Irish descent) wrote the lyrics to the Black Sabbath song \"Sabbath Bloody Sabbath\" on the album of the same name in 1973. Butler stated, \"…the Sunday Bloody Sunday thing had just happened in Ireland, when the British troops opened fire on the Irish demonstrators… So I came up with the title 'Sabbath Bloody Sabbath', and sort of put it in how the band was feeling at the time, getting away from management, mixed with the state Ireland was in.\"\n\nThe Roy Harper song \"All Ireland\" from the album Lifemask, written in the days following the incident, is critical of the military but takes a long-term view with regard to a solution. In Harper's book (The Passions of Great Fortune), his comment on the song ends \"…there must always be some hope that the children of 'Bloody Sunday', on both sides, can grow into some wisdom\".\n\nBrian Friel's 1973 play The Freedom of the City deals with the incident from the viewpoint of three civilians.\n\nIrish poet Seamus Heaney's Casualty (published in Field Work, 1981) criticises Britain for the death of his friend.\n\nThe Irish rock band U2 commemorated the incident in their 1983 protest song \"Sunday Bloody Sunday\".\n\nChristy Moore's song \"Minds Locked Shut\" on the album Graffiti Tongue is all about the events of the day, and names the dead civilians.\n\nThe events of the day have been dramatised in two 2002 television films, Bloody Sunday (starring James Nesbitt) and Sunday by Jimmy McGovern.\n\nThe Celtic metal band Cruachan addressed the incident in a song \"Bloody Sunday\" from their 2002 album Folk-Lore.\n\nWillie Doherty, a Derry-born artist, has amassed a large body of work which addresses the troubles in Northern Ireland. \"30 January 1972\" deals specifically with the events of Bloody Sunday.\n\nIn mid-2005, the play Bloody Sunday: Scenes from the Saville Inquiry, a dramatisation based on the Saville Inquiry, opened in London, and subsequently travelled to Derry and Dublin. The writer, journalist Richard Norton-Taylor, distilled four years of evidence into two hours of stage performance at the Tricycle Theatre. The play received glowing reviews in all the British broadsheets, including The Times: \"The Tricycle's latest recreation of a major inquiry is its most devastating\"; The Daily Telegraph: \"I can't praise this enthralling production too highly… exceptionally gripping courtroom drama\"; and The Independent: \"A necessary triumph\".\n\nIn October 2010, T with the Maggies released the song \"Domhnach na Fola\" (Irish for \"Bloody Sunday\"), written by Mairéad Ní Mhaonaigh and Tríona Ní Dhomhnaill on their debut album.\n\nNotes\n\nReferences\n\nBibliography\n\n (extracts available online)\n\nEnglish, Richard. Armed Struggle;– A History of the IRA, MacMillan, London 2003,\n\nExternal links\n\nMadden & Finucane Bloody Sunday index\nCAIN Web Service Bloody Sunday index\nUTV Coverage: Bloody Sunday & The Saville Report\nGuardian Coverage\nDáil debate on Bloody Sunday\nThe Widgery Report (from Cain website)\nBBC Special Report\nProgramme of events commemorating Bloody Sunday – 2008 \n1610: Soldiers open fire\n\nThe events of the day\nBBC Interactive Guide\nGuardian Interactive Guide\nHistory – Bloody Sunday – Events of the Day Museum of Free Derry\n\nContemporary newspaper coverage\n\"13 killed as paratroops break riot\" from The Guardian, Monday 31 January 1972\n\"Bogsiders insist that soldiers shot first\" from The Guardian, Tuesday 1 February 1972\n\nImportance and impact\n\"Shootings 'triggered decades of violence'\" from The Guardian, Wednesday 16 May 2001\nBritain Acknowledges \"Bloody Sunday\" Killings Were Unjustified and Apologizes to Victims' Families – video report by Democracy Now!\n\n1970s in County Londonderry\n1972 in Northern Ireland\n1972 murders in the United Kingdom\n20th century in Derry (city)\nBritish Army in Operation Banner\nDeaths by firearm in Northern Ireland\n1972 crimes\nJanuary 1972 events\nJanuary 1972 events in the United Kingdom\nMassacres committed by the United Kingdom\nHuman rights abuses in the United Kingdom\nMassacres in Northern Ireland\nMassacres in 1972\nMilitary actions and engagements during the Troubles (Northern Ireland)\nMilitary history of County Londonderry\nMilitary scandals\nParachute Regiment (United Kingdom)\nProtest-related deaths\nProtests in Northern Ireland\nThe Troubles in Derry (city)\nMassacres of Catholics\nPolitical repression in the United Kingdom"
}