{
  "title": "Party whip (Canada)",
  "content": "In Canada, a party whip is the member of a political party in the House of Commons of Canada, the Senate of Canada or a provincial legislative assembly charged with ensuring party discipline among members of that party's caucus. The whip is also responsible for assigning offices and scheduling speakers from his or her party for various bills, motions and other proceedings in the legislature.\n\nResponsibilities\nA party whip works to ensure that the number of party members in the legislature or at committee meetings is adequate to win a vote if one is called. When a vote is called in the legislature, division bells ring until the whips for each party are satisfied that there are sufficient members of their own party present for the vote to proceed.\n\nThe whip's role is especially important when there is a minority government or if the government has a slim majority, as the absence of a handful of members during a confidence vote could result in the defeat of the government. Party discipline is strict in Canada, and party members are expected to vote with the rest of their party in all but a few designated free votes.\n\nUse in Canadian government\nJames E. Walker, Chief Government Whip from 1963 to 1966, commented: \"Once you get beyond the taxicab radius of Ottawa, nobody seems to have heard of a Whip. For that matter, nobody in Ottawa, three blocks from the Hill, has ever heard of the Whip either!\"\n\nThe post of Chief Government Whip is not a cabinet-level position. However, the Chief Government Whip may receive a concurrent appointment, such as minister without portfolio or Minister of State, and sit in cabinet by virtue of that position.\n\nFor a time, the Reform Party of Canada publicly styled its parliamentary whip with the title of Caucus Coordinator rather than Whip.\n\nCurrent Whips\n\nSenate\n Government Liaison in the Senate: Patti LaBoucane-Benson\n Opposition Whip in the Senate: Judith Seidman\n\nHouse of Commons\n Chief Government Whip: Steven MacKinnon\n Deputy Government Whip: Ruby Sahota\n Chief Opposition Whip:  Kerry-Lynne D. Findlay\n Deputy Chief Opposition Whip: Chris Warkentin\n Bloc Québécois Whip: Claude DeBellefeuille\n NDP Whip: Rachel Blaney\n\nList of Chief Government Whips\n\nSee also\nChief Whip\nParty whip (Australia)\n\nReferences\n\nExternal links\n List of Chief Government and Opposition Whips\n\nParliament of Canada\nPolitical whips"
}