{
  "title": "Politics of Canada",
  "content": "The politics of Canada function within a framework of  parliamentary democracy and a federal system of parliamentary government with strong democratic traditions. Canada is a constitutional monarchy, in which the monarch is head of state.  In practice, the executive powers are directed by the Cabinet, a committee of ministers of the Crown responsible to the elected House of Commons of Canada and chosen and headed by the Prime Minister of Canada.\n\nCanada is described as a \"full democracy\", with a tradition of liberalism, and an egalitarian, moderate political ideology. Extremism has never been prominent in Canadian politics. The traditional \"brokerage\" model of Canadian politics leaves little room for ideology. Peace, order, and good government, alongside an Implied Bill of Rights, are founding principles of the Canadian government. An emphasis on social justice has been a distinguishing element of Canada's political culture. Canada has placed emphasis on diversity, equity and inclusiveness for all its people.\n\nThe country has a multi-party system in which many of its legislative practices derive from the unwritten conventions of and precedents set by the Westminster parliament of the United Kingdom. The two dominant political parties in Canada have historically been the current Liberal Party of Canada and the Conservative Party of Canada (as well as its numerous predecessors). Parties like the New Democratic Party, the Quebec nationalist Bloc Québécois and the Green Party of Canada have grown in prominence, exerting their own influence to the political process.\n\nCanada has evolved variations: party discipline in Canada is stronger than in the United Kingdom, and more parliamentary votes are considered motions of confidence, which tends to diminish the role of non-Cabinet members of parliament (MPs). Such members, in the government caucus, and junior or lower-profile members of opposition caucuses, are known as backbenchers. Backbenchers can, however, exert their influence by sitting in parliamentary committees, like the Public Accounts Committee or the National Defence Committee.\n\nContext\n\nCanada's governmental structure was originally established by the British Parliament through the British North America Act, 1867 (now the Constitution Act, 1867), but the federal model and division of powers were devised by Canadian politicians. Particularly after World War I, citizens of the self-governing Dominions, such as Canada, began to develop a strong sense of identity, and, in the Balfour Declaration of 1926, the British government and the governments of the six Dominions jointly agreed that the Dominions had full autonomy within the British Commonwealth.\n\nIn 1931, after further consultations and agreements between the British government and the governments of the Dominions, the British Parliament passed the Statute of Westminster, giving legal recognition to the autonomy of Canada and other Dominions. However, Canadian politicians were unable to obtain consensus on a process for amending the constitution, which was therefore not affected by the Statute of Westminster, meaning amendments to Canada's constitution continued to require the approval of the British parliament until that date. Similarly, the Judicial Committee of the Privy Council in Britain continued to make the final decision on criminal appeals until 1933 and on civil appeals until 1949.  It was not until 1982, with the Patriation of the Constitution, that the role of the British Parliament was ended.\n\nPolitical culture\n\nCanada's egalitarian approach to governance has emphasized social welfare, economic freedom, and multiculturalism, which is based on selective economic migrants, social integration, and suppression of far-right politics, that has wide public and political support. Its broad range of constituent nationalities and policies that promote a \"just society\" are constitutionally protected. Individual rights, equality and inclusiveness (social equality) have risen to the forefront of political and legal importance for most Canadians, as demonstrated through support for the Charter of Rights and Freedoms, a relatively free economy, and social liberal attitudes toward women's rights (like pregnancy termination), homosexuality,  euthanasia or cannabis use. There is also a sense of collective responsibility in Canadian political culture, as is demonstrated in general support for universal health care, multiculturalism, evolution, gun control, foreign aid, and other social programs.\n\nAt the federal level, Canada has been dominated by two relatively centrist parties practising brokerage politics\", the centre-left leaning Liberal Party of Canada and the centre-right leaning Conservative Party of Canada (or its predecessors). \"The traditional brokerage model of Canadian politics leaves little\nroom for ideology\" as the Canadian catch-all party system requires support from a broad spectrum of voters. The historically predominant Liberals position themselves at the centre of the political scale,  with the Conservatives sitting on the right and the New Democratic Party occupying the left. Five parties had representatives elected to the federal parliament in the 2021 election: the Liberal Party who currently form the government, the Conservative Party who are the Official Opposition, the New Democratic Party, the Bloc Québécois, and the Green Party of Canada.\n\nGovernmental organization\n\n Type of government  Westminster style federal parliamentary democracy within a constitutional monarchy.\n\n Administrative divisions  Ten provinces and three territories*: Alberta, British Columbia, Manitoba, New Brunswick, Newfoundland and Labrador, Northwest Territories*, Nova Scotia, Nunavut*, Ontario, Prince Edward Island, Quebec, Saskatchewan, Yukon*.\n\n Constitution  Westminster system, based on unwritten conventions and written legislation.\n\n Legal system  English common law for all matters within federal jurisdiction and in all provinces and territories except Quebec, which is based on the civil law, based on the Custom of Paris in pre-revolutionary France as set out in the Civil Code of Quebec; accepts compulsory International Court of Justice jurisdiction, with reservations.\n\n Suffrage  Citizens aged 18 years or older. Only two adult citizens in Canada cannot vote: the Chief Electoral Officer, and the Deputy Chief Electoral Officer. The Governor General is eligible to vote, but abstains due to constitutional convention.\n\nMonarchy\n Head of state Charles III, King of Canada (since September 8, 2022).\n\n Viceroy Mary Simon, Governor General of Canada (since July 26, 2021).\n\nExecutive power\n\n Head of government Justin Trudeau, Prime Minister of Canada (since November 4, 2015).\n\n Cabinet Ministers (usually around thirty) chosen by the prime minister and appointed by the governor general to lead various ministries and agencies, generally with regional representation. Traditionally most, if not all, cabinet ministers will be members of the leader's own party in the House of Commons or Senate (see Cabinet of Canada); however this is not legally or constitutionally mandated, and occasionally, the prime minister will appoint a cabinet minister from another party.\n\n Elections  The monarchy is hereditary. The governor general is appointed by the monarch on the advice of the Prime Minister for a non-specific term, though it is traditionally approximately five years. Following legislative elections, the leader of the majority party in the House of Commons is usually designated by the governor general to become Prime Minister.\n\nLegislative power\nThe bicameral Parliament of Canada consists of three parts: the monarch, the Senate, and the House of Commons.\n\nCurrently, the Senate, which is frequently described as providing regional representation, has 105 members appointed by the Governor-General on the advice of the Prime Minister to serve until age 75. It was created with equal representation from the three regions of Ontario, Quebec, and the Maritimes (originally New Brunswick and Nova Scotia, expanded in 1873 to include Prince Edward Island).  In 1915, a new Western division was created, with six senators from each of the four western provinces, so that each of the four regions had 24 seats in the Senate.  When Newfoundland and Labrador joined Confederation in 1949, it was not included in an existing region and was assigned six seats.  Each of the three territories has one seat. It is not based on representation-by-population. The normal number of senators can be exceeded by the monarch on the advice of the Prime Minister, as long as the additional senators are distributed equally with regard to region (up to a total of eight additional Senators). This power of additional appointment has only been used once, when Prime Minister Brian Mulroney petitioned Queen Elizabeth II to add eight seats to the Senate so as to ensure the passage of the Goods and Services Tax legislation.\n\nThe House of Commons currently has 338 members elected in single-member districts in a plurality voting system (first past the post), meaning that members must attain only a plurality (the most votes of any candidate) rather than a majority. The electoral districts are also known as ridings.\n\nMandates cannot exceed five years; an election must occur by the end of this time. This fixed mandate has been exceeded only once, when Prime Minister Robert Borden perceived the need to do so during World War I. A constitutional amendment was passed, extending the life of the Parliament by one year, by the unanimous consent of the House of Commons. The size of the House and apportionment of seats to each province is revised after every census, conducted every five years, and is based on population changes and approximately on representation-by-population.\n\nElections and government formation\n\nCanadians vote for the election of their local member of parliament (MP) only. A vote is cast directly for a candidate. The candidate in each riding who receives a plurality of votes (first-past-the-post system) is elected. An MP need not be a member of any political party: such MPs are known as independents. When a number of MPs share political opinions they may form a body known as a political party.\n\nThe Canada Elections Act defines a political party as \"an organization one of whose fundamental purposes is to participate in public affairs by endorsing one or more of its members as candidates and supporting their election.\" Forming and registering a federal political party are two different things. There is no legislation regulating the formation of federal political parties. Elections Canada cannot dictate how a federal political party should be formed or how its legal, internal and financial structures should be established.\n\nMost parties elect their leaders in instant-runoff elections to ensure that the winner receives more than 50% of the votes. Normally the party leader stands as a candidate to be an MP during an election. This happens at leadership conventions. Canada's parliamentary system empowers political parties and their party leaders. Where one party gets a majority of the seats in the House of Commons, that party is said to have a \"majority government.\" Through party discipline, the party leader, who is elected in only one riding, exercises a great deal of control over the cabinet and the parliament.\n\nHistorically, the prime minister and senators are selected by the Governor General as a representative of the King, though in modern practice the monarch's duties are ceremonial. Consequently, the prime minister, while technically selected by the Governor General, is for all practical purposes selected by the party with the majority of seats. That is, the party that gets the most seats normally forms the government, with that party's leader becoming prime minister. The prime minister is not directly elected by the general population, although the prime minister is almost always directly elected as an MP within his or her constituency.\n\nOften the most popular party in an election takes a majority of the seats, even if it did not receive a majority of the vote. However, as there are usually three or more political parties represented in parliament, often no party takes a majority of the seats. A minority government occurs when the party that holds the most seats in the House of Commons holds fewer seats than the opposition parties combined. In this scenario, the party leader whose party has the most seats in the House is selected by the governor general to lead the government; however, for the government to survive and to pass laws, the leader chosen must have the support of the majority of the House, meaning they need the support of the elected members of at least one other party. This can be done on a case-by-case basis, through a coalition government (which has never been done in Canadian history) or through a confidence-and-supply agreement (such as the one the Liberals and the NDP signed in 2022).\n\nFederal-provincial relations\n\nAs a federation, the existence and powers of the federal government and the ten provinces are guaranteed by the Constitution. The Constitution Act, 1867 sets out the basic constitutional structure of the federal government and the provinces.  The powers of the federal Parliament and the provinces can only be changed by constitutional amendments passed by the federal and provincial governments. The Crown is the formal head of state of the federal government and each of the ten provinces, but rarely has any political role.  The governments are led by the representatives of the people:  elected by all Canadians, at the federal level, and by the Canadian citizens of each provinces, at the provincial level.\n\nFederal-provincial (or intergovernmental, formerly Dominion-provincial) relations is a regular issue in Canadian politics: Quebec wishes to preserve and strengthen its distinctive nature, western provinces desire more control over their abundant natural resources, especially energy reserves; industrialized Central Canada is concerned with its manufacturing base, and the Atlantic provinces strive to escape from being less affluent than the rest of the country.\n\nIn order to ensure that social programs such as health care and education are funded consistently throughout Canada, the \"have-not\" (poorer) provinces receive a proportionately greater share of federal \"transfer (equalization) payments\" than the richer, or \"have\", provinces do; this has been somewhat controversial. The richer provinces often favour freezing transfer payments, or rebalancing the system in their favour, based on the claim that they already pay more in taxes than they receive in federal government services, and the poorer provinces often favour an increase on the basis that the amount of money they receive is not sufficient for their existing needs.\n\nParticularly in the past decade, critics have argued that the federal government's exercise of its unlimited constitutional spending power has contributed to strained federal-provincial relations. This power allows the federal government to influence provincial policies, by offering funding in areas that the federal government cannot itself regulate. The federal spending power is not expressly set out in the Constitution Act, 1867; however, in the words of the Court of Appeal for Ontario the power \"can be inferred\" from s. 91(1A), \"the public debt and property\".\n\nA prime example of an exercise of the spending power is the Canada Health Act, which is a conditional grant of money to the provinces. Regulation of health services is, under the Constitution, a provincial responsibility. However, by making the funding available to the provinces under the Canada Health Act contingent upon delivery of services according to federal standards, the federal government has the ability to influence health care delivery.\n\nQuebec and Canadian politics\nExcept for three short-lived transitional or minority governments, prime ministers from Quebec led Canada continuously from 1968 to early 2006. People from Quebec led both Liberal and Progressive Conservative governments in this period.\n\nMonarchs, governors general, and prime ministers are now expected to be at least functional, if not fluent, in both English and French. In selecting leaders, political parties give preference to candidates who are fluently bilingual.\n\nBy law, three of the nine positions on the Supreme Court of Canada must be held by judges from Quebec. This representation makes sure that at least three judges have sufficient experience with the civil law system to treat cases involving Quebec laws.\n\nNational unity\n\nCanada has a long and storied history of secessionist movements (see Secessionist movements of Canada). National unity has been a major issue in Canada since the forced union of Upper and Lower Canada in 1840.\n\nThe predominant and lingering issue concerning Canadian national unity has been the ongoing conflict between the French-speaking majority in Quebec and the English-speaking majority in the rest of Canada. Quebec's continued demands for recognition of its \"distinct society\" through special political status has led to attempts for constitutional reform, most notably with the failed attempts to amend the constitution through the Meech Lake Accord and the Charlottetown Accord (the latter of which was rejected through a national referendum).\n\nSince the Quiet Revolution, sovereigntist sentiments in Quebec have been variably stoked by the patriation of the Canadian constitution in 1982 (without Quebec's consent) and by the failed attempts at constitutional reform. Two provincial referendums, in 1980 and 1995, rejected proposals for sovereignty with majorities of 60% and 50.6% respectively. Given the narrow federalist victory in 1995, a reference was made by the Chrétien government to the Supreme Court of Canada in 1998 regarding the legality of unilateral provincial secession. The court decided that a unilateral declaration of secession would be unconstitutional. This resulted in the passage of the Clarity Act in 2000.\n\nThe Bloc Québécois, a sovereigntist party which runs candidates exclusively in Quebec, was started by a group of MPs who left the Progressive Conservative (PC) party (along with several disaffected Liberal MPs), and first put forward candidates in the 1993 federal election. With the collapse of the PCs in that election, the Bloc and Liberals were seen as the only two viable parties in Quebec. Thus, prior to the 2006 election, any gain by one party came at the expense of the other, regardless of whether national unity was really at issue. The Bloc, then, benefited (with a significant increase in seat total) from the impressions of corruption that surrounded the Liberal Party in the lead-up to the 2004 election. However, the newly unified Conservative party re-emerged as a viable party in Quebec by winning 10 seats in the 2006 election.  In the 2011 election, the New Democratic Party succeeded in winning 59 of Quebec's 75 seats, successfully reducing the number of seats of every other party substantially. The NDP surge nearly destroyed the Bloc, reducing them to 4 seats, far below the minimum requirement of 12 seats for Official party status.\n\nNewfoundland and Labrador is also a problem regarding national unity. As the Dominion of Newfoundland was a self-governing country equal to Canada until 1949, there are large, though unco-ordinated, feelings of Newfoundland nationalism and anti-Canadian sentiment among much of the population. This is due in part to the perception of chronic federal mismanagement of the fisheries, forced resettlement away from isolated settlements in the 1960s, the government of Quebec still drawing inaccurate political maps whereby they take parts of Labrador, and to the perception that mainland Canadians look down upon Newfoundlanders. In 2004, the Newfoundland and Labrador First Party contested provincial elections and in 2008 in federal ridings within the province. In 2004, then-premier Danny Williams ordered all federal flags removed from government buildings as a result of lost offshore revenues to equalization clawbacks. On December 23, 2004, premier Williams made this statement to reporters in St. John's,\n\nWestern alienation is another national-unity-related concept that enters into Canadian politics. Residents of the four western provinces, particularly Alberta, have often been unhappy with a lack of influence and a perceived lack of understanding when residents of Central Canada consider \"national\" issues. While this is seen to play itself out through many avenues (media, commerce, and so on.), in politics, it has given rise to a number of political parties whose base constituency is in western Canada. These include the United Farmers of Alberta, who first won federal seats in 1917, the Progressives (1921), the Social Credit Party (1935), the Co-operative Commonwealth Federation (1935), the Reconstruction Party (1935), New Democracy (1940) and most recently the Reform Party (1989).\n\nThe Reform Party's slogan \"The West Wants In\" was echoed by commentators when, after a successful merger with the PCs, the successor party to both parties, the Conservative Party won the 2006 election. Led by Stephen Harper, who is an MP from Alberta, the electoral victory was said to have made \"The West IS In\" a reality. However, regardless of specific electoral successes or failures, the concept of western alienation continues to be important in Canadian politics, particularly on a provincial level, where opposing the federal government is a common tactic for provincial politicians. For example, in 2001, a group of prominent Albertans produced the Alberta Agenda, urging Alberta to take steps to make full use of its constitutional powers, much as Quebec has done.\n\nPolitical conditions\n\nCanada is considered by most sources to be a very stable democracy. In 2006, The Economist ranked Canada the third-most democratic nation in its Democracy Index, ahead of all other nations in the Americas and ahead of every nation more populous than itself. In 2008, Canada was ranked World No. 11 and again ahead of all countries more populous and ahead of other states in the Americas.\n\nMore recently, with the existence of strong third parties and first-past-the-post elections amongst other factors, Canada on a federal and provincial level has experienced huge swings in seat shares, where third parties (eg NDP, Reform) end up (usually briefly) replacing the Liberals, the Progressive Conservatives or the Conservatives as the main opposition or even the government and leaving them as a rump. Such examples federally include the 1993 federal election with the collapse of the Progressive Conservatives, and the 2011 election leaving the Liberal Party a (temporary) rump along with Bloc Québécois. Other examples include the changes of fortune for the Alberta NDP during the province's 2015 and 2019 elections, and possibly the 2018 Quebec elections with the rise of Coalition Avenir Québec taking government from the Liberals and Parti Québécois.\n\nOn a provincial level, in the legislatures of western provinces the NDP often is the left-leaning main party instead of that province's Liberal Party branch, the latter generally being a rump or smaller than the NDP. The other main party (right of the NDP) is either the Progressive Conservatives or their successor, or the Saskatchewan Party in Saskatchewan.\n\nParty systems \nAccording to recent scholars, there have been four party systems in [Canada] at the federal level since Confederation, each with its own distinctive pattern of social support, patronage relationships, leadership styles, and electoral strategies.  Political scientists disagree on the names and precise boundaries of the eras, however.  Steve Patten identifies four party systems in Canada's political history\n\nClarkson (2005) shows how the Liberal Party has dominated all the party systems, using different approaches. It began with a  \"clientelistic approach\" under Laurier, which evolved into a \"brokerage\" system of the 1920s, 1930s and 1940s under Mackenzie King. The 1950s saw the emergence of a \"pan-Canadian system\", which lasted until the 1990s. The 1993 election — categorized by Clarkson as an electoral \"earthquake\" which \"fragmented\" the party system, saw the emergence of regional politics within a four party-system, whereby various groups championed regional issues and concerns. Clarkson concludes that the inherent bias built into the first-past-the-post system, has chiefly benefited the Liberals.\n\nParty funding\nThe rules governing the funding of parties are designed to ensure reliance on personal contributions. Personal donations to federal parties and campaigns benefit from tax credits, although the amount of tax relief depends on the amount given. Also only people paying income taxes receive any benefit from this.\n\nThe rules are based on the belief that union or business funding should not be allowed to have as much impact on federal election funding as these are not contributions from citizens and are not evenly spread out between parties. The new rules stated that a party had to receive 2% of the vote nationwide in order to receive the general federal funding for parties. Each vote garnered a certain dollar amount for a party (approximately $1.75) in future funding. For the initial disbursement, approximations were made based on previous elections. The NDP received more votes than expected (its national share of the vote went up) while the new Conservative Party of Canada received fewer votes than had been estimated and was asked to refund the difference. Quebec was the first province to implement a similar system of funding many years before the changes to funding of federal parties.\n\nFederal funds are disbursed quarterly to parties, beginning at the start of 2005. For the moment, this disbursement delay leaves the NDP and the Green Party in a better position to fight an election, since they rely more on individual contributors than federal funds. The Green Party now receives federal funds, since it for the first time received a sufficient share of the vote in the 2004 election.\n\nIn 2007, news emerged of a funding loophole that \"could cumulatively exceed the legal limit by more than $60,000\", through anonymous recurrent donations of $200 to every riding of a party from corporations or unions. At the time, for each individual, the legal annual donation limit was $1,100 for each party, $1,100 combined total for each party's associations, and in an election year, an additional $1,100 combined total for each party's candidates. All three limits increase on 1 April every year based on the inflation rate.\n\nTwo of the biggest federal political parties in Canada experienced a drop in donations in 2020, in light of the COVID-19 pandemic impact on the global economy.\n\nPolitical parties, leaders and status\nOrdered by number of elected representatives in the House of Commons\nLiberal Party: Justin Trudeau, Prime Minister of Canada \nConservative Party: Pierre Poilievre, Leader of the Official Opposition\nBloc Québécois: Yves-François Blanchet\nNew Democratic Party: Jagmeet Singh\nGreen Party: Elizabeth May\n\nLeaders' debates\n\nLeaders' debates in Canada consist of two debates, one English and one French, both produced by a consortium of Canada's five major television broadcasters (CBC/SRC, CTV, Global and TVA) and usually consist of the leaders of all parties with representation in the House of Commons.\n\nThese debates air on the networks of the producing consortium as well as the public affairs and parliamentary channel CPAC and the American public affairs network C-SPAN.\n\nJudiciary\n\nThe highest court in Canada is the Supreme Court of Canada and is the final court of appeal in the Canadian justice system. The court is composed of nine judges: eight Puisne Justices and the Chief Justice of Canada. Justices of the Supreme Court of Canada are appointed by the Governor-in-Council. The Supreme Court Act limits eligibility for appointment to persons who have been judges of a superior court, or members of the bar for ten or more years. Members of the bar or superior judge of Quebec, by law, must hold three of the nine positions on the Supreme Court of Canada.\n\nGovernment departments and structure\nThe Canadian government operates the public service using departments, smaller agencies (for example, commissions, tribunals, and boards), and crown corporations. There are two types of departments: central agencies such as Finance, Privy Council Office, and Treasury Board Secretariat have an organizing and oversight role for the entire public service; line departments are departments that perform tasks in a specific area or field, such as the departments of Agriculture, Environment, or Defence.\n\nSignificant departments include Finance, Revenue, Human Resources and Skills Development, National Defence, Public Safety and Emergency Preparedness, and Foreign Affairs/International Trade.\n\nScholar Peter Aucoin, writing about the Canadian Westminster system, raised concerns in the early 2000s about the centralization of power; an increased number, role and influence of partisan-political staff; personal-politicization of appointments to the senior public service; and the assumption that the public service is promiscuously partisan for the government of the day.\n\nImmigration\nIn 1967, Canada established a point-based system to determine if immigrants should be eligible to enter the country, using meritorious qualities such as the applicant's ability to speak both French and English, their level of education, and other details that may be expected of someone raised in Canada. This system was considered ground-breaking at the time since prior systems were slanted on the basis of ethnicity. However, many foreign nationals still found it challenging to secure work after emigrating, resulting in a higher unemployment rate amongst the immigrant population. After winning power at the 2006 federal election, the Conservative Party sought to curb this issue by placing weight on whether or not the applicant has a standing job offer in Canada. The change has been a source of some contention as opponents argue that businesses use this change to suppress wages, with corporate owners leveraging the knowledge that an immigrant should hold a job to successfully complete the immigration process.\n\nElections\n\n Elections\n\n House of Commons: direct plurality representation (last election held October 21, 2019)\n Senate: appointed by the Governor General on the advice of the prime minister\n Election results\n\nSee also\n\n Conservatism in Canada\n Constitutional debate in Canada\n Fair Vote Canada\n Federal political financing in Canada\n Liberalism in Canada\n List of Canadian federal electoral districts\n List of Canadian federal general elections\n List of Canadian political scandals\n List of political parties in Canada\n Populism in Canada\n Republicanism in Canada\n Socialism in Canada\n\nNotes\n\nReferences\n\nFurther reading\n\n Argyle, Ray. Turning Points: The Campaigns That Changed Canada - 2011 and Before (2011) 440pp excerpt and text search ch. 1\n \n \n \n \n \n \n Hyde, Anthony (1997). Promises, Promises: Breaking Faith in Canadian Politics. Toronto: Viking. viii, 218 p. \n \n \n \n \n Pammett, Jon H., and Christopher Dornan, eds. The Canadian Federal Election of 2011 (2011) excerpt and text search; 386pp; essays by experts\n \n \n \n\n Political thought\n Katherine Fierlbeck, Political Thought in Canada: An Intellectual History, Broadview Press, 2006\n Ian McKay, Rebels, Reds, Radicals: Rethinking Canada's Left History, Between the Lines, 2006\n\nExternal links\n\n Canada Newsnet (formerly PoliWonk) - Extensive Canadian Politics news and resources\n Canadian-Politics.com  Comprehensive overview of politics in Canada\n CBC Digital Archives – Scandals, Boondoggles and White Elephants\n CBC Digital Archives – Campaigning for Canada\n Canadian Governments Compared\n Canadian Politics Online Digital Textbook\n\n \nPolitical history of Canada\nWestminster system"
}