{
  "title": "Renfrewshire (UK Parliament constituency)",
  "content": "Renfrewshire was a county constituency of the House of Commons of the Parliament of Great Britain from 1708 until 1801 and of the Parliament of the United Kingdom from 1801 to 1885.\n\nCreation\nThe British parliamentary constituency was created in 1708 following the Acts of Union, 1707 and replaced the former Parliament of Scotland shire constituency of Renfrewshire.\n\nBoundaries\nThe constituency covered the county of Renfrewshire, minus the parliamentary burgh of Renfrew throughout the 1708 to 1885 period, and minus the parliamentary burgh of Port Glasgow and the Paisley and Greenock constituencies from 1832 to 1885.\n\nThe burgh of Renfrew was a component of Glasgow Burghs until 1832, when it became a component of Kilmarnock Burghs. Port Glasgow became a parliamentary burgh in 1832, and another component of Kilmarnock Burghs.\n\nHistory\nThe constituency elected one Member of Parliament (MP) by the first past the post system until the seat was abolished in 1885.\n\nIn 1885 the Renfrewshire constituency area was divided into two new constituencies: Renfrewshire Eastern and Renfrewshire Western.\n\nMembers of Parliament\n\nElection results\n\nElections in the 1830s\n\nShaw-Stewart's death caused a by-election.\n\nElections in the 1840s\n\nStewart's death caused a by-election.\n\nElections in the 1850s\n\nMure resigned by accepting the office of Steward of the Chiltern Hundreds, causing a by-election.\n\nElections in the 1860s\n\nSpeirs' death caused a by-election.\n\nElections in the 1870s\nBruce was elevated to the peerage, becoming Lord Aberdare and causing a by-election.\n\nElections in the 1880s\n\nMure's death caused a by-election.\n\nReferences\n\nSources\n History of Parliament - constituencies\n\nHistoric parliamentary constituencies in Scotland (Westminster)\nConstituencies of the Parliament of the United Kingdom established in 1708\nConstituencies of the Parliament of the United Kingdom disestablished in 1885\nPolitics of Renfrewshire"
}