{
  "title": "Windfall tax",
  "content": "A windfall tax is a higher tax rate on profits that ensue from a sudden windfall gain to a particular company or industry. There have been windfall taxes in various countries across the world, including Australia, Italy, and Mongolia. Following the 2021–2023 global energy crisis, policy specialists at the International Monetary Fund recommended that governments institute windfall profits taxes targeted at economic rents in the energy sector, excluding renewable energy to prevent hindering its further development.\n\nAustralia\n\nIn Australia, windfall taxes include:\n Commonwealth places windfall tax, imposed under the Commonwealth Places Windfall Tax (Collection) Act 1998 (1998 No 25) and the Commonwealth Places Windfall Tax (Imposition) Act 1998 (1998 No 26)\n Franchise fees windfall tax, imposed under the Franchise Fees Windfall Tax (Collection) Act 1997 (1997 No 132), Franchise Fees Windfall Tax (Imposition) Act 1997 (1997 No 133), and Franchise Fees Windfall Tax (Consequential Amendments) Act 1997 (1997 No 134)\n\nIn both cases, windfall tax originates in High Court decisions that certain state taxes were unconstitutional. Thus, the States were required to repay to the taxpayers the amounts previously collected under these unconstitutional taxes. The purpose of the windfall taxes were to treat these repayments as income to the taxpayer, and impose a Commonwealth tax upon that income at a rate of 100%. Thus, even though the tax laws in question had been declared unconstitutional, the taxpayers effectively did not receive any repayments; rather, the amounts due back to them from the States were taxed by the Commonwealth. The Commonwealth would then repay these amounts to the States, with the result that the States were not in any financial disadvantage.\n\nMongolia\n\nMongolia implemented in 2006 taxation on the profits made by mining companies operating in Mongolia. A tax on unsmelted copper and gold concentrate produced in Mongolia, it was the highest windfall tax in the world. The tax was repealed in 2009 and phased out over two years. Repealing the 68% tax law was considered essential to enable foreign mining companies to invest in mineral resources development of Mongolia.\n\nUnited Kingdom\n\nIn the United Kingdom, an early one-off windfall tax was levied on certain bank deposits as part of the 1981 budget under Margaret Thatcher. In 1997, the government of Tony Blair introduced a Windfall Tax for privatised utility companies. In 2022, Boris Johnson's government announced a windfall tax for energy companies, to help fund a package to relieve the UK cost of living crisis.\n\nUnited States\nIn 1980, the United States enacted the Crude Oil Windfall Profit Tax Act (P.L. 96-223) as part of a compromise between the Carter Administration and the Congress over the decontrol of crude oil prices. The Act was intended to recoup the revenue earned by oil producers as a result of the sharp increase in oil prices brought about by the OPEC oil embargo. According to the Congressional Research Service, the Act's title was a misnomer.  \"Despite its name, the crude oil windfall profit tax... was not a tax on profits. It was an excise tax... imposed on the difference between the market price of oil, which was technically referred to as the removal price, and a statutory 1979 base price that was adjusted quarterly for inflation  and state severance taxes.\"\n\nCriticism\n\nIn a February 12, 2008, editorial titled \"Record Profits Mean Record Taxes\", Investor's Business Daily said that regular income taxes already take into account the high profits, and that there's no need to do anything extra to tax or punish the oil companies. As an example, the editorial states \"Consider the magnitude of the contributions from Exxon alone. On those 'outlandish' 2006 profits, the company paid federal income taxes of $27.9 billion, leaving it with $39.5 billion in after-tax income. That $27.9 billion was more than was collected from half of individual taxpayers in 2004. In that year, 65 million returns—which represent far more than 65 million taxpayers because of joint returns—paid $27.4 billion in federal income taxes.\"\n\nIn an August 4, 2008, editorial titled \"What Is a 'Windfall' Profit?\", The Wall Street Journal wrote: \"What is a 'windfall' profit anyway? ... Take Exxon Mobil, which on Thursday reported the highest quarterly profit ever and is the main target of any 'windfall' tax surcharge. Yet if its profits are at record highs, its tax bills are already at record highs too... Exxon's profit margin stood at 10% for 2007... If that's what constitutes windfall profits, most of corporate America would qualify... 51 Senators voted to impose a 25% windfall tax on a U.S.-based oil company whose profits grew by more than 10% in a single year... This suggests that a windfall is defined by profits growing too fast.... But if 10% is the new standard, the tech industry is going to have to rethink its growth arc... General Electric profits by investing in the alternative energy technology that President Obama says Congress should subsidize even more heavily than it already does. GE's profit margin in 2007 was 10.3%, about the same as profiteering Exxon's.\"  The profit margin listed in the article for General Electric included all of their diversified industries, of which energy technology is only one among many (such as aircraft engine manufacturing and media production), whereas ExxonMobil deals strictly with oil and gas and therefore has profits solely derived from oil and gas.\n\nScandinavia\nIn Sweden, hydro power is subject to a property tax and nuclear power to a capacity-based tax. Both taxes were raised at the beginning of 2008 due to higher windfall profits. Norway similarly imposed, as of 2009, a ground rent tax on hydro-electric power plants, and Finland announced its intention in 2009 to tax nuclear and hydro power as of 2010 or 2011.\n\nOn solar power\nRapid drop of photovoltaic equipment in the period 2011 to 2013 has created windfall profits conditions due to lagging response of regulators by adjustment of feed-in tariffs. Regulators in Spain, Greece, Bulgaria and Romania have introduced retroactive incentive reductions. In the Czech Republic a windfall tax has been introduced on solar electricity and further clampdown of solar power companies was considered in 2014.\n\nNotes\n\nReferences\n\nExternal links\n\nCorporate taxation\nCorporate taxation in the United Kingdom\nCorporate taxation in the United States"
}