{
  "title": "Bain-marie",
  "content": "A bain-marie (; ), also known as a water bath or double boiler, a type of heated bath, is a piece of equipment used in science, industry, and cooking to heat materials gently or to keep materials warm over a period of time. A bain-marie is also used to melt ingredients for cooking.\n\nHistory \n\nThe name comes from the French  or , in turn derived from the medieval Latin  and the Arabic , all meaning 'Mary's bath'. In his books, the 300 AD alchemist Zosimos of Panopolis credits for the invention of the device Mary the Jewess, an ancient alchemist. However, the water bath was known many centuries earlier (Hippocrates and Theophrastus).\n\nDescription \n\nThe double boiler comes in a wide variety of shapes, sizes, and types, but traditionally is a wide, cylindrical, usually metal container made of three or four basic parts:  a handle, an outer (or lower) container that holds the working fluid, an inner (or upper), smaller container that fits inside the outer one and which holds the material to be heated or cooked, and sometimes a base underneath. Under the outer container of the bain-marie (or built into its base) is a heat source.\n\nTypically, the inner container is immersed about halfway into the working fluid.\n\nThe inner container, filled with the substance to be heated, fits inside the outer container filled with the working fluid (often water, but alternatively steam or oil). The outer container is heated at or below the base, causing the temperature of the working fluid to rise and thus transferring heat to the inner container. The maximum obtainable temperature of the fluid is dictated by its composition and boiling point at the ambient pressure. Since the surface of the inner container is always in contact with the fluid, the double boiler serves as a constant-temperature heat source for the substance being heated, without hot or cold spots that can affect its properties.\n\nWhen the working fluid is water and the bain-marie is used at sea level, the maximum temperature of the material in the lower container will not exceed , the boiling point of water at sea level. Using different working fluids such as oil in the outer container will result in different maximum temperatures obtainable in the inner container.\n\nAlternatives \nA contemporary alternative to the traditional, liquid-filled bain-marie is the electric \"dry-heat\" bain-marie, heated by elements below both pots. The dry-heat form of electric bains-marie often consumes less energy, requires little cleaning, and can be heated more quickly than traditional versions. They can also operate at higher temperatures, and are often much less expensive than their traditional counterparts.\n\nElectric bains-marie can also be wet, using either hot water or vapor, or steam, in the heating process. The open, bath-type bain-marie heats via a small, hot-water tub (or \"bath\"), and the vapour-type bain-marie heats with scalding-hot steam.\n\nCulinary applications \nIn cooking applications, a bain-marie usually consists of a pan of water in which another container or containers of food to be cooked is/are placed.\n\n Chocolate can be melted in a bain-marie to avoid splitting (separation of cocoa butter and cocoa solids, breaking emulsion) and caking onto the pot. Special dessert bains-marie usually have a thermally insulated container and can be used as a chocolate fondue for the purposes of dipping foods (typically fruits) at the table.\n Cheesecake is often baked in a bain-marie to prevent the top from cracking in the centre.\n Baked custard desserts such as custard tarts may be cooked in a bain-marie to keep a crust from forming on the outside of the custard before the interior is fully cooked. In the case of the crème brûlée, placing the ramekins in a roasting pan and filling the pan with hot water until it is half to two-thirds of the way up the sides of the ramekins transfers the heat to the custard gently, which prevents the custard from curdling. The humidity from the steam that rises as the water heats helps keep the top of the custard from becoming too dry.\n Classic warm high-fat sauces, such as Hollandaise and beurre blanc, are often cooked using a bain-marie as they require enough heat to emulsify the mixture of fats and water but not enough to curdle or split the sauce.\n Some charcuterie such as terrines and pâtés are cooked in an \"oven-type\" bain-marie.\n The making of Clotted cream.  \n Thickening of condensed milk, such as in confection-making, is done in a bain-marie.\n Controlled-temperature bains-marie can be used to heat frozen breast milk before feedings.\n Bains-marie can be used in place of chafing dishes for keeping foods warm for long periods of time, where stovetops or hot plates are inconvenient or too powerful.\n A bain-marie can be used to re-liquefy hardened honey by placing a glass jar on top of any improvised platform sitting at the bottom of a pot of gently boiling water.\n\nOther uses \nIn small scale soap-making, a bain-marie's inherent control over maximum temperature makes it optimal for liquefying melt-and-pour soap bases prior to molding them into bars. It offers the advantage of maintaining the base in a liquid state, or reliquefying a solidified base, with minimal deterioration. Similarly, using a water bath, traditional wood glue can be melted and kept in a stable liquid state over many hours without damage to the animal proteins it incorporates.\n\nSee also \n Double steaming\n Heated bath\n Laboratory water bath\n\nReferences\n\nSources\n\nExternal links \n \n \n\nVessels\nCooking vessels\nCulinary terminology"
}