{
  "title": "Chives",
  "content": "Chives, scientific name Allium schoenoprasum, is a species of flowering plant in the family Amaryllidaceae that produces edible leaves and flowers. Their close relatives include the  common onions, garlic, shallot, leek, scallion, and Chinese onion.\n\nA perennial plant, it is widespread in nature across much of Europe, Asia, and North America.\n\nA. schoenoprasum is the only species of Allium native to both the New and the Old Worlds.\n\nChives are a commonly used herb and can be found in grocery stores or grown in home gardens. In culinary use, the green stalks (scapes) and the unopened, immature flower buds are diced and used as an ingredient for omelettes, fish, potatoes, soups, and many other dishes. The edible flowers can be used in salads. Chives have insect-repelling properties that can be used in gardens to control pests.\n\nThe plant provides a great deal of nectar for pollinators. It was rated in the top 10 for most nectar production (nectar per unit cover per year) in a UK plants survey conducted by the AgriLand project which is supported by the UK Insect Pollinators Initiative.\n\nDescription \nChives are a bulb-forming herbaceous perennial plant, growing to  tall. The bulbs are slender, conical,  long and  broad, and grow in dense clusters from the roots. The scapes (or stems) are hollow and tubular, up to  long and  across, with a soft texture, although, prior to the emergence of a flower, they may appear stiffer than usual. The grass-like leaves, which are shorter than the scapes, are also hollow and tubular, or terete, (round in cross-section) which distinguishes it at a glance from garlic chives (Allium tuberosum). \n\nThe flowers are pale purple, and star-shaped with six petals,  wide, and produced in a dense inflorescence of 10-30 together; before opening, the inflorescence is surrounded by a papery bract. The seeds are produced in a small, three-valved capsule, maturing in summer. The herb flowers from April to May in the southern parts of its habitat zones and in June in the northern parts.\n\nChives are the only species of Allium native to both the New and the Old Worlds. Sometimes, the plants found in North America are classified as A. schoenoprasum var. sibiricum, although this is disputed. Differences between specimens are significant.  One example was found in northern Maine growing solitary, instead of in clumps, also exhibiting dingy grey flowers.\n\nAlthough chives are repulsive to insects in general, due to their sulfur compounds, their flowers attract bees, and they are at times kept to increase desired insect life.\n\nTaxonomy\nIt was formally described by the Swedish botanist Carl Linnaeus in his seminal publication Species Plantarum in 1753.\n\nThe name of the species derives from the Greek σχοίνος, skhoínos (sedge or rush) and πράσον, práson (leek). Its English name, chives, derives from the French word cive, from cepa, the Latin word for onion. In the Middle Ages, it was known as 'rush leek'.\n\nSome subspecies have been proposed, but are not accepted by Plants of the World Online, , which sinks them into the species:\nAllium schoenoprasum subsp. gredense (Rivas Goday) Rivas Mart., Fern.Gonz. & Sánchez Mata\nAllium schoenoprasum subsp. latiorifolium (Pau) Rivas Mart., Fern.Gonz. & Sánchez Mata\nVarieties have also been proposed, including A. schoenoprasum var. sibiricum. The Flora of North America notes that the species is very variable, and considers recognition of varieties as \"unsound\".\n\nDistribution and habitat\nChives are native to temperate areas of Europe, Asia and North America.\n\nRange\n\nIt is found in Asia within the Caucasus (in Armenia, Azerbaijan and Georgia), also in China, Iran, Iraq, Japan (within the islands of Hokkaido and Honshu), Kazakhstan, Kyrgyzstan, Mongolia, Pakistan, Russian Federation (within the krais of Kamchatka, Khabarovsk, and Primorye) Siberia and Turkey.\n\nIn middle Europe, it is found within Austria, the Czech Republic, Germany, the Netherlands, Poland and Switzerland. In northern Europe, in Denmark, Finland, Norway, Sweden and the United Kingdom. In southeastern Europe, within Bulgaria,  Greece, Italy and Romania. It is also found in southwestern Europe, in France, Portugal and Spain.\n\nIn North America, it is found in Canada (within the provinces and territories of Alberta, British Columbia, Manitoba, Northwest Territories, Nova Scotia, New Brunswick, Newfoundland, Nunavut, Ontario, Prince Edward Island, Quebec, Saskatchewan and Yukon), and the United States (within the states of Alaska, Colorado, Connecticut, Idaho, Maine, Maryland, Massachusetts, Michigan, Minnesota, Montana, New Hampshire, New Jersey, New York, Ohio, Oregon, Pennsylvania, Rhode Island, Vermont, Washington, West Virginia, Wisconsin and Wyoming).\n\nUses\n\nCulinary arts \nChives are grown for their scapes and leaves, which are used for culinary purposes as a flavoring herb, and provide a somewhat milder onion-like flavor than those of other Allium species.\n\nChives have a wide variety of culinary uses, such as in traditional dishes in France, Sweden, and elsewhere. In his 1806 book Attempt at a Flora (Försök til en flora), Anders Jahan Retzius describes how chives are used with pancakes, soups, fish, and sandwiches. They are also an ingredient of the gräddfil sauce with the traditional herring dish served at Swedish midsummer celebrations. The flowers may also be used to garnish dishes. \n\nIn Poland and Germany, chives are served with quark. Chives are one of the fines herbes of French cuisine, the others being tarragon, chervil and parsley. Chives can be found fresh at most markets year-round, making them readily available; they can also be dry-frozen without much impairment to the taste, giving home growers the opportunity to store large quantities harvested from their own gardens.\n\nUses in plant cultivation \nRetzius also describes how farmers would plant chives between the rocks making up the borders of their flowerbeds, to keep the plants free from pests (such as Japanese beetles). The growing plant repels unwanted insect life, and the juice of the leaves can be used for the same purpose, as well as fighting fungal infections, mildew, and scab.\n\nCultivation \nChives are cultivated both for their culinary uses and for their ornamental value; the violet flowers are often used in ornamental dry bouquets. The flowers are also edible and are used in salads, or used to make blossom vinegars.\n\nChives thrive in well-drained soil, rich in organic matter, with a pH of 6-7 and full sun. They can be grown from seed and mature in summer, or early the following spring. Typically, chives need to be germinated at a temperature of 15 to 20 °C (60-70 °F) and kept moist. They can also be planted under a cloche or germinated indoors in cooler climates, then planted out later. After at least four weeks, the young shoots should be ready to be planted out. They are also easily propagated by division.\n\nIn cold regions, chives die back to the underground bulbs in winter, with the new leaves appearing in early spring. Chives starting to look old can be cut back to about 2–5 cm. When harvesting, the needed number of stalks should be cut to the base. During the growing season, the plant continually regrows leaves, allowing for a continuous harvest.\n\nChives are susceptible to damage by leek moth larvae, which bore into the leaves or bulbs of the plant.\n\nHistory and cultural importance \nChives have been cultivated in Europe since the Middle Ages (from the fifth until the 15th centuries), although their usage dates back 5,000 years. They were sometimes referred to as \"rush leeks\".\n\nIt was mentioned in 80 A.D. by Marcus Valerius Martialis in his \"Epigrams\".\n\nThe Romans believed chives could relieve the pain from sunburn or a sore throat. They believed eating chives could increase blood pressure and act as a diuretic.\n\nRomani have used chives in fortune telling. Bunches of dried chives hung around a house were believed to ward off disease and evil.\n\nIn the 19th century, Dutch farmers fed cattle on the herb to give a different taste to their milk.\n\nReferences\n\nExternal links \n\n \n Nutritional Information\n \n Mrs. Grieve's \"A Modern Herbal\" @ Botanical.com\n \n\nAllium\nFlora of Asia\nFlora of Europe\nFlora of Northern America\nGarden plants\nHerbs\nMedicinal plants of Asia\nMedicinal plants of Europe\nMedicinal plants of North America\nPlants described in 1753"
}