{
  "title": "Weetabix",
  "content": "Weetabix is a breakfast cereal produced by Weetabix Limited in the United Kingdom. It comes in the form of palm-sized (approx. 9.5 cm × 5.0 cm or 4\" × 2\") wheat biscuits. Variants include organic and Weetabix Crispy Minis (bite-sized) versions. The UK cereal is manufactured in Burton Latimer, Northamptonshire, and exported to over 80 countries. Weetabix for Canada and the United States is manufactured in Cobourg, Ontario, in both organic and conventional versions.\n\nWeetabix is made from whole-grain wheat. UK Weetabix has 3.8 g of fibre in a 37.5 g serving (2 biscuits) (10.1% by weight). The product sold in Canada and the U.S. has 4 grams of fibre in a 35 g serving (11.4% by weight).\n\nHistory\n\nProduced in the UK since 1932, Weetabix is the British version of the original Australian Weet-Bix. Both Weet-Bix and Weetabix were invented by Bennison Osborne, an Australian.  Weet-Bix was introduced in Australia through the company “Grain Products Limited” in the mid-1920s, with funding from businessman Arthur Shannon and marketing assistance from Osborne's New Zealand friend Malcolm Macfarlane.  To both Osborne's and Macfarlane's disappointment, Grain Products sold both its Australian company (in 1928) and then its New Zealand company (in 1930), to the Sanitarium Health Foods Company.  Osborne and Macfarlane then went to South Africa where Arthur Shannon, the owner of Grain Products, funded another Weet-Bix factory.  While in South Africa, Osborne modified his Weet-Bix recipe and with Macfarlane, obtained private funding and began the development of a new company, The British and African Cereal Company Limited, naming the new company's product Weetabix.  The company commenced business in England in 1932 in an unused gristmill at Burton Latimer, near Kettering.  In 1936, the name of the company was changed to Weetabix Limited.\n\nWeet-Bix is currently marketed in Australasia by Sanitarium and South Africa by Bokomo.  The product was introduced to Canada in 1967, when Weetabix Limited began exporting the product to Canada.  The United States followed in 1968.\n\nOn 3 May 2012 Bright Food announced it was taking a 60% stake in Weetabix in a deal that values the company at £1.2bn. Baring Private Equity Asia acquired the remaining 40% from Lion Capital in 2015. On 18 April 2017, it was announced that the American company Post Holdings would buy the company from Bright Food.\n\nAdvertising\nIn British advertising in the 1980s, Weetabix anthropomorphized the biscuits, representing a group of 'street-wise' young teens, beginning as 'skinheads'. Their appearances on the packaging and associated publicity featured catch phrases such as \"titchy breakfast cereals\" to describe rivals, with the response \"Neet Weet Mate\", \"OK!\". The lead Weetabix known officially as \"Dunk\" was voiced by Bob Hoskins.\n\nDuring the 1990s, the brand was advertised with the slogan \"Have you had your Weetabix?', based on the idea that someone who had eaten Weetabix would be filled with unbeatable strength and energy, causing those who oppose them to flee out of self-preservation. This was used to humorous effect in a variety of adverts re-imagining the outcome of fairy tales and historic events. In 2017, the campaign was reintroduced, with a reference to the English fairy tale Jack and the Beanstalk with actors Isaac Benn portraying Jack and Christopher Brand the Giant. The giant states: “Fee fi fo fum, I smell the blood of an Englishman”, with Jack responding: “Fee fi fo fix, I’ve just had my Weetabix”, resulting in the giant quickly leaving the room.  \n  \nWeetabix was the title sponsor of the Women's British Open golf tournament for two decades, from 1987 until 2006. It became a women's major golf championship in 2001.\n\nVariants\n\nWeetabix Crispy Minis\n\nWeetabix Crispy Minis are a sweeter 'bite-size' version of the standard Weetabix biscuits, with various additions depending upon the variety. As of 2020, the varieties available in the UK are  'chocolate', 'banana' and 'fruit & nut'.\n\nThe bitesize versions of Weetabix have been renamed several times since their original launch. Previously, they were known as \"Fruitibix\", \"Bananabix\" and \"Chocobix\" (depending upon the additions), later as \"Minibix\", then as \"Weetabix Minis\".\n\nOrganic\nOrganic versions of Weetabix are sold in various countries.\n\nWeetabix Chocolate\nWeetabix launched a chocolate-powder infused version of the original Weetabix in the UK in July 2010 in a 24 pack size.\n\nWeetabix Chocolate Spoonsize\nA smaller-sized Weetabix biscuit with cocoa and chocolate chips.\n\nWeetabix Baked with Golden Syrup\nA sweeter form of the Weetabix biscuit which is baked with golden syrup.\n\nWeetabix Banana\nA banana-flavoured version of Weetabix.\n\nWeetabix Protein\nA version with added wheat gluten protein granules was introduced in the UK in April 2016, available in three forms, the standard biscuit shapes, as well as regular and chocolate flavour \"Crunch\" pipe shapes.\n\nOatibix\n\nOatibix is a breakfast cereal that was introduced in the United Kingdom in August 2006. It was invented by Weetabix Limited. It is similar to Weetabix, but is based on whole grain oats instead of wheat.\n\nSee also\n Weet-Bix\n Frosted Mini-Wheats - sugar-coated wheat pellets\n Shredded Wheat - another wheat-based biscuit cereal.\n Ruskets - a similar product, formerly manufactured by Loma Linda Foods in Riverside, California.\n\nReferences\n\nExternal links\n\n \n\nWeetabix cereals\nFood brands of the United Kingdom\nProducts introduced in 1936\nWheat"
}