{
  "title": "American Registry for Internet Numbers",
  "content": "The American Registry for Internet Numbers (ARIN) is the regional Internet registry  for the United States, Canada, and many Caribbean and North Atlantic islands. ARIN manages the distribution of Internet number resources, including IPv4 and IPv6 address space and AS numbers. ARIN opened for business on December 22, 1997 after incorporating on April 18, 1997. ARIN is a nonprofit corporation with headquarters in Chantilly, Virginia, United States.<ref>\"Chantilly CDP, Virginia .\" U.S. Census Bureau. Retrieved on September 16, 2009.</ref>\n\nARIN is one of five regional Internet registries in the world. Like the other regional Internet registries, ARIN:\n\nProvides services related to the technical coordination and management of Internet number resources\nFacilitates policy development by its members and stakeholders\nParticipates in the international Internet community\nIs a nonprofit, community-based organization\nIs governed by an executive board elected by its membership\n\nServices\nARIN provides services related to the technical coordination and management of Internet number resources. The nature of these services is described in ARIN's mission statement:Applying the principles of stewardship, ARIN, a nonprofit corporation, allocates Internet Protocol resources; develops consensus-based policies; and facilitates the advancement of the Internet through information and educational outreach.These services are grouped in three areas: Registration, Organization, and Policy Development.\n\nRegistration services\nRegistration services pertain to the technical coordination and inventory management of Internet number resources. Services include:\n\nIPv4 address allocation and assignment\nIPv6 address allocation and assignment\nAS number assignment\nDirectory services including:\nRegistration transaction information (WHOIS)\nRouting information (Internet routing registry)\nDNS (Reverse)\n\nFor information on requesting Internet number resources from ARIN, see https://www.arin.net/resources/index.html. This section includes the request templates, specific distribution policies, and guidelines for requesting and managing Internet number resources.\n\nOrganization services\nOrganization services pertain to interaction between stakeholders, ARIN members, and ARIN. Services include:\n\nElections\nMembers meetings\nInformation publication and dissemination\nEducation and training\n\nPolicy development services\nPolicy development services facilitate the development of policy for the technical coordination and management of Internet number resources.\n\nAll ARIN policies are set by the community. Everyone is encouraged to participate in the policy development process at public policy meetings and on the Public Policy Mailing List. The ARIN Board of Trustees ratifies policies only after:\n\ndiscussion on mailing lists and at meetings;\nARIN Advisory Council recommendation;\ncommunity consensus in favor of the policy; and\nfull legal and fiscal review.\n\nMembership is not required to participate in ARIN's policy development process or to apply for Internet number resources.\n\nServices include:\n\nMaintaining discussion e-mail lists\nConducting public policy meetings\nPublishing policy documents\n\nOrganizational structure\nARIN consists of the Internet community within its region, its members, a 7-member Board of Trustees, a 15-member Advisory Council, and a professional staff of about 50. The board of trustees and Advisory Council are elected by ARIN members for three-year terms.\n\nBoard of trustees\nThe ARIN membership elects the Board of Trustees (BoT), which has ultimate responsibility for the business affairs and financial health of ARIN, and manages ARIN's operations in a manner consistent with the guidance received from the Advisory Council and the goals set by the registry's members. The BoT is responsible for determining the disposition of all revenues received to ensure all services are provided in an equitable manner. The BoT ratifies proposals generated from the membership and submitted through the Advisory Council. Executive decisions are carried out following approval by the BoT. The BoT consists of 7 members consisting of a President and CEO, a chairman, a Treasurer, and others.\n\nAdvisory Council\nIn addition to the BoT, ARIN has an advisory council that advises ARIN and the BoT on IP address allocation policy and related matters. Adhering to the procedures in the Internet Resource Policy Evaluation Process, the advisory council forwards consensus-based policy proposals to the BoT for ratification. The advisory council consists of 15 elected members consisting of a Chair, Vice Chair, and others.\n\nHistory\nThe organization was formed in December 1997 to \"provide IP registration services as an independent, nonprofit corporation.\" Until this time, IP address registration (outside of RIPE and APNIC regions) was done in accordance with policies set by the IETF by Network Solutions corporation as part of the InterNIC project.  The National Science Foundation approved the plan for the creation of the not-for-profit organization to \"give the users of IP numbers (mostly Internet service providers, corporations and other large institutions) a voice in the policies by which they are managed and allocated within the North American region.\"''.  As part of the transition, Network Solutions corporation transitioned these tasks as well as initial staff and computer infrastructure to ARIN.\n\nThe initial Board of Trustees consisted of  Scott Bradner, John Curran, Kim Hubbard, Don Telage, Randy Bush, Raymundo Vega Aguilar, and Jon Postel (IANA) as an ex-officio member.\n\nThe first president of ARIN was Kim Hubbard, from 1997 until 2000. Kim was succeeded by Raymond \"Ray\" Plzak until the end of 2008. Trustee John Curran was acting president until July 1 of 2009 when he assumed the CEO role permanently.\n\nUntil late 2002 it served Mexico, Central America, South America and all of the Caribbean. LACNIC now handles parts of the Caribbean, Mexico, Central America, and South America. Also, Sub-Saharan Africa was part of its region until April 2005, when AfriNIC was officially recognized by ICANN as the fifth regional Internet registry.\n\nOn 24 September 2015 ARIN has declared exhaustion of the ARIN IPv4 addresses pool.\n\nService region\nThe countries in the ARIN service region are:\n\nFormer service regions\nARIN formerly covered Angola, Botswana, Burundi, Republic of Congo, Democratic Republic of Congo, Eswatini, Lesotho, Malawi, Mozambique, Namibia, Rwanda, South Africa, Tanzania, Zambia, and Zimbabwe until AfriNIC was formed.\n\nARIN formerly covered Argentina, Aruba, Belize, Bolivia, Brazil, Chile, Colombia, Costa Rica, Cuba, Dominican Republic, Dutch West Indies, Ecuador, El Salvador, Falkland Islands (UK), French Guiana, Guatemala, Guyana, Haiti, Honduras, Mexico, Nicaragua, Panama, Paraguay, Peru, South Georgia and the South Sandwich Islands, Suriname, Trinidad and Tobago, Uruguay, and Venezuela until LACNIC was formed.\n\nReferences\n\nExternal links\nARIN Home Page\n\nRegional Internet registries\nInternet in Canada\nInternet in the United States\nInternet exchange points in North America\nOrganizations based in Virginia"
}