{
  "title": "Au",
  "content": "Au, AU,  au or a.u. may refer to:\n\nScience and technology\n\nComputing\n .au, the internet country code for Australia\n Au file format, Sun Microsystems' audio format\n Audio Units, a system level plug-in architecture from Apple Computer\n Adobe Audition, a sound editor program\n Windows Update or Automatic Updates, in Microsoft Windows\n Windows 10 Anniversary Update, of August 2016a\n\nPhysics and chemistry\n Gold, symbol Au (from Latin ), a chemical element\n Absorbance unit, a reporting unit in spectroscopy\n Atomic units, a system of units convenient for atomic physics and other fields\n Ångström unit, a unit of length equal to 10−10 m or 0.1 nanometre. \n Astronomical unit, a unit of length often used in planetary systems astronomy, an approximation for the average distance between the Earth and the Sun\n Arbitrary unit, a relative placeholder unit for when the actual value of a measurement is unknown or unimportant (\"a.u.\" is deprecated, use  \"arb. unit\" instead)\n\nArts and entertainment\n\nMusic\n AU (band), an experimental pop group headed by Luke Wyland\n Au, a 2010 release by Scottish rock band Donaldson, Moir and Paterson\n Au a track on Some Time in New York City by an album by John Lennon & Yoko Ono and Elephant's Memory\n\nMagazines\n Alternative Ulster, a Northern Irish music magazine, now called AU\n A&U: America's AIDS Magazine, sponsor of the Christopher Hewitt Award\n\nLiterature\nAlternative universe (fan fiction), fiction by fan authors that deliberately alters facts of the canonical universe written about.\n\nOther media\n Au Co, a fairy in Vietnamese mythology\n Age of Ultron, a 2013 series published by Marvel Comics\n A.U, a Chinese media franchise and brand\n\nOrganizations\n au (mobile phone company), a mobile phone operator in Japan\n African Union, a continental union\n Americans United for Separation of Church and State\n Athletic Union, the union of sports clubs in a British university\n Austral Líneas Aéreas (IATA code AU)\n Auxiliary Units, specially trained, highly secret units created by the United Kingdom government during the Second World War\n AGROunia, an agrarian-socialist political party in Poland\n\nUniversities\n\nAsia\n Ajou University  in Suwon, Gyeonggi, South Korea\n Abasyn University in Peshawar, Khyber Pakhtunkhwa, Pakistan\n Andhra University in Visakhapatnam, AP, India\n Anhui University in Hefei, Anhui, China \n Aletheia University in New Taipei City, Taiwan\n Allahabad University in Allahabad, Uttar Pradesh, India\n Arellano University in Philippines\n Assumption University (Thailand) in Thailand\n Abhilashi University in Himachal Pradesh, India\n Adesh University in Bathinda, Punjab, India.\n\nEurope\n Aarhus University in Aarhus, Denmark\n Aberystwyth University in Aberystwyth, Wales, United Kingdom\n Akademia Umiejętności in Kraków, Poland\n Arden University in Coventry, England\n\nOceania\n Auckland University in New Zealand\n\nNorth America\n Adelphi University in Garden City, New York\n Alfred University in Alfred, New York\n Algoma University in Sault Ste. Marie, Ontario, Canada\n American University in Washington, D.C.\n Anaheim University in Anaheim, California\n Anderson University (Indiana) in Anderson, Indiana\n Anderson University (South Carolina) in Anderson, South Carolina\n Andrews University in Berrien Springs, Michigan\n Antioch University in Culver City, California\n Apollos University in Huntington Beach, California\n Arcadia University in Glenside, Pennsylvania\n Argosy University in Alameda, California\n Arizona University in Tucson, Arizona\n Ashland University in Ashland, Ohio\n Athabasca University in Athabasca, Alberta, Canada\n Auburn University in Auburn, Alabama\n Augsburg University in Minneapolis, Minnesota\n Aurora University in Aurora, Illinois\n\nOther\n Air University (disambiguation), various Air Force universities\n\nPlaces\n Aue (toponymy), a frequent element in Germanic toponymy\n Australia (ISO 3166 country code)\n Au, Guinea, Kankan Region\n\nAustria\n Austria (informal two-letter country code) \n Au, Vorarlberg, Bregenz, Austria\n Au am Leithaberge, Austria\n Au im Bregenzerwald, Austria\n\nGermany\n Au (Munich), Munich, Germany\n Au (Schwarzwald), Baden-Württemberg, Germany\n Au (squat), a building and cultural center in Frankfurt, Germany\n Au am Rhein, Germany\n Au in der Hallertau, Germany\n\nSwitzerland\n Au, St. Gallen\n Au, Zürich\n Au peninsula\n Schloss Au, a château in Wädenswil\n\nVehicles\n Ford Falcon (AU), a family car made in Australia\n Vought AU, a post-World War II US Marine Corps variant of the F4U Corsair aircraft\n\nOther uses\n Aú, a cartwheel in the Brazilian martial art of Capoeira\n Au (surname), a Chinese family name\n Au language\n Ab urbe condita (sometimes abbreviated as a.u.), Latin for \"from the founding of the City\" (Rome)\n a'u, the Hawaiian name for the Pacific blue marlin"
}