{
  "title": "Autocorrelation",
  "content": "Autocorrelation, sometimes known as serial correlation in the discrete time case, is the correlation of a signal with a delayed copy of itself as a function of delay. Informally, it is the similarity between observations of a random variable as a function of the time lag between them. The analysis of autocorrelation is a mathematical tool for finding repeating patterns, such as the presence of a periodic signal obscured by noise, or identifying the missing fundamental frequency  in a signal implied by its harmonic frequencies. It is often used in signal processing for analyzing functions or series of values, such as time domain signals.\n\nDifferent fields of study define autocorrelation differently, and not all of these definitions are equivalent. In some fields, the term is used interchangeably with autocovariance.\n\nUnit root processes, trend-stationary processes, autoregressive processes, and moving average processes are specific forms of processes with autocorrelation.\n\nAuto-correlation of stochastic processes \nIn statistics, the autocorrelation of a real or complex random process is the Pearson correlation between values of the process at different times, as a function of the two times or of the time lag. Let  be a random process, and  be any point in time ( may be an integer for a discrete-time process or a real number for a continuous-time process). Then  is the value (or realization) produced by a given run of the process at time . Suppose that the process has mean  and variance  at time , for each . Then the definition of the auto-correlation function between times  and  is\n\nwhere  is the expected value operator and the bar represents complex conjugation. Note that the expectation may not be well defined.\n\nSubtracting the mean before multiplication yields the auto-covariance function between times  and :\n\nNote that this expression is not well defined for all time series or processes, because the mean may not exist, or the variance may be zero (for a constant process) or infinite (for processes with distribution lacking well-behaved moments, such as certain types of power law).\n\nDefinition for wide-sense stationary stochastic process \nIf  is a wide-sense stationary process then the mean  and the variance  are time-independent, and further the autocovariance function depends only on the lag between  and : the autocovariance depends only on the time-distance between the pair of values but not on their position in time. This further implies that the autocovariance and auto-correlation can be expressed as a function of the time-lag, and that this would be an even function of the lag  . This gives the more familiar forms for the auto-correlation function\n\nand the auto-covariance function:\n\nIn particular, note that\n\nNormalization \nIt is common practice in some disciplines (e.g. statistics and time series analysis) to normalize the autocovariance function to get a time-dependent Pearson correlation coefficient. However, in other disciplines (e.g. engineering) the normalization is usually dropped and the terms \"autocorrelation\" and \"autocovariance\" are used interchangeably.\n\nThe definition of the auto-correlation coefficient of a stochastic process is\n\nIf the function  is well defined, its value must lie in the range , with 1 indicating perfect correlation and −1 indicating perfect anti-correlation.\n\nFor a wide-sense stationary (WSS) process, the definition is\n\n.\n\nThe normalization is important both because the interpretation of the autocorrelation as a correlation provides a scale-free measure of the strength of statistical dependence, and because the normalization has an effect on the statistical properties of the estimated autocorrelations.\n\nProperties\n\nSymmetry property\nThe fact that the auto-correlation function  is an even function can be stated as\n\nrespectively for a WSS process:\n\nMaximum at zero\nFor a WSS process:\n\nNotice that  is always real.\n\nCauchy–Schwarz inequality\nThe Cauchy–Schwarz inequality, inequality for stochastic processes:\n\nAutocorrelation of white noise\nThe autocorrelation of a continuous-time white noise signal will have a strong peak (represented by a Dirac delta function) at  and will be exactly  for all other .\n\nWiener–Khinchin theorem\nThe Wiener–Khinchin theorem relates the autocorrelation function  to the power spectral density  via the Fourier transform:\n\nFor real-valued functions, the symmetric autocorrelation function has a real symmetric transform, so the Wiener–Khinchin theorem can be re-expressed in terms of real cosines only:\n\nAuto-correlation of random vectors\n\nThe (potentially time-dependent) auto-correlation matrix (also called second moment) of a (potentially time-dependent) random vector  is an  matrix containing as elements the autocorrelations of all pairs of elements of the random vector . The autocorrelation matrix is used in various digital signal processing algorithms.\n\nFor a random vector  containing random elements whose expected value and variance exist, the auto-correlation matrix is defined by\n\nwhere  denotes the transposed matrix of dimensions .\n\nWritten component-wise:\n\nIf  is a complex random vector, the autocorrelation matrix is instead defined by\n\nHere  denotes Hermitian transpose.\n\nFor example, if  is a random vector, then  is a  matrix whose -th entry is .\n\nProperties of the autocorrelation matrix\n The autocorrelation matrix is a Hermitian matrix for complex random vectors and a symmetric matrix for real random vectors.\n The autocorrelation matrix is a positive semidefinite matrix, i.e.  for a real random vector, and respectively  in case of a complex random vector.\n All eigenvalues of the autocorrelation matrix are real and non-negative.\n The auto-covariance matrix is related to the autocorrelation matrix as follows:Respectively for complex random vectors:\n\nAuto-correlation of deterministic signals \nIn signal processing, the above definition is often used without the normalization, that is, without subtracting the mean and dividing by the variance. When the autocorrelation function is normalized by mean and variance, it is sometimes referred to as the autocorrelation coefficient or autocovariance function.\n\nAuto-correlation of continuous-time signal \nGiven a signal , the continuous autocorrelation  is most often defined as the continuous cross-correlation integral of  with itself, at lag .\n\nwhere  represents the complex conjugate of . Note that the parameter  in the integral is a dummy variable and is only necessary to calculate the integral. It has no specific meaning.\n\nAuto-correlation of discrete-time signal \nThe discrete autocorrelation  at lag  for a discrete-time signal  is\n\nThe above definitions work for signals that are square integrable, or square summable, that is, of finite energy. Signals that \"last forever\" are treated instead as random processes, in which case different definitions are needed, based on expected values. For wide-sense-stationary random processes, the autocorrelations are defined as\n\nFor processes that are not stationary, these will also be functions of , or .\n\nFor processes that are also ergodic, the expectation can be replaced by the limit of a time average. The autocorrelation of an ergodic process is sometimes defined as or equated to\n\nThese definitions have the advantage that they give sensible well-defined single-parameter results for periodic functions, even when those functions are not the output of stationary ergodic processes.\n\nAlternatively, signals that last forever can be treated by a short-time autocorrelation function analysis, using finite time integrals. (See short-time Fourier transform for a related process.)\n\nDefinition for periodic signals\nIf  is a continuous periodic function of period , the integration from  to  is replaced by integration over any interval  of length :\n\nwhich is equivalent to\n\nProperties\nIn the following, we will describe properties of one-dimensional autocorrelations only, since most properties are easily transferred from the one-dimensional case to the multi-dimensional cases. These properties hold for wide-sense stationary processes.\n\n A fundamental property of the autocorrelation is symmetry, , which is easy to prove from the definition. In the continuous case,\n the autocorrelation is an even function  when  is a real function, and\n the autocorrelation is a Hermitian function  when  is a complex function.\n The continuous autocorrelation function reaches its peak at the origin, where it takes a real value, i.e. for any delay , . This is a consequence of the rearrangement inequality. The same result holds in the discrete case.\n The autocorrelation of a periodic function is, itself, periodic with the same period.\n The autocorrelation of the sum of two completely uncorrelated functions (the cross-correlation is zero for all ) is the sum of the autocorrelations of each function separately.\n Since autocorrelation is a specific type of cross-correlation, it maintains all the properties of cross-correlation.\n By using the symbol  to represent convolution and  is a function which manipulates the function  and is defined as , the definition for  may be written as:\n\nMulti-dimensional autocorrelation\nMulti-dimensional autocorrelation is defined similarly. For example, in three dimensions the autocorrelation of a square-summable discrete signal would be\n\nWhen mean values are subtracted from signals before computing an autocorrelation function, the resulting function is usually called an auto-covariance function.\n\nEfficient computation\nFor data expressed as a discrete sequence, it is frequently necessary to compute the autocorrelation with high computational efficiency. A brute force method based on the signal processing definition  can be used when the signal size is small. For example, to calculate the autocorrelation of the real signal sequence  (i.e. , and  for all other values of ) by hand, we first recognize that the definition just given is the same as the \"usual\" multiplication, but with right shifts, where each vertical addition gives the autocorrelation for particular lag values:\n\nThus the required autocorrelation sequence is , where   and  the autocorrelation for other lag values being zero. In this calculation we do not perform the carry-over operation during addition as is usual in normal multiplication. Note that we can halve the number of operations required by exploiting the inherent symmetry of the autocorrelation. If the signal happens to be periodic, i.e.  then we get a circular autocorrelation (similar to circular convolution) where the left and right tails of the previous autocorrelation sequence will overlap and give  which has the same period as the signal sequence  The procedure can be regarded as an application of the convolution property of Z-transform of a discrete signal.\n\nWhile the brute force algorithm is order , several efficient algorithms exist which can compute the autocorrelation in order . For example, the Wiener–Khinchin theorem allows computing the autocorrelation from the raw data  with two fast Fourier transforms (FFT):\n\nwhere IFFT denotes the inverse fast Fourier transform. The asterisk denotes complex conjugate.\n\nAlternatively, a multiple  correlation can be performed by using brute force calculation for low  values, and then progressively binning the  data with a logarithmic density to compute higher values, resulting in the same  efficiency, but with lower memory requirements.\n\nEstimation\nFor a discrete process with known mean and variance for which we observe  observations , an estimate of the autocorrelation coefficient may be obtained as\n\nfor any positive integer . When the true mean  and variance  are known, this estimate is unbiased. If the true mean and variance of the process are not known there are several possibilities:\n If  and  are replaced by the standard formulae for sample mean and sample variance, then this is a biased estimate.\n A periodogram-based estimate replaces  in the above formula with . This estimate is always biased; however, it usually has a smaller mean squared error.\n Other possibilities derive from treating the two portions of data  and  separately and calculating separate sample means and/or sample variances for use in defining the estimate.\n\nThe advantage of estimates of the last type is that the set of estimated autocorrelations, as a function of , then form a function which is a valid autocorrelation in the sense that it is possible to define a theoretical process having exactly that autocorrelation. Other estimates can suffer from the problem that, if they are used to calculate the variance of a linear combination of the 's, the variance calculated may turn out to be negative.\n\nRegression analysis\n\nIn regression analysis using time series data, autocorrelation in a variable of interest is typically modeled either with an autoregressive model (AR), a moving average model (MA), their combination as an autoregressive-moving-average model (ARMA), or an extension of the latter called an autoregressive integrated moving average model (ARIMA). With multiple interrelated data series, vector autoregression (VAR) or its extensions are used.\n\nIn ordinary least squares (OLS), the adequacy of a model specification can be checked in part by establishing whether there is autocorrelation of the regression residuals. Problematic autocorrelation of the errors, which themselves are unobserved, can generally be detected because it produces autocorrelation in the observable residuals. (Errors are also known as \"error terms\" in econometrics.) Autocorrelation of the errors violates the ordinary least squares assumption that the error terms are uncorrelated, meaning that the Gauss Markov theorem does not apply, and that OLS estimators are no longer the Best Linear Unbiased Estimators (BLUE). While it does not bias the OLS coefficient estimates, the standard errors tend to be underestimated (and the t-scores overestimated) when the autocorrelations of the errors at low lags are positive.\n\nThe traditional test for the presence of first-order autocorrelation is the Durbin–Watson statistic or, if the explanatory variables include a lagged dependent variable, Durbin's h statistic. The Durbin-Watson can be linearly mapped however to the Pearson correlation between values and their lags.  A more flexible test, covering autocorrelation of higher orders and applicable whether or not the regressors include lags of the dependent variable, is the Breusch–Godfrey test. This involves an auxiliary regression, wherein the residuals obtained from estimating the model of interest are regressed on (a) the original regressors and (b) k lags of the residuals, where 'k' is the order of the test. The simplest version of the test statistic from this auxiliary regression is TR2, where T is the sample size and R2 is the coefficient of determination. Under the null hypothesis of no autocorrelation, this statistic is asymptotically distributed as  with k degrees of freedom.\n\nResponses to nonzero autocorrelation include generalized least squares and the Newey–West HAC estimator (Heteroskedasticity and Autocorrelation Consistent).\n\nIn the estimation of a moving average model (MA), the autocorrelation function is used to determine the appropriate number of lagged error terms to be included. This is based on the fact that for an MA process of order q, we have , for , and , for .\n\nApplications\n\n Autocorrelation analysis is used heavily in fluorescence correlation spectroscopy to provide quantitative insight into molecular-level diffusion and chemical reactions.\n Another application of autocorrelation is the measurement of optical spectra and the measurement of very-short-duration light pulses produced by lasers, both using optical autocorrelators.\n Autocorrelation is used to analyze dynamic light scattering data, which notably enables determination of the particle size distributions of nanometer-sized particles or micelles suspended in a fluid. A laser shining into the mixture produces a speckle pattern that results from the motion of the particles. Autocorrelation of the signal can be analyzed in terms of the diffusion of the particles. From this, knowing the viscosity of the fluid, the sizes of the particles can be calculated.\n Utilized in the GPS system to correct for the propagation delay, or time shift, between the point of time at the transmission of the carrier signal at the satellites, and the point of time at the receiver on the ground.  This is done by the receiver generating a replica signal of the 1,023-bit C/A (Coarse/Acquisition) code, and generating lines of code chips [-1,1] in packets of ten at a time, or 10,230 chips (1,023 × 10), shifting slightly as it goes along in order to accommodate for the doppler shift in the incoming satellite signal, until the receiver replica signal and the satellite signal codes match up.\n The small-angle X-ray scattering intensity of a nanostructured system is the Fourier transform of the spatial autocorrelation function of the electron density.\nIn surface science and scanning probe microscopy, autocorrelation is used to establish a link between surface morphology and functional characteristics.\n In optics, normalized autocorrelations and cross-correlations give the degree of coherence of an electromagnetic field.\n In signal processing, autocorrelation can give information about repeating events like musical beats (for example, to determine tempo) or pulsar frequencies, though it cannot tell the position in time of the beat. It can also be used to estimate the pitch of a musical tone.\n In music recording, autocorrelation is used as a pitch detection algorithm prior to vocal processing, as a distortion effect or to eliminate undesired mistakes and inaccuracies.\n Autocorrelation in space rather than time, via the Patterson function, is used by X-ray diffractionists to help recover the \"Fourier phase information\" on atom positions not available through diffraction alone.\n In statistics, spatial autocorrelation between sample locations also helps one estimate mean value uncertainties when sampling a heterogeneous population.\n The SEQUEST algorithm for analyzing mass spectra makes use of autocorrelation in conjunction with cross-correlation to score the similarity of an observed spectrum to an idealized spectrum representing a peptide.\n In astrophysics, autocorrelation is used to study and characterize the spatial distribution of galaxies in the universe and in multi-wavelength observations of low mass X-ray binaries.\n In panel data, spatial autocorrelation refers to correlation of a variable with itself through space.\n In analysis of Markov chain Monte Carlo data, autocorrelation must be taken into account for correct error determination.\n In geosciences (specifically in geophysics) it can be used to compute an autocorrelation seismic attribute, out of a 3D seismic survey of the underground.\n In medical ultrasound imaging, autocorrelation is used to visualize blood flow.\n In intertemporal portfolio choice, the presence or absence of autocorrelation in an asset's rate of return can affect the optimal portion of the portfolio to hold in that asset.\n Autocorrelation has been used to accurately measure power system frequency in numerical relays.\n\nSerial dependence \nSerial dependence is closely linked to the notion of autocorrelation, but represents a distinct concept (see Correlation and dependence). In particular, it is possible to have serial dependence but no (linear) correlation. In some fields however, the two terms are used as synonyms.\n\nA  time series of a random variable has serial dependence if the value at some time  in the series is statistically dependent on the value at another time . A series is serially independent if there is no dependence between any pair.\n\nIf a time series  is stationary, then statistical dependence between the pair  would imply that there is statistical dependence between all pairs of values at the same lag .\n\nSee also\n\n Autocorrelation matrix\n Autocorrelation of a formal word\n Autocorrelation technique\n Autocorrelator\n Cochrane–Orcutt estimation (transformation for autocorrelated error terms)\n Correlation function\n Correlogram\n Cross-correlation\n CUSUM\n Fluorescence correlation spectroscopy\n Optical autocorrelation\n Partial autocorrelation function\n Phylogenetic autocorrelation (Galton's problem}\n Pitch detection algorithm\n Prais–Winsten transformation\n Scaled correlation\n Triple correlation\n Unbiased estimation of standard deviation\n\nReferences\n\nFurther reading\n \n \n Mojtaba Soltanalian, and Petre Stoica. \"Computational design of sequences with good correlation properties.\" IEEE Transactions on Signal Processing, 60.5 (2012): 2180–2193.\n Solomon W. Golomb, and Guang Gong. Signal design for good correlation: for wireless communication, cryptography, and radar. Cambridge University Press, 2005.\n Klapetek, Petr (2018). Quantitative Data Processing in Scanning Probe Microscopy: SPM Applications for Nanometrology (Second ed.). Elsevier. pp. 108–112  .\n \n\n \nSignal processing\nTime domain analysis"
}