{
  "title": "Bastard Operator From Hell",
  "content": "The Bastard Operator From Hell (BOFH) is  a fictional rogue computer operator created by Simon Travaglia, who takes out his anger on users (who are \"lusers\" to him) and others who pester him with their computer problems, uses his expertise against his enemies and manipulates his employer.\n\nSeveral people have written stories about BOFHs, but only those by Simon Travaglia are considered canonical. \nThe BOFH stories were originally posted in 1992 to Usenet by Travaglia, with some being reprinted in Datamation. Since 2000 they have been published regularly in The Register (UK). Several collections of the stories have been published as books.\n\nBy extension, the term is also used to refer to any system administrator who displays the qualities of the original.\n\nThe early accounts of the BOFH took place in a university; later the scenes were set in an office workplace. In 2000 (BOFH 2k), the BOFH and his pimply-faced youth (PFY) assistant moved to a new company.\n\nOther characters \n The PFY (Pimply-Faced Youth, the assistant to the BOFH. Real name is Stephen) Possesses a temperament similar to the BOFH, and often either teams up with or plots against him.\n The Boss (often portrayed as having no IT knowledge but believing otherwise; identity changes as successive bosses are sacked, leave, are committed, or have nasty \"accidents\")\n CEO of the company – The PFY's uncle Brian from 1996 until 2000, when the BOFH and PFY moved to a new company.\n The help desk operators, referred to as the \"Helldesk\" and often scolded for giving out the BOFH's personal number.\n The Boss's secretary, Sharon.\n The security department\n George, the cleaner (an invaluable source of information to the BOFH and PFY)\n\nBooks\n\nGames \n\nBOFH is a text adventure game written by Howard A. Sherman and published in 2002. It is available via Malinche.\n\nReferences in other media \n\nThe protagonist in Charles Stross's The Laundry Files series of novels named himself Bob Oliver Francis Howard in reference to the BOFH. As Bob Howard is a self-chosen pseudonym, and Bob is a network manager when not working as a computational demonologist, the name is all too appropriate. In the novella Pimpf, he acquires a pimply-faced young assistant by the name of Peter-Fred Young.\n\nAuthorship\n\nSimon Travaglia (born 1964) graduated from the University of Waikato, New Zealand in 1985. He worked as the IT infrastructure manager (2004–2008) and computer operator (1985–1992) at the University of Waikato  and the infrastructure manager at the Waikato Innovation Park, Hamilton, New Zealand (since 2008). Since 1999 he is a freelance writer for The Register. He lives in Hautapu, New Zealand.\n\nReferences\n\nFurther reading\n\nExternal links \n \n \n \n\nComputer humor\nInternet culture\nInternet slang\nSystem administration\nFictional characters introduced in 1992\nFictional people in information technology"
}