{
  "title": "Disney's Magical Mirror Starring Mickey Mouse",
  "content": "Disney's Magical Mirror Starring Mickey Mouse is a point-and-click adventure video game developed by Nintendo and Capcom and published by Nintendo for the GameCube and licensed from Disney.\n\nGameplay\nThe game uses a simple point-and-click mechanic, similar to Pac-Man 2: The New Adventures, which involves using a cursor to guide Mickey Mouse to various locations. Mickey will react to what the player does and what he encounters in the game by expressing curiosity, getting mad, falling down, running away, standing his ground, or other actions. At certain points, the player is able to have Mickey perform a special move that generally involves having him stomp on an onscreen enemy.\n\nMini-games, such as having Mickey fly an airplane or ski down a mountain, are available throughout the game. Special souvenirs may be uncovered as well, which are displayed in Mickey's room at the end of the game, such as Pluto's collar or Minnie's bow. The objective of the game is to find all the pieces of the mirror so that Mickey goes back home.\n\nPlot\nOne night when Mickey is fast asleep, he falls into a dream where a mischievous ghost traps a dream vision of himself inside a magic mirror. Stuck in a large mansion within an alternate universe that strangely resembles his own house, Mickey yearns to get back through the mirror to the real world in order to wake up from his dreamlike state; however, the ghost destroys the mirror and the pieces shrink and fly off to different areas around the house, which turns the magic mirror into a normal mirror. The player must direct Mickey to outwit and pull gags in order to get past enemies, obstacles, and the aforementioned ghost and recover the twelve broken mirror pieces he needs to go home again and search for twelve magic star containers (needed to pull gags) and items needed to help him throughout his quest. Whenever he finds a piece, it will fly back to the mirror, return to its normal size, and put itself back in place.\n\nAfter repairing the mirror, Mickey prepares to leave, but the ghost stops him, revealing that it only brought him here so it can have someone to play with. The player could either choose to stay or go. Choosing to stay will make the ghost run off, leaving Mickey stuck in the alternate world until he reenters the mirror room where the player can choose to stay or leave again. If the player chooses to leave, Mickey says goodbye to the ghost and begins to go home, but the ghost decides to go with him (only if the player has collected all the mirror pieces). After Mickey wakes up, he goes downstairs to get something to eat. If the player repairs the mirror with all twelve pieces found, a model of the ghost is shown hanging on the ceiling fan and the ghost's laughter is heard, implying that the ghost is now residing in Mickey's house.\n\nDevelopment\nThe game was teased at Nintendo's Space World 2001 presentation with a series of screenshots, which was assumed to be a platformer like much the vein of Disney's Magical Quest on the Super NES. The title was formally announced at the 2002 Electronic Entertainment Expo.\n\nThe game's introduction sequence is loosely based on Thru the Mirror, a 1936 Mickey Mouse cartoon; Mickey's animations are replicated from the short. An alternate scene later in the game, where Mickey grows to a tremendous size then shrinks to a minuscule size, was also replicated as in the cartoon.\n\nReception\n\nThe game received \"mixed\" reviews according to the review aggregation website Metacritic. For the most part, the player is given no instructions and cut scenes are limited to watching Mickey get chased or falling through to the next area. In Japan, Famitsu gave it a score of 27 out of 40.\n\nGameSpot said, \"The incredibly slow pacing and monotonous puzzles will override the Disney entertainment factor for the young as well.\" IGN wrote, \"It's just plain boring and often tedious. Most kids will find the game as just that, and for the monetary investment, it's not recommended.\" GameSpy wrote, \"Geared towards a younger audience, Mickey is mind-numbingly simple, and it's a shame that such impressive visuals had to go to waste on such a disposable game.\"\n\nSee also\n Disney's Hide and Sneak\n List of Disney video games\n\nNotes\n\nReferences\n\nExternal links\n\n2002 video games\nDisney games by Capcom\nDisney video games\nGameCube games\nGameCube-only games\nGames with GameCube-GBA connectivity\nMickey Mouse video games\nNintendo games\nPoint-and-click adventure games\nSingle-player video games\nVideo games about dreams\nVideo games about ghosts\nVideo games about magic\nVideo games about parallel universes\nVideo games developed in Japan"
}