{
  "title": "MessagePad",
  "content": "The MessagePad is a discontinued series of personal digital assistant devices developed by Apple Computer for the Newton platform in 1993.  Some electronic engineering and the manufacture of Apple's MessagePad devices was undertaken in Japan by Sharp. The devices are based on the ARM 610 RISC processor and all featured handwriting recognition software and were developed and marketed by Apple. The devices run Newton OS.\n\nHistory\nThe development of the Newton MessagePad first began with Apple's former senior vice president of research and development, Jean-Louis Gassée; his team included Steve Capps, co-writer of macOS Finder, and an employed engineer named Steve Sakoman. The development of the Newton MessagePad operated in secret until it was eventually revealed to the Apple Board of Directors in late 1990.\n\nWhen Gassée resigned from his position due to a significant disagreement with the board, seeing how his employer was treated, Sakoman also stopped developing the MessagePad on March 2, 1990.\n\nBill Atkinson, an Apple Executive responsible for the company's Lisa graphical interface, invited Steve Capps, John Sculley, Andy Hertzfeld, Susan Kare, and Marc Porat to a meeting on March 11, 1990. There, they brainstormed a way of saving the MessagePad. Sculley suggested adding new features, including libraries, museums, databases, or institutional archives features, allowing customers to navigate through various window tabs or opened galleries/stacks. The Board later approved his suggestion; he then gave Newton it is official and full backing.\n\nThe first MessagePad was unveiled by Sculley on the 29th of May 1992 at the summer Consumer Electronics Show (CES) in Chicago. Sculley caved in to pressure to unveil the product early because the Newton did not officially ship for another 14 months on August 2, 1993, starting at a price of . Over 50,000 units were sold by late November 1993.\n\nDetails\n\nScreen and input\nWith the MessagePad 120 with Newton OS 2.0, the Newton Keyboard by Apple became available, which can also be used via the dongle on Newton devices with a Newton InterConnect port, most notably the Apple MessagePad 2000/2100 series, as well as the Apple eMate 300.\n\nNewton devices featuring Newton OS 2.1 or higher can be used with the screen turned horizontally (\"landscape\") as well as vertically (\"portrait\"). A change of a setting rotates the contents of the display by 90, 180 or 270 degrees. Handwriting recognition still works properly with the display rotated, although display calibration is needed when rotation in any direction is used for the first time or when the Newton device is reset.\n\nHandwriting recognition\n\nIn initial versions (Newton OS 1.x) the handwriting recognition gave extremely mixed results for users and was sometimes inaccurate. The original handwriting recognition engine was called Calligrapher, and was licensed from a Russian company called Paragraph International. Calligrapher's design was quite sophisticated; it attempted to learn the user's natural handwriting, using a database of known words to make guesses as to what the user was writing, and could interpret writing anywhere on the screen, whether hand-printed, in cursive, or a mix of the two. By contrast, Palm Pilot's Graffiti had a less sophisticated design than Calligrapher, but was sometimes found to be more accurate and precise due to its reliance on a fixed, predefined stroke alphabet. The stroke alphabet used letter shapes which resembled standard handwriting, but which were modified to be both simple and very easy to differentiate. Palm Computing also released two versions of Graffiti for Newton devices.  The Newton version sometimes performed better and could also show strokes as they were being written as input was done on the display itself, rather than on a silkscreen area.\n\nFor editing text, Newton had a very intuitive system for handwritten editing, such as scratching out words to be deleted, circling text to be selected, or using written carets to mark inserts.\n\nLater releases of the Newton operating system retained the original recognizer for compatibility, but added a hand-printed-text-only (not cursive) recognizer, called \"Rosetta\", which was developed by Apple, included in version 2.0 of the Newton operating system, and refined in Newton 2.1. Rosetta is generally considered a significant improvement and many reviewers, testers, and most users consider the Newton 2.1 handwriting recognition software better than any of the alternatives even 10 years after it was introduced.  Recognition and computation of handwritten horizontal and vertical formulas such as \"1 + 2 =\" was also under development but never released. However, users wrote similar programs which could evaluate mathematical formulas using the Newton OS Intelligent Assistant, a unique part of every Newton device.\n\nThe handwriting recognition and parts of the user interface for the Newton are best understood in the context of the broad history of pen computing, which is quite extensive.\n\nA vital feature of the Newton handwriting recognition system is the modeless error correction. That is, correction done in situ without using a separate window or widget, using a minimum of gestures. If a word is recognized improperly, the user could double-tap the word and a list of alternatives would pop up in a menu under the stylus. Most of the time, the correct word will be in the list. If not, a button at the bottom of the list allows the user to edit individual characters in that word. Other pen gestures could do such things as transpose letters (also in situ). The correction popup also allowed the user to revert to the original, un-recognized letter shapes - this would be useful in note-taking scenarios if there was insufficient time to make corrections immediately. To conserve memory and storage space, alternative recognition hypotheses would not be saved indefinitely. If the user returned to a note a week later, for example, they would only see the best match. Error correction in many current handwriting systems provides such functionality but adds more steps to the process, greatly increasing the interruption to a user's workflow that a given correction requires.\n\nUser interface\n\nText could also be entered by tapping with the stylus on a small on-screen pop-up QWERTY virtual keyboard, although more layouts were developed by users. Newton devices could also accept free-hand \"Sketches\", \"Shapes\", and \"Ink Text\", much like a desktop computer graphics tablet. With \"Shapes\", Newton could recognize that the user was attempting to draw a circle, a line, a polygon, etc., and it would clean them up into perfect vector representations (with modifiable control points and defined vertices) of what the user was attempting to draw. \"Shapes\" and \"Sketches\" could be scaled or deformed once drawn. \"Ink text\" captured the user's free-hand writing but allowed it to be treated somewhat like recognized text when manipulating for later editing purposes (\"ink text\" supported word wrap, could be formatted to be bold, italic, etc.). At any time a user could also direct their Newton device to recognize selected \"ink text\" and turn it into recognized text (deferred recognition). A Newton note (or the notes attached to each contact in Names and each Dates calendar or to-do event) could contain any mix of interleaved text, Ink Text, Shapes, and Sketches.\n\nWhile the Newton offered handwriting recognition training and would clean up sketches into vector shapes, both were unreliable and required much rewriting and redrawing. The most reliable application of the Newton was collecting and organizing address and phone numbers. While handwritten messages could be stored, they could not be easily filed, sorted or searched. While the technology was a probable cause for the failure of the device (which otherwise met or exceeded expectations), the technology has been instrumental in producing the future generation of handwriting software that realizes the potential and promise that began in the development of Newton-Apple's Ink Handwriting Recognition.\n\nConnectivity\nThe MessagePad 100 series of devices used Macintosh's proprietary serial ports—round Mini-DIN 8 connectors. The MessagePad 2000/2100 models (as well as the eMate 300) have a small, proprietary Newton InterConnect port. However, the development of the Newton hardware/software platform was canceled by Steve Jobs on February 27, 1998, so the InterConnect port, while itself very advanced, can only be used to connect a serial dongle. A prototype multi-purpose InterConnect device containing serial, audio in, audio out, and other ports was also discovered. In addition, all Newton devices have infrared connectivity, initially only the Sharp ASK protocol, but later also IrDA, though the Sharp ASK protocol was kept in for compatibility reasons. Unlike the Palm Pilot, all Newton devices are equipped with a standard PC Card expansion slot (two on the 2000/2100). This allows native modem and even Ethernet connectivity; Newton users have also written drivers for 802.11b wireless networking cards and ATA-type flash memory cards (including the popular CompactFlash format), as well as for Bluetooth cards. Newton can also dial a phone number through the built-in speaker of the Newton device by simply holding a telephone handset up to the speaker and transmitting the appropriate tones. Fax and printing support is also built in at the operating system level, although it requires peripherals such as parallel adapters, PCMCIA cards, or serial modems, the most notable of which is the lightweight Newton Fax Modem released by Apple in 1993. It is powered by 2 AA batteries, and can also be used with a power adapter. It provides data transfer at 2,400 bit/s, and can also send and receive fax messages at 9,600 and 4,800 bit/s respectively.\n\nPower options\nThe original Apple MessagePad and MessagePad 100 used four AAA batteries. They were eventually replaced by AA batteries with the release of the Apple MessagePad 110.\n\nThe use of 4 AA NiCd (MessagePad 110, 120 and 130) and 4x AA NiMH cells (MP2x00 series, eMate 300) give a runtime of up to 30 hours (MP2100 with two 20 MB Linear Flash memory PC Cards, no backlight usage) and up to 24 hours with backlight on. While adding more weight to the handheld Newton devices than AAA batteries or custom battery packs, the choice of an easily replaceable/rechargeable cell format gives the user a still unsurpassed runtime and flexibility of power supply. This, together with the flash memory used as internal storage starting with the Apple MessagePad 120 (if all cells lost their power, no data was lost due to the non-volatility of this storage), gave birth to the slogan \"Newton never dies, it only gets new batteries\".\n\nLater efforts and improvements\nThe Apple MessagePad 2000/2100, with a vastly improved handwriting recognition system, 162 MHz StrongARM SA-110 RISC processor, Newton OS 2.1, and a better, clearer, backlit screen, attracted critical plaudits.\n\neMate 300\n\nThe eMate 300 was a Newton device in a laptop form factor offered to schools in 1997 as an inexpensive ($799 US, originally sold to education markets only) and durable computer for classroom use. However, in order to achieve its low price, the eMate 300 did not have all the speed and features of the contemporary MessagePad equivalent, the MessagePad 2000. The eMate was cancelled along with the rest of the Newton products in 1998. It is the only Newton device to use the ARM710 microprocessor (running at 25 MHz), have an integrated keyboard, use Newton OS 2.2 (officially numbered 2.1), and its batteries are officially irreplaceable, although several users replaced them with longer-lasting ones without any damage to the eMate hardware whatsoever.\n\nPrototypes\n\nMany prototypes of additional Newton devices were spotted. Most notable was a Newton tablet or \"slate\", a large, flat screen that could be written on. Others included a \"Kids Newton\" with side handgrips and buttons, \"VideoPads\" which would have incorporated a video camera and screen on their flip-top covers for two-way communications, the \"Mini 2000\" which would have been very similar to a Palm Pilot, and the NewtonPhone developed by Siemens, which incorporated a handset and a keyboard.\n\nMarket reception\nFourteen months after Sculley demoed it at the May 1992, Chicago CES, the MessagePad was first offered for sale on August 2, 1993, at the Boston Macworld Expo. The hottest item at the show, it cost $900. 50,000 MessagePads were sold in the device's first three months on the market.\n\nThe original Apple MessagePad and MessagePad 100 were limited by the very short lifetime of their inadequate AAA batteries.\n\nLater versions of Newton OS offered improved handwriting recognition, quite possibly a leading reason for the continued popularity of the devices among Newton users. Even given the age of the hardware and software, Newtons still demand a sale price on the used market far greater than that of comparatively aged PDAs produced by other companies. In 2006, CNET compared an Apple MessagePad 2000 to a Samsung Q1, and the Newton was declared better. In 2009, CNET compared an Apple MessagePad 2000 to an iPhone 3GS, and the Newton was declared more innovative at its time of release.\n\nA chain of dedicated Newton-only stores called Newton Source, independently run by Stephen Elms, existed from 1994 until 1998. Locations included New York, Los Angeles, San Francisco, Chicago and Boston. The Westwood Village, California, near UCLA featured the trademark red and yellow light bulb Newton logo in neon. The stores provided an informative educational venue to learn about the Newton platform in a hands on relaxed fashion. The stores had no traditional computer retail counters and featured oval desktops where interested users could become intimately involved with the Newton product range. The stores were a model for the later Apple Stores.\n\nNewton device models\n\n{| class=\"wikitable\"\n|+\n!Brand\n| colspan=\"2\" |Apple Computer \n|Sharp \n|Siemens\n| colspan=\"2\" |Apple \n|Sharp \n|Apple Computer \n|Digital Ocean \n|Motorola\n|Harris \n|Digital Ocean \n| colspan=\"4\" |Apple \n| colspan=\"3\" |Harris\n|Siemens\n|Schlumberger\n|-\n!Device\n|OMP (Original Newton MessagePad)\n|Newton \"Dummy\"\n|ExpertPad PI-7000\n|Notephone.[better source needed]\n|MessagePad 100\n|MessagePad 110\n|Sharp ExpertPad PI-7100\n|MessagePad 120\n|Tarpon\n|Marco\n|SuperTech 2000\n|Seahorse\n|MessagePad 130\n|eMate 300\n|MessagePad 2000\n|MessagePad 2100\n|Access Device 2000\n|Access Device, GPS\n|Access Device, Wireline\n|Online Terminal, also known as Online Access Device(OAD)\n|Watson \n|-\n!Introduced\n|August 3, 1993 (US) December 1993 (Germany)\n|?\n|August 3, 1993 (US and Japan)\n|1993?\n| colspan=\"2\" |March 1994\n|April 1994\n|October 1994 (Germany), January 1995 (US)\n| colspan=\"2\" |January 1995 (US)\n|August 1995 (US)\n|January 1996 (US)\n|March 1996\n| colspan=\"2\" |March 1997\n|November 1997\n| colspan=\"3\" |1998\n|Announced 1997\n|?\n|-\n!Discontinued\n| colspan=\"3\" |March 1994\n|?\n| colspan=\"2\" |April 1995\n|late 1994\n|June 1996\n|?\n|?\n|?\n|?\n|April 1997\n| colspan=\"3\" |February 1998\n|\n|\n|\n|\n|\n|-\n!Code name\n|Junior\n|\n|?\n|?\n|Junior\n|Lindy\n|?\n|Gelato\n|?\n|?\n|?\n|?\n|Dante\n|?\n|Q\n|?\n|\n|\n|\n|\n|\n|-\n!Model No.\n|H1000\n|\n|?\n|?\n|H1000\n|H0059\n|?\n|H0131\n|?\n|?\n|?\n|?\n|H0196\n|H0208\n|H0136\n|H0149\n|\n|\n|\n|\n|\n|-\n!Processor\n| colspan=\"13\" |ARM 610 (20 MHz)\n|ARM 710a (25 MHz)\n| colspan=\"7\" |StrongARM SA-110 (162 MHz)\n|-\n!ROM\n| colspan=\"7\" |4 MB\n| colspan=\"2\" |4 MB (OS 1.3) or 8 MB (OS 2.0) \n|5 MB\n|4 MB\n| colspan=\"5\" |8 MB \n|\n|\n|\n|\n|\n|-\n!System Memory (RAM)\n| colspan=\"5\" |490 KB* SRAM\n|544 KB SRAM\n|490 KB* SRAM\n| colspan=\"2\" |639/687 KB DRAM\n|544 KB SRAM\n|639 KB DRAM\n| colspan=\"2\" |1199 KB DRAM\n|1 MB DRAM (Upgradable) \n|1 MB DRAM \n|4 MB DRAM \n| colspan=\"3\" |1 MB DRAM\n|?\n|1 MB DRAM\n|-\n!User Storage \n| colspan=\"5\" |150 KB* SRAM\n|480 KB SRAM\n|150 KB* SRAM\n| colspan=\"2\" |385/1361 KB Flash RAM\n|480 KB SRAM\n|385 KB Flash RAM\n| colspan=\"2\" |1361 KB Flash RAM\n|2 MB Flash RAM(Upgradable) \n| colspan=\"5\" |4 MB Flash RAM\n|?\n|4 MB Flash RAM\n|-\n!Total RAM\n| colspan=\"5\" |640 KB \n|1 MB \n|640 KB\n| colspan=\"2\" |1.0/2.0 MB \n| colspan=\"2\" |1 MB \n| colspan=\"2\" |2.5 MB \n|3 MB (Upgradable via Internal Expansion)\n|5 MB \n|8 MB\n| colspan=\"3\" |5 MB\n|?\n|5 MB\n|-\n!Display\n| colspan=\"5\" |336 × 240 (B&W)\n|320 × 240 (B&W)\n|336 × 240 (B&W)\n|320 × 240 (B&W)\n|320 × 240 (B&W) w/ backlight\n|320 × 240 (B&W)\n| colspan=\"3\" |320 × 240 (B&W) w/ backlight\n| colspan=\"6\" |480 × 320 grayscale (16 shades) w/ backlight\n|\n|480 × 320 greyscale (16 shades) w/ backlight\n|-\n!Newton OS version\n| colspan=\"3\" |1.0 to 1.05, or 1.10 to 1.11\n|1.11\n| colspan=\"2\" |1.2 or 1.3\n|1.3\n| colspan=\"2\" |1.3 or 2.0\n| colspan=\"2\" |1.3\n| colspan=\"2\" |2.0\n|2.1 (2.2)\n| colspan=\"2\" |2.1\n| colspan=\"5\" |2.1\n|-\n!Newton OS languages\n|English or German\n|\n|English or Japanese\n|German\n|English, German or French\n|English or French\n|English or Japanese\n|English, German or French\n| colspan=\"4\" |English\n|English or German\n| colspan=\"2\" |English\n|English or German\n| colspan=\"3\" |English\n|German\n|French\n|-\n!Connectivity\n| colspan=\"3\" |RS-422, LocalTalk & SHARP ASK Infrared\n|Modem and Telephone dock Attachment\n| colspan=\"4\" |RS-422, LocalTalk & SHARP ASK Infrared\n|RS-422, LocalTalk & SHARP ASK Infrared\n|RS-422, LocalTalk, Infrared, ARDIS Network\n|RS-232, LocalTalk WLAN, V.22bis modem, Analog/Digital Cellular, CDPD, RAM, ARDIS, Trunk Radio\n|RS-232, LocalTalk, CDPD, WLAN, Optional dGPS, GSM, or IR via modular attachments\n|RS-422, LocalTalk & SHARP ASK Infrared\n|IrDA, headphone port, Interconnect port, LocalTalk, Audio I/O, Autodock\n|Dual-mode IR;IrDA & SHARP ASK, LocalTalk, Audio I/O, Autodock, Phone I/O\n|Dual-mode IR; IrDA & SHARP ASK, LocalTalk, Audio I/O, Autodock\n| colspan=\"3\" |Dual-mode IR;IrDA & SHARP ASK, LocalTalk, Audio I/O, Autodock, Phone I/O\n|?\n|Dual-mode IR;IrDA & SHARP ASK, LocalTalk, Audio I/O, Autodock, Phone I/O\n|-\n!PCMCIA\n| colspan=\"13\" |1 PCMCIA-slot II, 5v or 12v\n|1 PCMCIA-slot I/II/III, 5v\n| colspan=\"2\" |2 PCMCIA-slot II, 5v or 12v\n| colspan=\"2\" |1 PCMCIA-slot II, 5v or 12v\n|1 PCMCIA-slot II, 5v or 12v, 2nd slot Propriety Rado Card\n| colspan=\"2\" |1 PCMCIA-slot II, 5v or 12v, 1 Smart Card Reader\n|-\n!Power\n| colspan=\"5\" |4 AAA or NiCd rechargeable or external power supply\n|4 AA or NiCd rechargeable or external power supply \n|4 AAA or NiCd rechargeable or external power supply\n|4 AA or NiCd rechargeable or external power supply\n| colspan=\"2\" |NiCd battery pack or external power supply\n|4 AA or NiCd rechargeable or external power supply\n|NiCd battery pack or external power supply\n|4 AA or NiCd rechargeable or external power supply\n|NiMH battery pack (built-in) or external power supply\n| colspan=\"2\" |4 AA or NiMH rechargeable or external power supply\n| colspan=\"3\" |Custom NiMH rechargeable or external power supply\n|? Unknown, but likely external power supply\n|4 AA or NiMH rechargeable or external power supply\n|-\n!Dimensions\n(HxWxD)\n|\n|\n|\n\n(lid open)\n| colspan=\"2\" |\n|\n\n|\n\n(lid open)\n|\n\n|\n\n|\n\n|?\n|\n|\n|\n\n| colspan=\"2\" |\n|?\n|?\n|?\n|9 x 14.5 x 5.1 inches\n(23 x 37 x 13 cm)\n|?\n|-\n!Weight\n|\n|\n|\nwith batteries installed\n|\n|\n| with batteries installed\n|\nwith batteries installed\n|with batteries installed\n|\n|\n|?\n|\n|\n\nwith batteries installed\n|\n| colspan=\"2\" |\n|?\n|?\n|?\n|?\n|?\n|}\n*  Varies with installed OS\n\nNotes: The eMate 300 actually has ROM chips silk screened with 2.2 on them. Stephanie Mak on her website discusses this:\nIf one removes all patches to the eMate 300 (by replacing the ROM chip, and then putting in the original one again, as the eMate and the MessagePad 2000/2100 devices erase their memory completely after replacing the chip), the result will be the Newton OS saying that this is version 2.2.00. Also, the Original MessagePad and the MessagePad 100 share the same model number, as they only differ in the ROM chip version. (The OMP has OS versions 1.0 to 1.05, or 1.10 to 1.11, while the MP100 has 1.3 that can be upgraded with various patches.)\n\nTimeline\n\nThird party licenses\nThe Newton OS was also licensed to a number of third party developers including Sharp and Motorola who developed additional PDA devices based on the Newton platform. Motorola added wireless connectivity, as well as made a unique two-part design, and shipped additional software with its Newton device, called the Marco. Sharp developed a line of Newton devices called the ExpertPad PI-7000/7100; those were the same as Apple's MessagePad and MessagePad 100, the only difference is the physical design (the ExpertPads feature a screen lid, which Apple added in 1994 with the release of the MessagePad 110) and the naming.\n\nOther uses\n\nThere were a number of projects that used the Newton as a portable information device in cultural settings such as museums. For example, Visible Interactive created a walking tour in San Francisco's Chinatown but the most significant effort took place in Malaysia at the Petronas Discovery Center, known as Petrosains.\n\nIn 1995, an exhibit design firm, DMCD Inc., was awarded the contract to design a new  science museum in the Petronas Towers in Kuala Lumpur. A major factor in the award was the concept that visitors would use a Newton device to access additional information, find out where they were in the museum, listen to audio, see animations, control robots and other media, and to bookmark information for printout at the end of the exhibit.\n\nThe device became known as the ARIF, a Malay word for \"wise man\" or \"seer\" and it was also an acronym for A Resourceful Informative Friend. Some 400 ARIFS were installed and over 300 are still in use today.  The development of the ARIF system was extremely complex and required a team of hardware and software engineers, designers, and writers. ARIF is an ancestor of the PDA systems used in museums today and it boasted features that have not been attempted since.\n\nAnyway & Company firm was involved with the Petronas Discovery Center project back in 1998 and NDAs were signed which prevents getting to know more information about this project.  It was confirmed that they purchased of MP2000u or MP2100's by this firm on the behalf of the project under the name of \"Petrosains Project Account\". By 1998 they had invested heavily into the R&D of this project with the Newton at the center. After Apple officially cancelled the Newton in 1998 they had to acquire as many Newtons as possible for this project. It was estimated initially 1000 Newtons, but later readjusted the figure to possibly 750 Newtons. They placed an “Internet Call” for Newtons. They purchased them in large and small quantities.\n\nThe Newton was also used in healthcare applications, for example in collecting data directly from patients. Newtons were used as electronic diaries, with patients entering their symptoms and other information concerning their health status on a daily basis. The compact size of the device and its ease of use made it possible for the electronic diaries to be carried around and used in the patients' everyday life setting. This was an early example of electronic patient-reported outcomes (ePRO).\n\nSee also\n Newton (platform)\n Newton OS\n eMate 300\n NewtonScript\n Orphaned technology\n Pen computing\n\nReferences\n\nBibliography\n Apple's press release on the debut of the MessagePad 2100: \n Apple's overview of features & limitations of Newton Connection Utilities: \n Newton overview at Newton Source archived from Apple: \n Newton FAQ: \n Newton Gallery: \n Birth of the Newton: \n The Newton Hall of Fame: People behind the Newton: \n Pen Computing's Why did Apple kill the Newton?: \n Pen Computing's Newton Notes column archive: \n A.I. Magazine article by Yaeger on Newton HWR design, algorithms, & quality: \n Associated slides: \n Info on Newton HWR from Apple's HWR Technical Lead: \n Notes on the History of Pen-based Computing: \n This links to:\n\nExternal links\n\nAdditional resources and information\n Defying Gravity: The Making of Newton, by Kounalakis & Menuez (Hardcover)\n Hardcover: 192 pages\n Publisher: Beyond Words Publishing (October 1993)\n \n \n \n Complete Developer's manual for the StrongARM SA-110\n Beginner's overview of the StrongARM SA-110 Microprocessor\n\nReviews\n MessagePad 2000 review at \"The History and Macintosh Society\"\n Prof. Wittmann's collection of Newton & MessagePad reviews\n\nApple Newton\nProducts introduced in 1993\nApple Inc. personal digital assistants"
}