{
  "title": "Mickey's Racing Adventure",
  "content": "Mickey's Racing Adventure is a racing video game developed by Rare and published by Nintendo for the Game Boy Color in 1999. It was followed by Mickey's Speedway USA in 2001.\n\nGameplay\nMickey's Racing Adventure is a single-player racing game with adventure elements. It is played from an isometric perspective and races consist of land or water tracks.\n\nDevelopment and release\nMickey's Racing Adventure was developed by Rare over the course of approximately six months. It is the company's second Game Boy Color game and its extra mini-games are based on classics such as Loco-Motion. It supports the Game Boy Color's infrared port to transmit data between machines. The game was released in November 1999.\n\nReception\n\nMickey's Racing Adventure received positive reviews from critics. IGN reviewer Craig Harris felt that it was Rare's \"first real quality Game Boy Color-exclusive title\" after their \"atrocious\" Conker's Pocket Tales, while GameSpot praised the number of tracks and characters to choose from, stating that Mickey's Racing Adventure \"shows how Game Boy racers should be done\". N64 Magazine said that the game successfully combines the exploration aspects of Rare's Diddy Kong Racing with the racing style of R.C. Pro-Am for the Nintendo Entertainment System, but criticised the lack of a multiplayer mode. Game Informer gave the game an overall score of 8 out of 10 noting the game being well designed, especially for a Disney game, and commenting that the game has plenty of racing courses, characters, power ups and vehicle upgrades concluding \"Mickey's Racing Adventure won't take you an exorbitant amount of time to finish, but you’ll like it all the way to the end\".\n\nReferences\n\nExternal links\n\n1999 video games\nGame Boy Color games\nGame Boy Color-only games\nMickey Mouse video games\nNintendo games\nRacing video games\nRare (company) games\nSingle-player video games\nVideo games scored by David Wise\nVideo games developed in the United Kingdom"
}