{
  "title": "Omega Boost",
  "content": "is a three dimensional shoot 'em up developed by Polyphony Digital and Cyberhead for the PlayStation. It was released in 1999 throughout Japan, North America, and Europe by Sony Computer Entertainment.\n\nThe game features mecha designs by Shoji Kawamori of Macross fame.\n\nBeing released late in the PlayStation's life, Omega Boost is said to have some of the best graphics on the console with parts of the game running at 60 frame/s. The game was criticized by some reviewers for being too short (Nine levels with nine unlockable special missions) and simplistic. However, it is still considered one of the best Macross-style mecha simulation games produced and is thought of by many as a sleeper hit due to its poor marketing.\n\nOmega Boost is so far the only non-racing game developed by Polyphony Digital, whose works comprise almost solely of racing simulators.\n\nGameplay\nThe gameplay takes place in waves, meaning that enemies will appear in the same groups and formations in the same order every playthrough. The player doesn't get to choose what order to engage an entire stage's enemies, just the ones in the current wave. This rail-shooter element does not hamper the player's freedom to fly where they choose in most stages. On some stages, the player has complete control of Omega Boost, specifically areas where they are in Planet ETA's atmosphere. Other stages limit the player in terms of speed (falling through the timeshift).\n\nThe \"Boost\" part of the mech's name comes from Omega Boost's booster pack, allowing the player to move in any direction and circle strafe enemies with a scanning and lock-on feature. Omega Boost also learns the Viper Boost maneuver once it is levelled up. Viper Boost, when engaged, will cause Omega Boost to glow blue as it tears through enemies on screen. Destroying enemies will cause the gauge to refill incrementally.   However, the game can be completed without ever using Viper Boost.  If Viper Boost is used, the final ranking will have \"Pixy\" added onto the title, showing the attack during play.\n\nStory\nIn the past, an artificial intelligence named AlphaCore peacefully and silently co-existed with the human race, though its origins remain unknown. Eventually, the human race advanced to the point where they became aware of AlphaCore and its capabilities, and were shocked by what it was capable of. Fearing its power, humanity tried to 'dump' AlphaCore- presumably an attempt to destroy or manipulate the AI- but the action failed, only provoking the AlphaCore and starting a war between humans and machines. This war goes on into the distant future, with mankind steadily being outmatched by AlphaCore, who is capable of destroying entire cities easily.\n\nIn this future, scientists devise a way to travel through time in order stop AlphaCore. However, AlphaCore discovers this plan and steals the time travel technology. It builds a giant shaft, the Timeshaft, on a desolate, mined out planet named ETA, and uses this to travel back in time and alter ENIAC, the first general-use computer created and considered by AlphaCore to be the first artificial intelligence. It plans to implant a virus into one of ENIAC's vacuum tubes, thus creating a predestination paradox and ensuring its survival in the present day.\n\nTo counter AlphaCore's scheme, human scientists create the Omega Boost, a giant robot capable of traveling through time using the Direct Drive System (DDS). Lester J. Hemming, an experienced pilot and one of very few who can pilot the Omega Boost, is charged with traveling back in time to stop AlphaCore by finding ENIAC and replacing the AlphaCore infected vacuum tube, thus stopping AlphaCore before it even has a chance to exist.\n\nOmega Boost manages to pierce the defenses around planet ETA, encountering along the way a red 'knockoff' of Omega Boost made by AlphaCore named Beta Boost, and enters the Timeshaft encountering resistance around and inside. However, after traveling through, it finds itself not in the past of 1946, but near planet ETA a few decades into the future. The future ETA has become the home base of AlphaCore and turned into a cybernetic planet little resembling its present self, overrun with AlphaCore's machinery. Omega Boost proceeds to breach the planetary defenses, once again defeating Beta Boost (who has been given a version of the Viper Boost attack) and fending off the avatar of AlphaCore itself.\n\nAfterwards, the planet is destroyed but the Timeshaft survives, now its own structure akin to a space station, and AlphaCore attempts to escape through it to an unknown time. Omega Boost pursues it and destroys its three forms- crystal, serpent-like machine, and finally the true form, a vaguely fairylike humanoid with wings. After defeat, AlphaCore attempts to possess Omega Boost, but fails, disintegrating.\n\nThe end cutscene depicts Omega Boost arriving in 1946, crashing into a forest in North America. Lester locates ENIAC and, through a small probe, finds the vacuum tube infected by AlphaCore's virus, switching it out for the safe tube seen in the intro; thus preventing AlphaCore's rise to power and subsequent destruction of the human race.\n\nDevelopment\nSimilarities between Omega Boost and Sega's Panzer Dragoon series led to a rumor that former members of Team Andromeda, dissolved in 1998, had joined Polyphony Digital. This rumor turned out to be true as the lead designer and programmer on Omega Boost was Yuji Yasuhara, who had worked on Panzer Dragoon Zwei.\n\nAmong the games created by Polyphony Digital, Omega Boost was the only shoot 'em up, while the others are vehicle racing simulators.\n\nAudio\n\nThe Omega Boost Original Soundtrack was released on June 19, 1999.\n\nThe album had a limited print and is considered very rare. As such, many fans of the game have found it easier to rip the soundtrack from the game disc itself, however, this leads to confusion over the official titles of the tracks, mainly because they are labeled as \"areas\" in-game instead of the official names given by the creators.\n\nThe opening movie and ending credits in each version features different music. The Japanese version uses \"Shade\" by Feeder as its opening theme and final boss theme, and \"Ismeel\" by Dip in the Pool as its ending theme. The North American version licenses songs by Loudmouth, opening with \"Fly\" and closing with \"The Road\"; as well as featuring \"Otsegolation\" by Static-X, played during the title screen and the final boss. Finally, the European version uses \"Dreamer\" by Cast as the opening, final boss and ending themes.\n\nMerchandise\nA series of action figures was created by Blue Box Toys, featuring mecha from the game, including: Omega Boost and Beta Boost. A third figure, Herbarcher, was shown on the back of the boxes; however, it was never released.\n\nReception\n\nOmega Boost received above-average reviews according to the review aggregation website GameRankings. However, Chris Charla of NextGen called it \"The textbook definition of a two-star game: competent, but totally uninspired.\" In Japan, Famitsu gave it a better score of 28 out of 40.\n\nNotes\n\nReferences\n\nExternal links\n\nOmega Boost at Game Set Watch\n\n1999 video games\nPlayStation (console) games\nPlayStation (console)-only games\nRail shooters\nScience fiction video games\nSingle-player video games\nSony Interactive Entertainment games\nVideo games about mecha\nVideo games developed in Japan\nPolyphony Digital games"
}