{
  "title": "R3000",
  "content": "The R3000 is a 32-bit RISC microprocessor chipset developed by MIPS Computer Systems that implemented the MIPS I instruction set architecture (ISA). Introduced in June 1988, it was the second MIPS implementation, succeeding the R2000 as the flagship MIPS microprocessor. It operated at 20, 25 and 33.33 MHz.\n\nThe MIPS 1 instruction set is small compared to those of the contemporary 80x86 and 680x0 architectures, encoding only more commonly used operations and supporting few addressing modes. Combined with its fixed instruction length and only three different types of instruction formats, this simplified instruction decoding and processing. It employed a 5-stage instruction pipeline, enabling execution at a rate approaching one instruction per cycle, unusual for its time.\n\nThis MIPS generation supports up to four co-processors. In addition to the CPU core, the R3000 microprocessor includes a Control Processor (CP), which contains a Translation Lookaside Buffer and a Memory Management Unit. The CP works as a coprocessor. Besides the CP, the R3000 can also support an external R3010 numeric coprocessor, along with two other external coprocessors.\n\nThe R3000 CPU does not include level 1 cache. Instead, its on-chip cache controller operates external data and instruction caches of up to 256 KB each. It can access both caches during the same clock cycle.\n\nThe R3000 found much success and was used by many companies in their workstations and servers. Users included:\n Ardent Computer\n Atari COJAG (A modified Atari Jaguar for arcade systems).\n Digital Equipment Corporation (DEC) for their DECstation workstations and multiprocessor DECsystem servers.\n Evans & Sutherland for their Vision (ESV) series workstations.\n LSI Logic for their CW4003 RISC processor core and DCAM-101 system-on-a-chip.\n MIPS Computer Systems for their MIPS RISC/os Unix workstations and servers.\n NEC for their RISC EWS4800 workstations and UP4800 servers.\n Prime Computer\n Pyramid Technology\n Seiko Epson\n Silicon Graphics for their Professional IRIS, Personal IRIS and Indigo workstations, and the multiprocessor Power Series visualization systems.\n Sony for their PlayStation and PlayStation 2 (SCPH-10000 to SCPH-700XX - clocked at 37.5 MHz for use as an I/O CPU and at 33.8 MHz for compatibility with PlayStation games) video game consoles, and NEWS workstations, as well as the Bemani System 573 Analog arcade unit, which runs on the R3000A.\n Tandem Computers for their NonStop Cyclone/R and CLX/R fault-tolerant servers.\n Whitechapel Workstations for their Hitech-20 workstation.\n New Horizons Probe \n\nThe R3000 was also used as an embedded microprocessor. When advances in technology rendered it obsolete for high-performance systems, it found continued use in lower-cost designs. Companies such as LSI Logic developed derivatives of the R3000 specifically for embedded systems.\n\nThe R3000 was a further development of the R2000 with minor improvements including larger TLB and a faster bus to the external caches. The R3000 die contained 115,000 transistors and measured about 75,000 square mils (48 mm2). MIPS was a fabless semiconductor company, so the R3000 was fabricated by MIPS partners including Integrated Device Technology (IDT), LSI Logic, NEC Corporation, Performance Semiconductor, and others. It was fabricated in a 1.2 μm complementary metal–oxide–semiconductor (CMOS) process with two levels of aluminium interconnect.\n\nDerivatives of the R3000 for non-embedded applications include:\n R3000A - A further development by MIPS introduced in 1989. It operated at clock frequencies up to 40 MHz.\n PR3400 - Developed by Performance Semiconductor, introduced in May 1991, also at up to 40 MHz. It integrated the Performance Semiconductor PR3000A and PR3010A onto a single die.\n\nDerivatives of the R3000 for embedded applications include:\n CW4003, DCAM-101 - Aimed at digital camera applications, the CW4003 core featured a \"multiplier-addition bolt-on\" (MABO) unit for accelerated integer arithmetic and a pixel-processing accelerator (PPA) unit accessible via the coprocessor 2 interface. The DCAM-101 combined the CW4003 core with modules interfacing to a camera sensor, display, storage and other peripherals, also incorporating a JPEG compression/decompression unit.\n PR31500, PR31700 - Microprocessors from Philips Semiconductors used in the Philips Velo handheld PC range. The 75 MHz PR31700 was fabricated in a 350 nm process, delivered in a 208-pin LQFP, it operated at 3.3 V and dissipated only 350 mW.\n RISController - A family of low-end microcontrollers from IDT. Models include the R3041, R3051, R3052, R3071 and R3081.\n TX3900 - A microcontroller from Toshiba.\n Mongoose-V - A radiation-hardened and expanded 10–15 MHz CPU for use on spacecraft, it is still in use today in applications such as NASA's New Horizons space probe.\n\nReferences\n\n \"MIPS Technologies R3000\"\n\nFurther reading\n\nMIPS implementations\nMIPS microprocessors\n32-bit microprocessors"
}