{
  "title": "Stuart Langridge",
  "content": "Stuart Langridge (also known as 'Aq' or 'Zippy' ) is a podcaster, developer and author. He became a member of the Web Standards Project's DOM Scripting Task Force, an invited expert on the W3C HTML Working Group and is an acknowledged commentator on W3C Document Object Model and JavaScript techniques.\n\nPodcasts \nLangridge is known as a presenter of the now defunct LugRadio, which was a free software podcast in the UK. Along with Jono Bacon, he was the longest-serving member of the team and often served to incite discussion about issues that more directly related to software freedom. In LugRadio he frequently advocated freedom, yet despite this often attracted criticism for using proprietary software.\n\nLangridge was involved in the Shot of Jaq podcast, in collaboration with his former Lugradio co-host Jono Bacon. He's now a part of the Bad Voltage podcast, together with Jono Bacon and Jeremy Garcia (founder of LinuxQuestions.org). Bryan Lunduke (founder of Jupiter Broadcasting) was also a founder member of the Bad Voltage podcast but has since moved on due to other commitments. The podcast first aired in October 2013.\n\nProgramming \nHe has worked on projects including Jokosher, a multi-track audio editor for GNOME, and Jackfield, a program to run Mac OS X Dashboard widgets under GNOME.\n\nCareer \nIn January 2009 Langridge joined Canonical as a developer and left the company in 2013 to work as a freelancer for Kryogenix's consulting. At Canonical he worked on the Desktop Couch for Ubuntu in his role as Canonical Ltd. staffer.\n\nAuthor \nLangridge has written two books for technical publisher SitePoint, DHTML Utopia, and Run Your Own Web Server Using Linux & Apache (with Tony Steidler-Dennison) as well as writing the Stylish Scripting weblog during 2005.\n\nReferences\n\nExternal links \nStuart Langridge's website and blog\nLugRadio\nJokosher\nJackfield\nThe Bad Voltage community forum with link to the current and all past podcast episodes\n\nLiving people\nOpen source people\nCopyright activists\nFree software programmers\n1976 births\nUbuntu (operating system) people"
}