{
  "title": "Ziply Fiber",
  "content": "Northwest Fiber, LLC, doing business as Ziply Fiber, is an American telecommunications company based in Kirkland, Washington. Ziply is a subsidiary of WaveDivision Capital, a private investment company, which is also Kirkland-based. The company started operations on May 1, 2020 when it completed its acquisition of Frontier Communications Northwest operations and assets for $1.4 billion; Frontier sold its Northwest operations after filing for bankruptcy protection in April 2020. Ziply Fiber's footprint covers the Pacific Northwest region, specifically the states of Washington, Oregon, Idaho and Montana. Its key offerings include fiber internet and phone for residential customers, Business Fiber Internet, and Ziply Voice services for small businesses; and a variety of internet, networking and voice solutions for enterprise customers. The company will also continue to support DSL and grandfathered TV customers. Ziply has stated that it plans on investing $500 million  to improve its network and service throughout its footprint. This includes bringing fiber to nearly 85%  of its network, which mainly encompasses rural communities. Currently approximately 30% have access to fiber as of June 2020. \n\nZiply Fiber serves more than 500,000 customers across the four states and has a workforce of approximately 1,000 employees. It has major offices in Everett, Washington; Beaverton, Oregon, and Hayden, Idaho.\n\nHistory\n\nGeneral Telephone Company of the Northwest, Inc. was founded in 1964 and later became GTE Northwest, Incorporated. GTE Northwest originally served Idaho, Montana, Oregon, Washington.\n\nIn 1993, GTE acquired Continental Telephone (ConTel); as a result, ConTel operations in Oregon, Washington, and Idaho were merged into GTE Northwest. In 1994, GTE sold ConTel of Idaho to Citizens Communications (which later became Frontier Communications). In 1995, GTE sold operations in Montana to Citizens Communications, and absorbed ConTel of Oregon into GTE's existing Oregon operations.\n\nIn 2000, Bell Atlantic acquired GTE, forming Verizon. As a result, GTE Northwest was renamed Verizon Northwest, Inc. It continued to provide local telephone service to former GTE regions and some ConTel regions in Idaho, Washington, and Oregon.\n\nVerizon Northwest, along with several other Verizon wireline operating companies, were acquired by Frontier Communications on July 1, 2010. The company's name was changed to '''Frontier Communications Northwest, Inc.\n\nIn May 2019, WaveDivision Capital announced that it would buy Frontier Communications Northwest operations for nearly $1.4 billion as part of a new service. WaveDivision Capital (“WDC”) was founded in 2003 by broadband entrepreneur Steven Weed. It is a private investment firm focused on the broadband industry, and its stated goal is “to bring better internet connections to more homes and businesses throughout North America”. Weed was the CEO of Wave Broadband until 2018, when the company was sold and he departed. Despite having similar names and key players WaveDivision Capital and Wave Broadband are not related. WaveDivision Capital formed Northwest Fiber to acquire the Frontier Communications Northwest operations, which was approved by federal and state regulators on February 19, 2020, with the new service receiving the name of \"Ziply Fiber\". Frontier Communications Northwest division ceased operations on April 30, 2020, and was replaced the following day by Ziply Fiber. As of 2020, the company has almost 1000 employees and serves over 500,000 customers.\n\nReferences\n\nSources\nVerizon Northwest, Inc.\n\nExternal links\n \n Home | WaveDivision Capital\n\nCommunications in Washington (state)\nCompanies based in Kirkland, Washington\nFrontier Communications\nAmerican companies established in 2020"
}