{
  "title": "Amiga 500",
  "content": "The Amiga 500, also known as the A500, was the first popular version of the Amiga home computer, \"redefining the home computer market and making so-called luxury features such as multitasking and colour a standard long before Microsoft or Apple sold these to the masses\". It contains the same Motorola 68000 as the Amiga 1000, as well as the same graphics and sound coprocessors, but is in a smaller case similar to that of the Commodore 128.\n\nCommodore announced the Amiga 500 at the January 1987 winter Consumer Electronics Showat the same time as the high-end Amiga 2000. It was initially available in the Netherlands in April 1987, then the rest of Europe in May. In North America and the UK it was released in October 1987 with a  list price. It competed directly against models in the Atari ST line.\n\nThe Amiga 500 was sold in the same retail outlets as the Commodore 64, as opposed to the computer store-only Amiga 1000. It proved to be Commodore's best-selling model, particularly in Europe. Although popular with hobbyists, arguably its most widespread use was as a gaming machine, where its graphics and sound were of significant benefit. It was followed by a revised version of the computer, the Amiga 500 Plus, and the 500 series was discontinued in 1992.\n\nReleases \nIn mid-1988, the Amiga 500 dropped its price from £499 to £399 (https://amr.abime.net/issue_535_pages page 7), and it was later bundled with the Batman Pack in the United Kingdom (from October 1989 to September 1990) which included the games Batman, F/A-18 Interceptor, The New Zealand Story and the bitmap graphics editor Deluxe Paint 2. Also included was the Amiga video connector which allows the A500 to be used with a conventional CRT television.\n\nIn November 1991, the enhanced Amiga 500 Plus replaced the 500 in some markets. It was bundled with the Cartoon Classics pack in the United Kingdom at £399, although many stores still advertised it as an 'A500'. The Amiga 500 Plus was virtually identical except for its new operating system, different 'trap-door' expansion slot and slightly different keyboard, and in mid-1992, the two were discontinued and effectively replaced by the Amiga 600. In late 1992, Commodore released the Amiga 1200, a machine closer in concept to the original Amiga 500, but with significant technical improvements. Despite this, neither the A1200 nor the A600 replicated the commercial success of its predecessor. By this time, the home market was strongly shifting to IBM PC compatibles with VGA graphics and the \"low-cost\" Macintosh Classic, LC, and IIsi models.\n\nDescription \nOutwardly resembling the Commodore 128 and codenamed \"Rock Lobster\" during development, the Amiga 500's base houses a keyboard and a CPU in one shell, unlike the Amiga 1000. The keyboard for Amiga 500s sold in the United States contains 94 keys, including ten function keys, four cursor keys, and a number pad. All European versions the keyboard have an additional two keys, except for the British variety, which still uses 94 keys. It uses a Motorola 68000 microprocessor running at  in NTSC regions and  in PAL regions. The CPU implements a 32-bit model and has 32-bit registers, but it has a 16-bit main ALU and uses a 16-bit external data bus and a 23-bit address bus, providing a maximum of 16 MB of address space. Also built in to the base of the computer is a -inch floppy disk drive. The user can also install up to three external floppy drives, either - or -inch, via the disk drive port. The second and third additional drives are installed by daisy-chaining them. Supported by these drives are double-sided disks with a capacity of 901,120 bytes, as well as 360- and 720-KB disks formatted for IBM PC compatibles.\n\nThe earliest Amiga 500 models use nearly the same Original Amiga chipset as the Amiga 1000. So graphics can be displayed in multiple resolutions and color depths, even on the same screen. Resolutions vary from 320×200 (up to 32 colors) to 640×400 (up to 16 colors) for NTSC (704×484 overscan) and 320×256 to 640×512 for PAL (704×576 overscan.) The system uses planar graphics, with up to five bitplanes (four in high resolution) allowing 2-, 4-, 8-, 16-, and 32-color screens, from a palette of 4096 colors. Two special graphics modes are also available: Extra HalfBrite, which uses a 6th bitplane as a mask to cut the brightness of any pixel in half (resulting in 32 arbitrary colors plus 32 more colors set at half the value of the first 32), and Hold-And-Modify (HAM) which allows all 4096 colors to be used on screen simultaneously. Later revisions of the chipset are PAL/NTSC switchable in software.\n\nThe sound chip produces four hardware-mixed channels, two to the left and two to the right, of 8-bit PCM at a sampling frequency up to .  Each hardware channel has its own independent volume level and sampling rate, and can be designated to another channel where it can modulate both volume and frequency using its own output.  With DMA disabled it's possible to output with a sampling frequency up to . There is a common trick to output sound with 14-bit precision that can be combined to output 14-bit  sound.\n\nThe stock system comes with AmigaOS version 1.2 or 1.3 and  of chip RAM (150 ns access time), one built-in double-density standard floppy disk drive that is completely programmable and can read  IBM PC disks,  standard Amiga disks, and up to  using custom-formatting drivers.\n\nDespite the lack of Amiga 2000-compatible internal expansion slots, there are many ports and expansion options. There are two DE9M Atari joystick ports for joysticks or mice, and stereo audio RCA connectors (1 V p-p). There is a floppy drive port for daisy-chaining up to three extra floppy disk drives via a DB23F connector. The then-standard RS-232 serial port (DB25M) and Centronics parallel port (DB25F) are also included. The power supply is (, ). \nThe system displays video in analog RGB  PAL or  NTSC through a proprietary DB23M connector and in NTSC mode the line frequency is  HSync for standard video modes, which is compatible with NTSC television and CVBS/RGB video, but out of range for most VGA-compatible monitors, while a multisync monitor is required for some of the higher resolutions. This connection can also be genlocked to an external video signal. The system was bundled with an RF adapter to provide output on televisions with a coaxial RF input, while monochrome video is available via an RCA connector (also coaxial). On the left side, behind a plastic cover, there is a Zorro (Zorro I) bus expansion external edge connector with 86 pins. Peripherals such as a hard disk drive can be added via the expansion slot and are configured automatically by the Amiga's AutoConfig standard, so that multiple devices do not conflict with each other. Up to  of so-called \"fast RAM\" (memory that can be accessed by the CPU only) can be added using the side expansion slot. This connector is electronically identical with the Amiga 1000's, but swapped on the other side.\n\nThe Amiga 500 has a \"trap-door\" slot on the underside for a RAM upgrade (typically ). This extra RAM is classified as \"fast\" RAM, but is sometimes referred to as \"slow\" RAM: due to the design of the expansion bus, it is actually on the chipset bus. Such upgrades usually include a battery-backed real-time clock. All versions of the A500 can have the additional RAM configured as chip RAM by a simple hardware modification, which involves fitting a later model (8372A) Agnus chip. Likewise, all versions of the A500 can be upgraded to  chip RAM by fitting the  chip and adding additional memory.\n\nThe Amiga 500 also sports an unusual feature for a budget machine, socketed chips, which allow easy replacement of defective chips. The CPU can be directly upgraded on the motherboard to a 68010; or to a 68020, 68030, or 68040 via the side expansion slot; or by removing the CPU and plugging a CPU expansion card into the CPU socket (this requires opening the computer and thus voided any remaining warranty).  In fact, all the custom chips can be upgraded to the Amiga Enhanced Chip Set (ECS) versions.\n\nThe plastic case is made of acrylonitrile butadiene styrene, or ABS. ABS degrades with time due to exposure to oxygen, causing a yellowing of the case. Other factors contributing to the degradation and yellowing include heat, shear, and ultraviolet light. The yellowing can be reversed by using an optical brightener, though without stabilizing agents or antioxidants to block oxygen, the yellowing will return.\n\nTechnical specifications \n\n OCS (1.2 & 1.3 models) or ECS (1.3 and 500+ 2.04 models) chipset. ECS revisions of the chipset made PAL/NTSC mode switchable in software.\n Sound: 4 hardware-mixed channels of 8-bit sound at up to . The hardware channels have independent volumes (65 levels) and sampling rates, and are mixed down to two fully left and fully right stereo outputs. A software controllable low-pass audio filter is also included.\n 512 KB of chip RAM (150 ns access time)\n AmigaOS 1.2 or 1.3 (upgradeable up to 3.1.4 if 2 MB of RAM are installed)\n One 3.5\" double-density floppy disk drive is built in, which is completely programmable and thus can read  IBM PC disks,  standard Amiga disks, and up to  with custom formatting (such as Klaus Deppich's diskspare.device). Uses  (5 rotations/second) and .\n Built-in keyboard\n A two-button mouse is included.\n\nGraphics \n PAL mode: 768×580 maximum (overscan interlaced if viewed on composite monitor/TV). Typical resolutions: 320×256, 640×256 or 640×512 (all displayed with borders). \n NTSC mode: 768×484 maximum (overscan interlaced if viewed on composite monitor/TV). Typical resolutions: 320×200, 640×200 or 640×400 (all displayed with borders). \n Graphics can be of arbitrary dimensions, resolution and colour depth, even on the same screen. The Amiga can show multiple resolution modes at the same time, splitting the screen vertically.\n Planar graphics are used, with up to 5 bitplanes (4 in hires); this allowed 2, 4, 8, 16 and 32 colour screens, from a palette of 4096 colours. \n Two special graphics modes are also included: \n Extra Half Brite (EHB), which uses a 6th bitplane as a mask that halved the brightness of any colour seen\n Hold-And-Modify (HAM), which allows all 4096 colours on screen at once. HAM makes it possible to use  over a  wide span. This works by letting each pixel position use the previous RGB value and modify one of the red, green or blue values to a new 4-bit value. This will cause some negligible colour artifacts however.\n\nMemory \nUsing various expansion techniques, the A500's total RAM can reach up to 138 MB – 2 MB Chip RAM, 8 MB 16-bit Fast RAM, and 128 MB 32-bit Fast RAM.\n\nChip RAM \nThe stock 512 KB Chip RAM can be complemented by 512 KB using a \"trapdoor\" expansion (Commodore A501 or compatible). While that expansion memory is connected to the chip bus, hardware limitations of early stock Agnus chip revisions prevent its use as Chip RAM, only the CPU can access it. Suffering from the same contention limitations as Chip RAM, that memory is known as \"Slow RAM\" or \"Pseudo-fast RAM\". Agnus revisions shipped with late A500 are ECS and allow use of trapdoor RAM as real Chip RAM for a total 1 MB. \n\nAdditionally, several third-party expansions exist with up to 2 MB on the trapdoor board. Using a Gary adapter, that memory will be mapped as either split on Chip RAM and Slow RAM or fully as Slow RAM, depending on configuration.\n\nFurthermore, using an A3000 Agnus on an adapter board, it is possible to expand the Chip RAM to 2 MB, matching the A500+.\n\nFast RAM \n\"Fast\" RAM is located on the CPU-side bus. Its access is exclusive to the CPU and not slowed by any chipset access. The side expansion port allows for up to 8 MB of Zorro-style expansion RAM. Alternatively, a CPU adapter allows for internal expansion.\n\nAccelerator RAM \nInternal or external CPU accelerators often include their own expansion memory. 16-bit CPUs are limited by the 24-bit address space but they can repurpose otherwise unused memory space for their included RAM. 32-bit CPU accelerators aren't limited by 24-bit addressing and can include up to 128 MB of Fast RAM (and potentially more).\n\nMemory map\n\nConnectors \n\n Two Atari joystick ports for joysticks or mice\n Stereo audio RCA connectors ( p-p)\n A floppy drive port (DB23F), for daisy-chaining up to 3 extra floppy disk drives via a DB23F connector\n A standard RS-232 serial port (DB25M)\n A parallel port (DB25F)\n Power inlet (, )\n Analogue RGB  PAL and  NTSC video output, provided on an Amiga-specific DB23M video connector. Can drive video with  HSync for standard Amiga video modes. This is not compatible with most VGA monitors. A Multisync monitor is required for some higher resolutions. This connection can also be genlocked to an external video signal. An RF adapter (A520) was frequently bundled with the machine to provide output on regular televisions or on composite monitors. A digital 16 colour Red-Green-Blue-Intensity signal is available too on the same connector.\n Monochrome video via an RCA connector\n Zorro II bus expansion on the left side behind a plastic cover\n Trapdoor slot under the machine, for RAM expansion and real-time clock\n\nExpansions \n Expansion ports are limited to a side expansion port and a trapdoor expansion on the underside of the machine. The casing can also be opened up (voiding the warranty), all larger chips are socketed rather than being TH/SMD soldered directly to the motherboard, so they can be replaced by hand.\n The CPU can be upgraded to a Motorola 68010 directly or to a 68020, 68030 or 68040 via the side expansion slot or a CPU socket adapter board.\n The chip RAM can be upgraded to  directly on the motherboard, provided a Fat Agnus chip is also installed to support it.\n Likewise, all the custom chips can be upgraded to the ECS chipset.\n The A500+ model instead allowed upgrading by  trapdoor chip RAM without clock, but there was no visible means on board to map any of this as FAST, causing incompatibility with some stubbornly coded programs.\n There were modification instructions available for the A500 to solder or socket another  RAM on the board, then run extra address lines to the trapdoor slot to accommodate an additional  of fast or chip RAM depending on the installed chipset.\n Up to  of \"fast RAM\" can be added via the side expansion slot, even more if an accelerator with a non-EC (without reduced data/address bus) processor and 32-bit RAM is used.\n Hard drive and other peripherals can be added via the side expansion slot.\n Several companies provided combined CPU, memory and hard drive upgradesor provided chainable expansions that extended the bus as they were addedas there is only one side expansion slot.\n Expansions are configured automatically by AutoConfig software, so multiple pieces of hardware did not conflict with each other.\n\nDiagnostics\nWhen the computer is powered on a self-diagnostic test is run that will indicates failure with a specific colour:\n\n Medium green means no chip RAM found or is damaged.\n Red means bad kickstart-ROM.\n Yellow means the CPU has crashed (no trap routine or trying to run bad code) or a bad Zorro expansion card.\n Blue means a custom chip problem (Denise, Paula, or Agnus).\n Light green means CIA problem.\n Light gray means that the CIA might be defective.\n mean there is a ROM or CIA problem.\n Black-only (no video) means there is no video output.\n\nThe keyboard LED uses blink codes:\n\nOne blink means the keyboard ROM has a checksum error.\nTwo blinks means RAM failure.\nThree blinks means watchdog timer failure.\nMeasurements\n\nOverall (base): 6.2 cm x 47.4 cm x 33 cm; 2 7/16 in x 18 11/16 in x 13 in.\n\nTrap-door expansion 501 \n\nA popular expansion for the Amiga 500 was the Amiga 501 circuit board that can be installed underneath the computer behind a plastic cover. The expansion contains  RAM configured by default as \"Slow RAM\" or \"trap-door RAM\" and a battery-backed real-time clock (RTC).\n\nThe 512 KB trap-door RAM and 512 KB of original chip RAM will result in 1 MB of total memory. The added memory is known as \"Slow RAM\", as its access is impacted by chip-bus bandwidth contention, while the chipset is not actually able to address it.\n\nLater revisions of the motherboard provide solder-jumpers to relocate the trap-door RAM to the chip memory pool, given the Agnus chip is the newer ECS version, shipped in later A500 motherboards. Newest (rev 8) A500s would share motherboard with A500+, and configure the expansion memory as CHIP by default.\n\nSoftware \n\nEach time the Amiga 500 is booted, it executes code from the Kickstart ROM. The Amiga 500 initially came shipped with AmigaOS 1.2, but units since October 1988 had version 1.3 installed.\n\nReception and sales \nThe Amiga 500 was the best-selling model in the Amiga family of computers. The German computer magazine Chip awarded the model the annual \"Home Computer of the Year\" title three consecutive times. At the European Computer Trade Show 1991, it also won the Leisure Award for the similar \"Home Computer of the Year\" title. \n\nOwing to the inexpensive cost of the Amiga 500 in then price-sensitive Europe, sales of the Amiga family of computers were strongest there, constituting 85 percent of Commodore's total sales in the fourth quarter of 1990. The Amiga 500 was widely perceived as a gaming machine and the Amiga 2000 a computer for artists and hobbyists. \n\nIt has been claimed that Commodore sold as many as six million units worldwide. However, Commodore UK refuted that figure and said that the entire Amiga line sold between four and five million computers. Indeed, Ars Technica provides a year-by-year graph of the sales of all Amiga computers.\n\nThe machine is reported to have sold 1,160,500 units in Germany (including Amiga 500 Plus sales).\n\nAmiga 500 Plus \n\nThe Amiga 500 Plus (often A500 Plus or simply A500+) is a revised version of the original Amiga 500 computer. The A500+ featured minor changes to the motherboard to make it cheaper to produce than the original A500. It was notable for introducing new versions of Kickstart and Workbench, and for some minor improvements in the custom chips, known as the Enhanced Chip Set (or ECS).\n\nAlthough officially introduced in 1992, some Amiga 500 units sold in late 1991 actually featured the revised motherboard used in the A500+. Although the Amiga 500+ was an improvement to the Amiga 500, it was minor. It was discontinued and replaced by the Amiga 600 in summer 1992, making it the shortest-lived Amiga model.\n\nCompatibility problems \n\nDue to the new Kickstart v2.04, quite a few popular games (such as Treasure Island Dizzy, Lotus Esprit Turbo Challenge, and SWIV) failed to work on the Amiga 500+, and some people took them back to dealers demanding an original Kickstart 1.3 Amiga 500. This problem was largely solved by third parties who produced Kickstart ROM switching boards, that could allow the Amiga 500+ to be downgraded to Kickstart 1.2 or 1.3. It also encouraged game developers to use better programming habits, which was important since Commodore already had plans for the introduction of the next-generation Amiga 1200 computer. A program, Relokick, was also released (and included with an issue of CU Amiga) which loaded a Kickstart 1.3 ROM image into memory and booted the machine into Kickstart 1.3, allowing most incompatible software to run (the software did take up 512 KB of system memory, meaning that some 1 MB only games would now  fail for lack of available memory). In some cases, updated compatible versions of games were later released, such as budget versions of Lotus 1 and SWIV, and an update to Bubble Bobble. Double Dragon 2 by Binary Design received an update for ECS machines with the \"Amiga phase-alternated linescan version 4.01/ECS\". This solved compatibility issues with the graphics which appeared garbled on ECS machines, and it also slashed the in-game loading times from around 20 seconds to just over 6.\n\nTechnical specifications \n Motorola 68000 CPU running at  (PAL) /  (NTSC), like its predecessor\n 1 MB of Chip RAM (very early versions came with 512 KB)\n Kickstart 2.04 (v37.175)\n Workbench 37.67 (release 2.04)\n Built-in battery backed RTC (Real Time Clock)\n Full ECS chipset including new version of the Agnus chip and Denise chip\n\nSee also \n\n Amiga models and variants\n Minimigan open-source hardware FPGA implementation\n\nNotes\n\nReferences\n\nFurther reading\n\nExternal links\n\n Amiga 500 Buyers guide\n\nAmiga\nProducts introduced in 1987\n68000-based home computers"
}