{
  "title": "Antiderivative",
  "content": "In calculus, an antiderivative, inverse derivative, primitive function, primitive integral or indefinite integral of a function  is a differentiable function  whose derivative is equal to the original function . This can be stated symbolically as . The process of solving for antiderivatives is called antidifferentiation (or indefinite integration), and its opposite operation is called differentiation, which is the process of finding a derivative. Antiderivatives are often denoted by capital Roman letters such as  and .\n\nAntiderivatives are related to definite integrals through the second fundamental theorem of calculus: the definite integral of a function over a closed interval where the function is Riemann integrable is equal to the difference between the values of an antiderivative evaluated at the endpoints of the interval.\n\nIn physics, antiderivatives arise in the context of rectilinear motion (e.g., in explaining the relationship between position, velocity and acceleration). The discrete equivalent of the notion of antiderivative is antidifference.\n\nExamples\nThe function  is an antiderivative of , since the derivative of  is . And since the derivative of a constant is zero,  will have an infinite number of antiderivatives, such as , etc. Thus, all the antiderivatives of  can be obtained by changing the value of  in , where  is an arbitrary constant known as the constant of integration. Essentially, the graphs of antiderivatives of a given function are vertical translations of each other, with each graph's vertical location depending upon the value .\n\nMore generally, the power function  has antiderivative  if , and  if .\n\nIn physics, the integration of acceleration yields velocity plus a constant. The constant is the initial velocity term that would be lost upon taking the derivative of velocity, because the derivative of a constant term is zero. This same pattern applies to further integrations and derivatives of motion (position, velocity, acceleration, and so on). Thus, integration produces the relations of acceleration, velocity and displacement:\n\nUses and properties\nAntiderivatives can be used to compute definite integrals, using the fundamental theorem of calculus: if  is an antiderivative of the integrable function  over the interval , then:\n\nBecause of this, each of the infinitely many antiderivatives of a given function  may be called the \"indefinite integral\" of f and written using the integral symbol with no bounds:\n\nIf  is an antiderivative of , and the function  is defined on some interval, then every other antiderivative  of  differs from  by a constant: there exists a number  such that  for all .  is called the constant of integration. If the domain of  is a disjoint union of two or more (open) intervals, then a different constant of integration may be chosen for each of the intervals. For instance\n\nis the most general antiderivative of  on its natural domain \n\nEvery continuous function  has an antiderivative, and one antiderivative  is given by the definite integral of  with variable upper boundary:\n\nfor any  in the domain of . Varying the lower boundary produces other antiderivatives, but not necessarily all possible antiderivatives. This is another formulation of the fundamental theorem of calculus.\n\nThere are many functions whose antiderivatives, even though they exist, cannot be expressed in terms of elementary functions (like polynomials, exponential functions, logarithms, trigonometric functions, inverse trigonometric functions and their combinations). Examples of these are\n\n the error function \n the Fresnel function \n the sine integral \n the logarithmic integral function  and\n sophomore's dream \n\nFor a more detailed discussion, see also Differential Galois theory.\n\nTechniques of integration\nFinding antiderivatives of elementary functions is often considerably harder than finding their derivatives (indeed, there is no pre-defined method for computing indefinite integrals). For some elementary functions, it is impossible to find an antiderivative in terms of other elementary functions. To learn more, see elementary functions and nonelementary integral.\n\nThere exist many properties and techniques for finding antiderivatives. These include, among others:\n\n The linearity of integration (which breaks complicated integrals into simpler ones)\n Integration by substitution, often combined with trigonometric identities or the natural logarithm\n The inverse chain rule method (a special case of integration by substitution)\n Integration by parts (to integrate products of functions)\n Inverse function integration (a formula that expresses the antiderivative of the inverse  of an invertible and continuous function , in terms of the antiderivative of  and of ).\n The method of partial fractions in integration (which allows us to integrate all rational functions—fractions of two polynomials)\n The Risch algorithm\n Additional techniques for multiple integrations (see for instance double integrals, polar coordinates, the Jacobian and the Stokes' theorem)\n Numerical integration (a technique for approximating a definite integral when no elementary antiderivative exists, as in the case of )\n Algebraic manipulation of integrand (so that other integration techniques, such as integration by substitution, may be used)\nCauchy formula for repeated integration (to calculate the -times antiderivative of a function) \n\nComputer algebra systems can be used to automate some or all of the work involved in the symbolic techniques above, which is particularly useful when the algebraic manipulations involved are very complex or lengthy. Integrals which have already been derived can be looked up in a table of integrals.\n\nOf non-continuous functions\nNon-continuous functions can have antiderivatives. While there are still open questions in this area, it is known that:\n Some highly pathological functions with large sets of discontinuities may nevertheless have antiderivatives.\n In some cases, the antiderivatives of such pathological functions may be found by Riemann integration, while in other cases these functions are not Riemann integrable.\n\nAssuming that the domains of the functions are open intervals:\n\n A necessary, but not sufficient, condition for a function  to have an antiderivative is that  have the intermediate value property. That is, if  is a subinterval of the domain of  and  is any real number between  and , then there exists a  between  and  such that . This is a consequence of Darboux's theorem.\n The set of discontinuities of  must be a meagre set. This set must also be an F-sigma set (since the set of discontinuities of any function must be of this type). Moreover, for any meagre F-sigma set, one can construct some function  having an antiderivative, which has the given set as its set of discontinuities.\n If  has an antiderivative, is bounded on closed finite subintervals of the domain and has a set of discontinuities of Lebesgue measure 0, then an antiderivative may be found by integration in the sense of Lebesgue. In fact, using more powerful integrals like the Henstock–Kurzweil integral, every function for which an antiderivative exists is integrable, and its general integral coincides with its antiderivative.\n If  has an antiderivative  on a closed interval , then for any choice of partition  if one chooses sample points  as specified by the mean value theorem, then the corresponding Riemann sum telescopes to the value .  However if  is unbounded, or if  is bounded but the set of discontinuities of  has positive Lebesgue measure, a different choice of sample points  may give a significantly different value for the Riemann sum, no matter how fine the partition. See Example 4 below.\n\nSome examples\n\nBasic formulae \n\n If , then .\n\nSee also\n Antiderivative (complex analysis)\n Formal antiderivative\n Jackson integral\n Lists of integrals\n Symbolic integration\n Area\n\nNotes\n\nReferences\n\nFurther reading\n Introduction to Classical Real Analysis, by Karl R. Stromberg; Wadsworth, 1981 (see also)\n Historical Essay On Continuity Of Derivatives by Dave L. Renfro\n\nExternal links\n Wolfram Integrator — Free online symbolic integration with Mathematica\n Function Calculator from WIMS\n Integral at HyperPhysics\n Antiderivatives and indefinite integrals at the Khan Academy\n Integral calculator at Symbolab\n The Antiderivative at MIT\n Introduction to Integrals at SparkNotes\n Antiderivatives at Harvy Mudd College\n\nIntegral calculus\nLinear operators in calculus"
}