{
  "title": "Arcadia 2001",
  "content": "The Arcadia 2001 is a second-generation 8-bit home video game console released by Emerson Radio in May 1982 for a price of US$ 99, several months before the release of ColecoVision. It was discontinued only 18 months later, with a total of 35 games having been released. Emerson licensed the Arcadia 2001 to Bandai, which released it in Japan. Over 30 Arcadia 2001 clones exist.\n\nThe unrelated Arcadia Corporation, manufacturer of the Atari 2600 Supercharger add-on, was sued by Emerson for trademark infringement. Arcadia Corporation then changed its name to Starpath.\n\nDescription\nThe Arcadia is much smaller than its contemporary competitors and is powered by a standard 12 volt power supply so it can be used in a boat or a vehicle. It has two headphone jacks on the far left and right sides of the back.\n\nThe system came with two Intellivision-style controllers with a 12-button keypad and \"fire\" buttons on the sides. The direction pads have a removable joystick attachment. Most games came with BoPET overlays that can be applied to the controller's keypads. The console itself has five buttons: Power, Start, Reset, Option, and Select.\n\nThere are at least three different cartridge case styles and artwork, with variations on each. Emerson-family cartridges come in two different lengths (short and long) of black plastic cases.\n\nTechnical specifications\n\nMain Processor: Signetics 2650 CPU (some variants run a Signetics 2650A)\nRAM: 1 KB\nROM: None\nVideo display: 128 × 208 / 128 × 104, 8 Colours\nVideo display controller: Signetics 2637 UVI @ 3.58 MHz (NTSC), 3.55 MHz (PAL)\nSound: Single Channel \"Beeper\" + Single Channel \"Noise\"\nHardware Sprites: 4 independent, single color\nControllers: 2 × 2 way\nKeypads: 2 × 12 button (more buttons on some variants)\n\nConsole variants and clones\nMany variants and clones of the Arcadia 2001 have been released by various companies in different countries. These systems are mostly compatible with each other. In 1982, the Bandai Arcadia was released only in Japan. Four exclusive games were released for the system.\n\nBandai Arcadia\n\nIn 1982, the Bandai Arcadia, a variant of the Emerson Arcadia 2001, was licensed and distributed to Japan by Bandai for a price of 19,800 yen. There were four Japan-exclusive games released by Bandai.\n\nDoraemon\nDr. Slump\nMobile Suit Gundam\nSuper Dimension Fortress Macross\n\nReception\n\nAfter seeing the Arcadia 2001 at the summer 1982 Consumer Electronics Show, Danny Goodman of Creative Computing Video & Arcade Games reported that its graphics were similar to the Atari 2600's, and that \"our overall impression of the game play was favorable for a system in this price range, though no cartridge stands out as being an exciting original creation\". He called the controller offering both Intellivision-like disc and joystick functionality \"A great idea\".\n\nGames\nEmerson planned to launch the console with 19 games. Some Arcadia 2001 games are ports of lesser-known arcade games such as Route 16, Jungler, and Jump Bug, which were not available on other home systems.\n\nEmerson actually created many popular arcade titles including Pac-Man, Galaxian and Defender for the Arcadia, but never had them manufactured as Atari started to sue its competitor companies for releasing games to which it had exclusive-rights agreements. Early marketing showed popular arcade games, but they were later released as clones. For instance, the Arcadia 2001 game Space Raiders is a clone of Defender, and Breakaway is a clone of Breakout.\n\nReleased games \nThere are 47 games known to have been released for the Arcadia 2001 and its clones.\n\nBandai Arcadia Only\nSee here\n\nUnreleased games\n\nReferences\n\nExternal links\n\n Video Game Console Library entry on the Arcadia 2001\n TheGameConsole.com entry on the Arcadia 2001\n The Dot Eaters entry on the Arcadia 2001\n www.old-computers.com Emerson Arcadia 2001 museum entry\n www.old-computers.com Article about Arcadia 2001 and clones\n Arcadia 2001 retrospective at IGN\n\nHome video game consoles\nSecond-generation video game consoles\nBandai consoles\nProducts introduced in 1982\nProducts and services discontinued in 1984\n1980s toys\nDiscontinued video game consoles"
}