{
  "title": "ArgoUML",
  "content": "ArgoUML is an UML diagramming application written in Java and released under the open source Eclipse Public License.  By virtue of being a Java application, it is available on any platform supported by Java SE.\n\nHistory\nArgoUML was originally developed at UC Irvine by Jason E. Robbins, leading to his Ph.D. It was an open source project hosted by Tigris.org and moved in 2019 to GitHub. The ArgoUML project included more than 19,000 registered users and over 150 developers.\n\nIn 2003, ArgoUML won the Software Development Magazine's annual Readers' Choice Award in the “Design and Analysis Tools” category.\n\nArgoUML development has suffered from lack of manpower. For example, Undo has been a perpetually requested feature since 2003 but has not been implemented yet.\n\nFeatures\nAccording to the official feature list, ArgoUML is capable of the following: \nAll 9 UML 1.4 diagrams are supported.\nClosely follows the UML standard.\nPlatform independent – Java 1.5+ and C++.\nClick and Go! with Java Web Start (no setup required, starts from your web browser).\nStandard UML 1.4 Metamodel.\nXMI support.\nExport diagrams as GIF, PNG, PS, EPS, PGML and SVG.\nAvailable in ten languages: EN, EN-GB, DE, ES, IT, RU, FR, NB, PT, ZH.\nAdvanced diagram editing and zoom.\nBuilt-in design critics provide unobtrusive review of design and suggestions for improvements.\nExtensible modules interface.\nOCL support.\nForward engineering (code generation supports C++ and C#, Java, PHP 4, PHP 5, Ruby and, with less mature modules, Ada, Delphi and SQL).\nReverse engineering / JAR/class file import.\n\nWeaknesses\nArgoUML does not yet completely implement the UML standard.\n Partial undo feature (working for graphics edits )\n Java Web Start launching may no longer work reliably. See Java Web Start.\n\nSee also\nList of UML tools\nMetaCASE tool\n\nReferences\n\nExternal links\n\nJava platform software\nFree UML tools\n1999 software\nSoftware using the Eclipse license"
}