{
  "title": "ATM",
  "content": "ATM or atm often refers to:\n\n Atmosphere (unit) or atm, a unit of atmospheric pressure\n Automated teller machine, a cash dispenser or cash machine\n\nATM or atm may also refer to:\n\nComputing \n ATM (computer), a ZX Spectrum clone developed in Moscow in 1991\n Adobe Type Manager, a computer program for managing fonts\n Accelerated Turing machine, or Zeno machine, a model of computation used in theoretical computer science\n Alternating Turing machine, a model of computation used in theoretical computer science\n Asynchronous Transfer Mode, a telecommunications protocol used in networking\n ATM adaptation layer\n ATM Adaptation Layer 5\n\nMedia \n Amateur Telescope Making, a series of books by Albert Graham Ingalls\n ATM (2012 film), an American film\n ATM: Er Rak Error, a 2012 Thai film\n Azhagiya Tamil Magan, a 2007 Indian film\n \"ATM\" (song), a 2018 song by J. Cole from KOD\n\nPeople and organizations \n Abiding Truth Ministries, anti-LGBT organization in Springfield, Massachusetts, US\n Association of Teachers of Mathematics, UK \n Acrylic Tank Manufacturing, US aquarium manufacturer, televised in Tanked\n ATM FA, a football club in Malaysia\n A. T. M. Wilson (1906–1978), British psychiatrist\nAfrican Transformation Movement, South African political party founded in 2018\nThe a2 Milk Company (NZX ticker symbol ATM)\n\nScience \n Apollo Telescope Mount, a solar observatory\n ATM serine/threonine kinase, a serine/threonine kinase activated by DNA damage\n The Airborne Topographic Mapper, a laser altimeter among the instruments used by NASA's Operation IceBridge\n\nTransportation \n Active traffic management, a motorway scheme on the M42 in England\n Air traffic management, a concept in aviation\n Altamira Airport, in Brazil (IATA code ATM)\n Azienda Trasporti Milanesi, the municipal public transport company of Milan\n Airlines of Tasmania (ICAO code ATM)\n\nCatalonia, Spain \n Autoritat del Transport Metropolità (ATM Àrea de Barcelona), in the Barcelona metropolitan area\n Autoritat Territorial de la Mobilitat del Camp de Tarragona (ATM Camp de Tarragona), in the Camp de Tarragona area\n Autoritat Territorial de la Mobilitat de l'Àrea de Girona (ATM Àrea de Girona), in the Girona area\n Autoritat Territorial de la Mobilitat de l'Àrea de Lleida (ATM Àrea de Lleida), in the Lleida area\n\nOther uses \n Actun Tunichil Muknal, a cave in Belize\n Anti-tank missile, a missile designed to destroy tanks\n Ass to mouth, a sexual act\n At the money, moneyness where the strike price is the same as the current spot price\n At-the-market offering, a type of follow-on offering of stock\n Automatenmarken, a variable value stamp\nContracted form of Atlético Madrid, football club in Spain\nCommon abbreviation in SMS language for \"at the moment\""
}