{
  "title": "BeBox",
  "content": "The BeBox is a dual CPU personal computer, briefly sold by Be Inc. to run the company's own operating system, BeOS. It has PowerPC CPUs, its I/O board has a custom \"GeekPort\", and the front bezel has \"Blinkenlights\".\n\nThe BeBox made its debut in October 1995 in a dual PowerPC 603 at 66 MHz configuration. The processors were upgraded to 133 MHz in August 1996 (BeBox Dual603e-133). Production was halted in January 1997, following the port of BeOS to the Macintosh, in order for the company to concentrate on software. Be sold around 1000 66 MHz BeBoxes and 800 133 MHz BeBoxes.\n\nBeBox creator Jean-Louis Gassée did not see the BeBox as a general consumer device, warning that \"Before we let you use the BeBox, we believe you must have some aptitude toward programming the standard language is C++.\"\n\nCPU configuration \nInitial prototypes are equipped with two AT&T Hobbit processors and three AT&T 9308S DSPs.\n\nProduction models use two 66 MHz PowerPC 603 processors or two 133 MHz PowerPC 603e processors to power the BeBox. Prototypes having dual 200 MHz CPUs or four CPUs exist, but were never publicly available.\n\nMain board \nThe main board is in a standard AT format commonly found on PC. It used standard PC components to make it as inexpensive as possible.\n\n Two PowerPC 603/66 MHz or 603e/133 MHz processors\n Eight 72-pin SIMM sockets\n 128 KB Flash ROM\n Three PCI slots\n Five ISA slots\n Internal SCSI connector\n Internal IDE connector\n Internal floppy connector\n External SCSI-2 connector\n Parallel port\n Keyboard port, AT-style\n Three GeekPort fuses\n I/O Board connector\n Front panel connector\n Power connector\n\nI/O board \n\nThe I/O board offers four serial ports (9-pin D-sub), a PS/2 mouse port, and two joystick ports (15-pin D-sub). \n\nThere are four DIN MIDI ports (two in, two out), two stereo pairs of RCA connectors audio line-level input and output, and a pair of 3.5 mm stereo phono jacks for microphone input and headphone output. There are also internal audio connectors: 5-pin strip for the audio CD line-level playback, and two 4-pin strips for microphone input and headphone output. The audio is produced with a 16-bit DAC stereo sound system capable of 48 kHz and 44.1 kHz.\n\nFor the more unusual uses, there are three 4-pin mini-DIN infrared (IR) I/O ports.\n\nGeekPort\nAn experimental-electronic-development oriented port, backed by three fuses on the mainboard, the 37-pin D-sub \"GeekPort\" provides digital and analog I/O and DC power on the ISA bus:\n Two independent, bidirectional 8-bit ports\n Four A/D pins routing to a 12-bit A/D converter\n Four D/A pins connected to an independent 8-bit D/A converter\n Two signal ground reference pins\n Eleven power and ground pins: Two at +5 V, one at +12 V, one at -12 V, seven ground pins\n\n\"Blinkenlights\" \nTwo yellow/green vertical LED arrays, dubbed the \"blinkenlights\", are built into the front bezel to illustrate the CPU load. The bottommost LED on the right side indicates hard disk activity.\n\nSee also \n Multi Emulator Super System (MESS) able to emulate both BeBox 66  and 133\n\nReferences\n\nExternal links \n   An interview with Be Inc. CEO Jean-Louis Gassée and VP of Engineering Erich Ringewald.\n \n \n BeBox Photo Gallery (Joseph Palmer: Be HW Engineer)\n  (BeBox)\n\nBe Inc.\nComputer-related introductions in 1995\nComputer workstations\nPersonal computers\nPowerPC computers"
}