{
  "title": "Bugzilla",
  "content": "Bugzilla is a web-based general-purpose bug tracking system and testing tool originally developed and used by the Mozilla project, and licensed under the Mozilla Public License.\n\nReleased as open-source software by Netscape Communications in 1998, it has been adopted by a variety of organizations for use as a bug tracking system for both free and open-source software and proprietary projects and products. Bugzilla is used, among others, by the Mozilla Foundation, WebKit, Linux kernel, FreeBSD, KDE, Apache, Eclipse and LibreOffice. Red Hat uses it, but is gradually migrating its product to use Jira. It is also self-hosting.\n\nHistory \n\nBugzilla was originally devised by Terry Weissman in 1998 for the nascent Mozilla.org project, as an open source application to replace the in-house system then in use at Netscape Communications for tracking defects in the Netscape Communicator suite. Bugzilla was originally written in Tcl, but Weissman decided to port it to Perl before its release as part of Netscape's early open-source code drops, in the hope that more people would be able to contribute to it, given that Perl seemed to be a more popular language at the time.\n\nBugzilla 2.0 was the result of that port to Perl, and the first version was released to the public via anonymous CVS. In April 2000, Weissman handed over control of the Bugzilla project to Tara Hernandez. Under her leadership, some of the regular contributors were coerced into taking more responsibility, and Bugzilla development became more community-driven. In July 2001, facing distraction from her other responsibilities in Netscape, Hernandez handed control to Dave Miller, who was still in charge .\n\nBugzilla 3.0 was released on May 10, 2007 and brought a refreshed UI, an XML-RPC interface, custom fields and resolutions, mod_perl support, shared saved searches, and improved UTF-8 support, along with other changes.\n\nBugzilla 4.0 was released on February 15, 2011 and Bugzilla 5.0 was released in July 2015.\n\nTimeline \n\nBugzilla's release timeline:\n\nRequirements \n\nBugzilla's system requirements include:\n\n A compatible database management system\n A suitable release of Perl 5\n An assortment of Perl modules\n A compatible web server\n A suitable mail transfer agent, or any SMTP server\n\nCurrently supported database systems are MySQL, PostgreSQL, Oracle, and SQLite. Bugzilla is usually installed on Linux using the Apache HTTP Server, but any web server that supports CGI such as Lighttpd, Hiawatha, Cherokee can be used. Bugzilla's installation process is command line driven and runs through a series of stages where system requirements and software capabilities are checked.\n\nDesign \n\nWhile the potential exists in the code to turn Bugzilla into a technical support ticket system, task management tool, or project management tool, Bugzilla's developers have chosen to focus on the task of designing a system to track software defects.\n\nZarro Boogs \n\nBugzilla returns the string \"zarro boogs found\" instead of \"0 bugs found\" when a search for bugs returns no results. \"Zarro Boogs\" is intended as a 'buggy' statement itself (a misspelling of \"zero bugs\") and is thus a meta-statement about the nature of software debugging, implying that even when no bugs have been identified, some may exist.\n\nThe following comment is provided in the Bugzilla source code to developers who may be confused by this behaviour:\n\nZarro Boogs Found\nThis is just a goofy way of saying that there were no bugs found matching your query. When asked to explain this message, Terry Weissman (an early Bugzilla developer) had the following to say:\n\nI've been asked to explain this ... way back when, when Netscape released version 4.0 of its browser, we had a release party. Naturally, there had been a big push to try and fix every known bug before the release. Naturally, that hadn't actually happened. (This is not unique to Netscape or to 4.0; the same thing has happened with every software project I've ever seen.) Anyway, at the release party, T-shirts were handed out that said something like \"Netscape 4.0: Zarro Boogs\". Just like the software, the T-shirt had no known bugs. Uh-huh. So, when you query for a list of bugs, and it gets no results, you can think of this as a friendly reminder. Of *course* there are bugs matching your query, they just aren't in the bugsystem yet...\n— Terry Weissman\nFrom The Bugzilla Guide – 2.16.10 Release: Glossary\n\nWONTFIX\n\nWONTFIX is used as a label on issues in Bugzilla and other systems. It indicates that a verified issue will not be addressed for one of several possible reasons including fixing would be too expensive, complicated or risky.\n\nSee also \n\n Comparison of issue-tracking systems\n List of computing mascots\n :Category:Computing mascots\n\nReferences\n\nExternal links \n\nArticles which contain graphical timelines\nBug and issue tracking software\nCross-platform free software\nFree project management software\nFree software programmed in Perl\nMozilla\nSoftware using the Mozilla license"
}