{
  "title": "Car (disambiguation)",
  "content": "A car is a wheeled motor vehicle used for transporting passengers.\n\nCar(s), CAR(s), or The Car(s) may also refer to:\n\nComputing\n C.a.R. (Z.u.L.), geometry software\n CAR and CDR, commands in LISP computer programming\n Clock with Adaptive Replacement, a page replacement algorithm\n Computer-assisted reporting\n Computer-assisted reviewing\n\nEconomics\n Capital adequacy ratio, a ratio of a bank's capital to its risk\n Cost accrual ratio, an accounting formula\n Cumulative abnormal return\n Cumulative average return, a financial concept related to the time value of money\n\nFilm and television\n Cars (franchise), a Disney/Pixar film series\n Cars (film), a 2006 computer-animated film from Disney and Pixar\n The Car (1977 film), an American horror film\n Car, a BBC Two television ident first aired in 1993 (see BBC Two '1991–2001' idents)\n The Car (1997 film), a Malayalam film\n \"The Car\" (The Assistants episode)\n\nLiterature\n Car (magazine), a British auto-enthusiast publication\n The Car (novel), a novel by Gary Paulsen\n\nMilitary\n Canadian Airborne Regiment, a Canadian Forces formation\n Colt Automatic Rifle, a 5.56mm NATO firearm\n Combat Action Ribbon, a United States military decoration\n U.S. Army Combat Arms Regimental System, a 1950s reorganisation of the regiments of the US Army\n Conflict Armament Research, a UK-based investigative organization that tracks the supply of armaments into conflict-affected areas\n\nMusic\n The Cars, an American band\n\nAlbums\n Peter Gabriel (1977 album) or Car\n The Cars (album), a 1978 album by The Cars\n Cars (soundtrack), the soundtrack to the 2006 film\n Cars (Now, Now Every Children album), 2009\n Cars, a 2011 album by Kris Delmhorst\n C.A.R. (album), a 2012 album by Serengeti\n The Car (album), a 2022 album by Arctic Monkeys\n\nSongs\n \"The Car\" (song), a song by Jeff Carson\n \"Cars\" (song), a 1979 single by Gary Numan\n \"Car\", a 1994 song by Built to Spill from There's Nothing Wrong with Love\n\nPaintings\n Cars (painting), a series of paintings by Andy Warhol\n The Car (Brack), a 1955 painting by John Brack\n\nPeople\n Car (surname)\n Cars (surname)\n\nPlaces\n Car, Azerbaijan, a village\n Čar, a village in Serbia\n Cars, Gironde, France, a commune\n Les Cars, Haute-Vienne, France, a commune\n Central African Republic\n Central Asian Republics\n Cordillera Administrative Region, Philippines\n County Carlow, Ireland, Chapman code\n\nScience\n Canonical anticommutation relation\n Carina (constellation)\n Chimeric antigen receptor, artificial T cell receptors\n Coherent anti-Stokes Raman spectroscopy\n Constitutive androstane receptor\n Cortisol awakening response, on waking from sleep\n Coxsackievirus and adenovirus receptor, a protein\n\nSports\n Carolina Hurricanes, a National Hockey League team\n Carolina Panthers, a National Football League team\n Club Always Ready, a Bolivian football club from La Paz\n Rugby Africa, formerly known as Confederation of African Rugby\n\nTransportation\n Railroad car\n Canada Atlantic Railway, 1879–1914\n Canadian Atlantic Railway, 1986–1994\n Carlisle railway station's station code\n Car, the cab of an elevator\n Car, a tram, streetcar, or trolley car\n\nOther uses\n\nCar\n Car (Greek myth), one or two figures in Greek mythology\n Car language, an Austroasiatic language of the Nicobar Islands in the eastern Indian Ocean\n car, ISO 639-2 and ISO 639-3 codes of the Carib language, spoken by the Kalina people of South America\n Cars (video game), a 2006 video game based on the film\n Chimeric antigen receptor, a type of protein engineered to give T cells the ability to target a specific protein\n\nCAR\n Canadian Aviation Regulations\n Avis Budget Group (Nasdaq: CAR)\n Central apparatus room, an equipment room found at broadcasting facilities\n Children of the American Revolution, a genealogical society\n  or Action Committee for Renewal, a political party of Togo\n Council for Aboriginal Reconciliation, body founded by the Australian Government in 1991 as part of its Reconciliation in Australia policy\n Council for Aboriginal Rights (1951–1980s), Victoria, Australia\n Criminal Appeal Reports, law reports in the United Kingdom\n\nSee also\n\n Carr (disambiguation)\n CARS (disambiguation)\n Le Car (disambiguation)\n iCar"
}