{
  "title": "Country code",
  "content": "A country code is a short alphanumeric identification code for countries and dependent areas. Its primary use is in data processing and communications. Several identification systems have been developed.\n\nThe term country code frequently refers to ISO 3166-1 alpha-2, as well as the telephone country code, which is embodied in the E.164 recommendation by the International Telecommunication Union (ITU).\n\nISO 3166-1\nThe standard ISO 3166-1 defines short identification codes for most countries and dependent areas:\nISO 3166-1 alpha-2: two-letter code\nISO 3166-1 alpha-3: three-letter code\nISO 3166-1 numeric: three-digit code\n\nThe two-letter codes are used as the basis for other codes and applications, for example,\nfor ISO 4217 currency codes\nwith deviations, for country code top-level domain names (ccTLDs) on the Internet: list of Internet TLDs.\nOther applications are defined in ISO 3166-1 alpha-2.\n\nITU country codes\nIn telecommunication, a country code, or international subscriber dialing (ISD) code, is a telephone number prefix used in international direct dialing (IDD) and for destination routing of telephone calls to a country other than the caller's. A country or region with an autonomous telephone administration must apply for membership in the International Telecommunication Union (ITU) to participate in the international public switched telephone network (PSTN). County codes are defined by the ITU-T section of the ITU in standards E.123 and E.164.\n\nCountry codes constitute the international telephone numbering plan, and are dialed only when calling a telephone number in another country. They are dialed before the national telephone number. International calls require at least one additional prefix to be dialing before the country code, to connect the call to international circuits, the international call prefix. When printing telephone numbers this is indicated by a plus-sign (+) in front of a complete international telephone number, per recommendation E164 by the ITU.\n\nOther country codes\nEuropean Union:\nBefore the 2004 EU enlargement the EU used the UN Road Traffic Conventions license plate codes. Since then, it has used the ISO 3166-1 alpha-2 code, but with two modifications:\nEL for Greece (instead of GR)\n(formerly) UK for United Kingdom (instead of GB)\nThe Nomenclature des unités territoriales statistiques (Nomenclature of territorial units for statistics, NUTS) of the European Union, mostly focusing on subdivisions of the EU member states\nFIFA (Fédération Internationale de Football Association) assigns a three-letter code (dubbed FIFA Trigramme) to each of its member and non-member countries: List of FIFA country codes\nFederal Information Processing Standard (FIPS) 10-4 defined two-letter codes used by the U.S. government and in the CIA World Factbook: list of FIPS country codes. On September 2, 2008, FIPS 10-4 was one of ten standards withdrawn by NIST as a Federal Information Processing Standard.\n The Bureau of Transportation Statistics, part of the United States Department of Transportation (US DOT), maintains its own list of codes, so-called World Area Codes (WAC), for state and country codes.\n GOST 7.67: country codes in Cyrillic from the GOST standards committee\nFrom the International Civil Aviation Organization (ICAO):\nThe national prefixes used in aircraft registration numbers\nLocation prefixes in four-character ICAO airport codes\nInternational Olympic Committee (IOC) three-letter codes used in sporting events: list of IOC country codes\nFrom the International Telecommunication Union (ITU):\nthe E.212 mobile country codes (MCC), for mobile/wireless phone addresses,\nthe first few characters of call signs of radio stations (maritime, aeronautical, amateur radio, broadcasting, and so on) define the country: the ITU prefix,\nITU letter codes for member-countries,\nITU prefix - amateur and experimental stations - The International Telecommunication Union (ITU) assigns national telecommunication prefixes for amateur and experimental radio use, so that operators can be identified by their country of origin. These prefixes are legally administered by the national entity to which prefix ranges are assigned.\nThree-digit codes used to identify countries in maritime mobile radio transmissions, known as maritime identification digits\nLicense plates for automobiles:\nUnder the 1949 and 1968 United Nations Road Traffic Conventions (distinguishing signs of vehicles in international traffic): List of international license plate codes.\nDiplomatic license plates in the United States, assigned by the U.S. State Department.\nNorth Atlantic Treaty Organization (NATO) used two-letter codes of its own: list of NATO country codes. They were largely borrowed from the FIPS 10-4 codes mentioned below. In 2003 the eighth edition of the Standardisation Agreement (STANAG) adopted the ISO 3166 three-letter codes with one exception (the code for Macedonia). With the ninth edition, NATO is transitioning to four- and six-letter codes based on ISO 3166 with a few exceptions and additions\nUnited Nations Development Programme (UNDP) also has its own list of trigram country codes\n World Intellectual Property Organization (WIPO): WIPO ST.3 gives two-letter codes to countries and regional intellectual property organizations\nWorld Meteorological Organization (WMO) maintains a list of country codes, used in reporting meteorological observations\n UIC (the International Union of Railways): UIC Country Codes\n\nThe developers of ISO 3166 intended that in time it would replace other coding systems.\n\nOther codings\nCountry identities may be encoded in the following coding systems:\nThe initial digits of International Standard Book Numbers (ISBN) are group identifiers for countries, areas, or language regions.\nThe first three digits of GS1 Company Prefixes used to identify products, for example, in barcodes, designate (national) numbering agencies.\n\nLists of country codes by country\nA -\nB -\nC -\nD–E -\nF -\nG -\nH–I -\nJ–K -\nL -\nM -\nN -\nO–Q -\nR -\nS -\nT -\nU–Z\n\nSee also\nList of ISO 3166 country codes\nISO 639 language codes\nLanguage code\nNumbering scheme\n\nReferences\n\nExternal links\nComparison of various systems\nAnother comparison: \nA comparison with ISO, IFS and others with notes\nUnited Nations Region Codes\n\n \nGeocodes"
}