{
  "title": "Telecommunications in Canada",
  "content": "Present-day telecommunications in Canada include telephone, radio, television, and internet usage. In the past, telecommunications included telegraphy available through Canadian Pacific and Canadian National.\n\nHistory \n\nThe history of telegraphy in Canada dates back to the Province of Canada.  While the first telegraph company was the Toronto, Hamilton and Niagara Electro-Magnetic Telegraph Company, founded in 1846, it was the Montreal Telegraph Company, controlled by Hugh Allan and founded a year later, that dominated in Canada during the technology's early years.\n\nFollowing the 1852 Telegraph Act, Canada's first permanent transatlantic telegraph link was a submarine cable built in 1866 between Ireland and Newfoundland. Telegrams were sent through networks built by Canadian Pacific and Canadian National.\n\nIn 1868 Montreal Telegraph began facing competition from the newly established Dominion Telegraph Company. 1880 saw the Great North Western Telegraph Company established to connect Ontario and Manitoba but within a year it was taken over by Western Union, leading briefly to that company's control of almost all telegraphy in Canada. In 1882, Canadian Pacific transmitted its first commercial telegram over telegraph lines they had erected alongside its tracks, breaking Western Union's monopoly. Great North Western Telegraph, facing bankruptcy, was taken over in 1915 by Canadian Northern.\n\nBy the end of World War II, Canadians communicated by telephone, more than any other country. In 1967 the CP and CN networks were merged to form CNCP Telecommunications.\n\nAs of 1951, approximately 7000 messages were sent daily from the United States to Canada.  An agreement with Western Union required that U.S. company to route messages in a specified ratio of 3:1, with three telegraphic messages transmitted to Canadian National for every message transmitted to Canadian Pacific. The agreement was complicated by the fact that some Canadian destinations were served by only one of the two networks.\n\nFixed-line telephony \n\nTelephones - fixed lines: total subscriptions: 13.926 million (2020)\n Subscriptions per 100 inhabitants: 36.9 (2020 est.)\n\nTelephones - mobile cellular:  36,093,021 (2020)\n Subscriptions per 100 inhabitants: 95.63 (2020 est.)\n\nTelephone system: (2019)\n Domestic: Nearly 37 per 100 fixed-line and 96 per 100 mobile-cellular teledensity; domestic satellite system with about 300 earth stations (2020)\n International: country code - +1; submarine cables provide links within the Americas and Europe; satellite earth stations - 7 (5 Intelsat - 4 trans-Atlantic Ocean and 1 trans-Pacific Ocean, and 2 Intersputnik - (Atlantic Ocean region)\n\nCall signs \n\nITU prefixes: Letter combinations available for use in Canada as the first two letters of a television or radio station's call sign are CF, CG, CH, CI, CJ, CK, CY, CZ, VA, VB, VC, VD, VE, VF, VG, VO, VX, VY, XJ, XK, XL, XM, XN and XO. Only CF, CH, CI, CJ and CK are currently in common use, although four radio stations in St. John's, Newfoundland and Labrador retained call letters beginning with VO when Newfoundland joined Canadian Confederation in 1949. Stations owned by the Canadian Broadcasting Corporation use CB through a special agreement with the government of Chile. Some codes beginning with VE and VF are also in use to identify radio repeater transmitters.\n\nRadio \n\nAs of 2016, there were over 1,100 radio stations and audio services broadcasting in Canada. Of these, 711 are private commercial radio stations. These commercial stations account for over three quarters of radio stations in Canada. The remainder of the radio stations are a mix of public broadcasters, such as CBC Radio, as well as campus, community, and Aboriginal stations.\n\nTelevision \n\nAs of 2018, 762 TV services were broadcasting in Canada. This includes both conventional television stations and discretionary services.\n\nCable and satellite television services are available throughout Canada. The largest cable providers are Bell Canada, Rogers Cable, Shaw Cable, Vidéotron, Telus and Cogeco, while the two licensed satellite providers are Bell Satellite TV and Shaw Direct.\n\nInternet \n\nBell, Rogers, Telus, and Shaw are among the bigger ISPs in Canada. Depending on your location, Bell and Rogers would be the big internet service providers in Eastern provinces, while Shaw and Telus are the main players competing in western provinces.\n\nInternet service providers: there are more than 44 ISPs in Canada, including Beanfield, Bell Canada, Cable Axion, Cablevision (Canada), Chebucto Community Net, Cogeco, Colbanet, Craig Wireless, Dery Telecom, Eastlink (company), Electronic Box, Everus Communications, Guest-tek, Information Gateway Services, Internet Access Solutions, Internex Online, Inukshuk Wireless, Jet2.net, Look Communications, Managed Network Systems, Inc., Mountain Cablevision, National Capital FreeNet, Novus Entertainment, Ontera, Persona Communications, Primus Canada, Project Chapleau, Qiniq, Rally Internet, Rogers Hi-Speed Internet, Rose Media, Rush Communications Ltd., SaskTel, Seaside Communications, Shaw Communications, Source Cable, SSI Micro, TAO (collective), TekSavvy, Telus, Telus Internet, Vidéotron, Vmedia, Web Community Resource Networks, Wireless Nomad, YourLink\t\n Internet Exchange Points: There are multiple Internet Exchange Points in Canada, the largest of which are in Calgary, Montreal, Toronto and Vancouver.  Most ISP's peer at one or more of these Exchanges, except for Bell Canada.  The Toronto Internet Exchange ranks as one of the largest internet exchanges in the world.\nCountry codes: .CA, CDN, 124\nInternet users: 33 million users \nInternet hosts: 8.7 million (2012-2017)\nPercentage of households with Internet access: 87(2016)\nTotal households with high speed connection: 67%  (2014)\nTotal users of home online banking: 68% (2016)\n\nMobile networks \n\nThe three major mobile network operators are Rogers Wireless (10.4 million subscribers), Bell Mobility (9.8 million) and Telus Mobility (9.5 million), which have a combined 86% of market share.\n\nAdministration and Government \nFederally, telecommunications are overseen by the Canadian Radio-television and Telecommunications Commission ()–CRTC as outlined under the provisions of both the Telecommunications Act and Radiocommunication Acts.  CRTC further works with Innovation, Science and Economic Development Canada (formerly Industry Canada) on various technical aspects including: allocating frequencies and call signs, managing the broadcast spectrum, and regulating other technical issues such as interference with electronics equipment. As Canada comprises a part of the North American Numbering Plan for area codes, the Canadian Numbering Administration Consortium within Canada is responsible for allocating and managing area codes in Canada.\n\nSee also \n\n Media in Canada\n List of newspapers in Canada\n List of mobile network operators of the Americas\n List of telephone operating companies\n List of area codes in Canada\n List of postcode areas in Canada\n Canadian Association of Broadcasters\n Canadian Broadcast Standards Council\n Canadian Broadcasting Corporation\n Canadian Communications Foundation\n\nReferences\n\nFurther reading \n\nBibliography\n\n Canada’s internet infrastructure Internet Exchange Points (IXPs), Canadian Internet Registration Authority (CIRA)\n Canadian Area Codes, Canadian Numbering Administration Consortium, Inc. (CNAC)\n Canada, SubmarineCableMap.com\n National Broadband Internet Service Availability Map, Innovation, Science and Economic Development Canada\n\nExternal links \nThe Canadian Communications Foundation – A History of Canadian Broadcasting\nFind Service Providers in Canada, CRTC (Mobile, Phone, Internet, or free/paid TV) by location\nCompare Internet & Phone Plans in Canada – Free Online Comparison Tool"
}