{
  "title": "Anatomical Therapeutic Chemical Classification System",
  "content": "The Anatomical Therapeutic Chemical (ATC) Classification System is a drug classification system that classifies the active ingredients of drugs according to the organ or system on which they act and their therapeutic, pharmacological and chemical properties. Its purpose is an aid to monitor drug use and for research to improve quality medication use. It does not imply drug recommendation or efficacy. It is controlled by the World Health Organization Collaborating Centre for Drug Statistics Methodology (WHOCC), and was first published in 1976.\n\nCoding system \nThis pharmaceutical coding system divides drugs into different groups according to the organ or system on which they act, their therapeutic intent or nature, and the drug's chemical characteristics. Different brands share the same code if they have the same active substance and indications. Each bottom-level ATC code stands for a pharmaceutically used substance, or a combination of substances, in a single indication (or use). This means that one drug can have more than one code, for example acetylsalicylic acid (aspirin) has  as a drug for local oral treatment,  as a platelet inhibitor, and  as an analgesic and antipyretic; as well as one code can represent more than one active ingredient, for example  is the combination of perindopril with amlodipine, two active ingredients that have their own codes ( and  respectively) when prescribed alone.\n\nThe ATC classification system is a strict hierarchy, meaning that each code necessarily has one and only one parent code, except for the 14 codes at the topmost level which have no parents. The codes are semantic identifiers, meaning they depict information by themselves beyond serving as identifiers (namely, the codes depict themselves the complete lineage of parenthood). As of 7 May 2020, there are 6,331 codes in ATC; the table below gives the count per level.\n\nHistory \nThe ATC system is based on the earlier Anatomical Classification System, which is intended as a tool for the pharmaceutical industry to classify pharmaceutical products (as opposed to their active ingredients). This system, confusingly also called ATC, was initiated in 1971 by the European Pharmaceutical Market Research Association (EphMRA) and is being maintained by the EphMRA and Intellus. Its codes are organised into four levels. The WHO's system, having five levels, is an extension and modification of the EphMRA's. It was first published in 1976.\n\nClassification \nIn this system, drugs are classified into groups at five different levels:\n\nFirst level \nThe first level of the code indicates the anatomical main group and consists of one letter. There are 14 main groups:\n\nExample: C Cardiovascular system\n\nSecond level \nThe second level of the code indicates the therapeutic subgroup and consists of two digits.\n\nExample: C03 Diuretics\n\nThird level \nThe third level of the code indicates the therapeutic/pharmacological subgroup and consists of one letter.\n\nExample: C03C High-ceiling diuretics\n\nFourth level \nThe fourth level of the code indicates the chemical/therapeutic/pharmacological subgroup and consists of one letter.\n\nExample: C03CA Sulfonamides\n\nFifth level \nThe fifth level of the code indicates the chemical substance and consists of two digits.\n\nExample: C03CA01 furosemide\n\nOther ATC classification systems\n\nATCvet \nThe Anatomical Therapeutic Chemical Classification System for veterinary medicinal products (ATCvet) is used to classify veterinary drugs. ATCvet codes can be created by placing the letter Q in front of the ATC code of most human medications. For example, furosemide for veterinary use has the code QC03CA01.\n\nSome codes are used exclusively for veterinary drugs, such as QI Immunologicals, QJ51 Antibacterials for intramammary use or QN05AX90 amperozide.\n\nHerbal ATC (HATC) \nThe Herbal ATC system (HATC) is an ATC classification of herbal substances;  it differs from the regular ATC system by using 4 digits instead of 2 at the 5th level group.\n\nThe herbal classification is not adopted by WHO. The Uppsala Monitoring Centre is responsible for the Herbal ATC classification, and it is part of the WHODrug Global portfolio available by subscription.\n\nDefined daily dose \n\nThe ATC system also includes defined daily doses (DDDs) for many drugs. This is a measurement of drug consumption based on the usual daily dose for a given drug. According to the definition, \"[t]he DDD is the assumed average maintenance dose per day for a drug used for its main indication in adults.\"\n\nAdaptations and updates\nNational issues of the ATC classification, such as the German Anatomisch-therapeutisch-chemische Klassifikation mit Tagesdosen, may include additional codes and DDDs not present in the WHO version.\n\nATC follows guidelines in creating new codes for newly approved drugs. An application is submitted to WHO for ATC classification and DDD assignment. A preliminary or temporary code is assigned and published on the website and in the WHO Drug Information for comment or objection.  New ATC/DDD codes are discussed at the semi-annual Working Group meeting. If accepted it becomes a final decision and published semi-annually on the website and WHO Drug Information and implemented in the annual print/on-line ACT/DDD Index on January 1.   \n\nChanges to existing ATC/DDD follow a similar process to become temporary codes and if accepted become a final decision as ATC/DDD alterations.  ATC and DDD alterations are only valid and implemented in the coming annual updates; the original codes must continue until the end of the year.\n\nAn updated version of the complete on-line/print ATC index with DDDs is published annually on January 1.\n\nSee also \n Classification of Pharmaco-Therapeutic Referrals (CPR)\n ICD-10 International Classification of Diseases\n International Classification of Primary Care (ICPC-2) / ICPC-2 PLUS\n Medical classification\n Pharmaceutical care\n Pharmacotherapy\n RxNorm\n\nReferences\n\nExternal links \n \n  Quarterly journal providing an overview of topics relating to medicines development and regulation.\n  from \n EphMRA Anatomical Classification (ATC and NFC)\n atcd. R script to scrape the ATC data from the WHOCC website; contains link to download entire ATC tree.\n\n \n \nDrugs\nPharmacological classification systems\nWorld Health Organization"
}