{
  "title": "Angela Vincent",
  "content": "Angela Vincent  (born 1942) is Emeritus professor at the University of Oxford and a Fellow of Somerville College, Oxford.\n\nCareer and research\nAngela Vincent was born in 1942, the third child of Carmen and Joseph Molony (later KCVO). After St Mary's Convent, Ascot, she studied medicine at King's College London and Westminster Hospital School of Medicine (now merged with Imperial College School of Medicine). After one year as a junior doctor at St Steven's and St Charles' hospitals in London (1966–1967), she obtained an MSc in biochemistry from University College London.  In 1967 she married Philip Morse Vincent and they have four children. \n\nAfter the MSc, she spent three frustrating years trying to fractionate rat brain synaptosomes, until she was taken on by Ricardo Miledi FRS in the biophysics department to work on acetylcholine receptors.  During her five years with Miledi, her medical background helped to establish a collaboration on myasthenia gravis with John Newsom-Davis (later FRS); together at the Royal Free Hospital, London, they created a neuroimmunology group that subsequently moved with Newsom-Davis to Oxford when he was appointed action research professor of neurology. After his retirement in 1998, Vincent led the group until 2016. During this time she was head of the department of clinical neurology (2005–2008) at the University of Oxford, president of the International Society of Neuroimmunology (2001–2004), and an associate editor of Brain (2004–2013). Her research group was initially located in the Weatherall Institute of Molecular Medicine at the John Radcliffe Hospital, working on a wide range of biological disciplines encompassing molecular biology, biochemistry, cellular immunology and intracellular neurophysiology. The group's research focused on autoimmune and genetic disorders of the neuromuscular junction, peripheral nerves and more recently the exciting field of central nervous system diseases. The principal autoimmune diseases studied were myasthenia gravis, the Lambert–Eaton myasthenic syndrome, limbic encephalitis, other types of autoimmune encephalitis and acquired neuromyotonia. \n\nHer contributions have been on the roles of antibodies directed against acetylcholine receptors and muscle specific kinase (MuSK) in myasthenia gravis, and glycine receptors or potassium channel-associated proteins LGI1, CASPR2 and Contactin-2 in CNS diseases.\n\nShe demonstrated that transfer of antibodies across the placenta from the pregnant woman to the fetus in utero can cause both acute and longer-term neuromuscular and neurodevelopmental abnormalities.\n\nSince 2016 she has been Emeritus Professor at Oxford University, Emeritus Fellow of Somerville College, and holds an honorary appointment at UCL; she continues to work on neuromuscular disorders and advise young researchers.  Her work in Oxford on brain disorders continues under Associate Professor Sarosh Irani and Dr Patrick Waters.\n\nShe is a strong supporter of Freedom from Torture (formerly The Medical Foundation for Treatment of Torture Victims) and a Patron of British Pugwash (that brings together scientists and others concerned with international affairs and disarmament).\n\nAwards and honours\nIn 2009, she presented the Leslie Oliver Oration at Queen's Hospital. In 2009, she received the medal of the Association of British Neurologists and in 2017, the World Federation of Neurology Scientific Contributions to Neurology award.  In 2015, she was awarded the British Neuroscience Association Award for Outstanding Contribution to Neuroscience. In Cologne 2018, she was awarded with J Posner and J Dalmau, the International Prize for Translational Neuroscience of the Gertrud Reemtsma Foundation (formerly the Klaus Joachim Zülch Prize), and in Washington in 2019, the America Epilepsy Society Clinical Science Research Award (with J Dalmau).Retrieved June 26, 2021, from https://www.ndcn.ox.ac.uk/team/angela-vincent</ref> She received the Inaugural Distinguished Alumni Award, Imperial College, London, 2020 and the Life-time Award of the German Neurological Society (DGN)in 2021.\nIn 2002, she was elected a Fellow of the Academy of Medical Sciences (FMedSci) and in 2011, a Fellow of the Royal Society (FRS).\n\nReferences\n\n1942 births\n20th-century British biologists\n20th-century British women scientists\n21st-century British biologists\n21st-century British women scientists\nBritish women biologists\nBritish women neuroscientists\nEnglish neuroscientists\nFellows of Somerville College, Oxford\nFellows of the Royal Society\nFemale Fellows of the Royal Society\nLiving people"
}