{
  "title": "Bacillus",
  "content": "Bacillus (Latin \"stick\") is a genus of Gram-positive, rod-shaped bacteria, a member of the phylum Bacillota, with 266 named species. The term is also used to describe the shape (rod) of other so-shaped bacteria; and the plural Bacilli is the name of the class of bacteria to which this genus belongs. Bacillus species can be either obligate aerobes which are dependent on oxygen, or facultative anaerobes which can survive in the absence of oxygen. Cultured Bacillus species test positive for the enzyme catalase if oxygen has been used or is present.\n\nBacillus can reduce themselves to oval endospores and can remain in this dormant state for years. The endospore of one species from Morocco is reported to have survived being heated to 420 °C. Endospore formation is usually triggered by a lack of nutrients: the bacterium divides within its cell wall, and one side then engulfs the other. They are not true spores (i.e., not an offspring).  Endospore formation originally defined the genus, but not all such species are closely related, and many species have been moved to other genera of the Bacillota. Only one endospore is formed per cell. The spores are resistant to heat, cold, radiation, desiccation, and disinfectants. Bacillus anthracis needs oxygen to sporulate; this constraint has important consequences for epidemiology and control. In vivo, B. anthracis produces a polypeptide (polyglutamic acid) capsule that kills it from phagocytosis. The genera Bacillus and Clostridium constitute the family Bacillaceae. Species are identified by using morphologic and biochemical criteria. Because the spores of many Bacillus species are resistant to heat, radiation, disinfectants, and desiccation, they are difficult to eliminate from medical and pharmaceutical materials and are a frequent cause of contamination. Not only are they resistant to heat, radiation, etc., but they are also resistant to chemicals such as antibiotics. This resistance allows them to survive for many years and especially in a controlled environment. Bacillus species are well known in the food industries as troublesome spoilage organisms.\n\nUbiquitous in nature, Bacillus includes symbiotic (sometimes referred to as endophytes) as well as independent species. Two parasitic pathogenic species are medically significant: B. anthracis causes anthrax; and B. cereus causes food poisoning.\n\nMany species of Bacillus can produce copious amounts of enzymes, which are used in various industries, such as in the production of alpha amylase used in starch hydrolysis and the protease subtilisin used in detergents. B. subtilis  is a valuable model for bacterial research.\nSome Bacillus species can synthesize and secrete lipopeptides, in particular surfactins and mycosubtilins. Bacillus species are also found in marine sponges. Marine sponge associated Bacillus subtilis (strains WS1A and YBS29) can synthesize several antimicrobial peptides. These Bacillus subtilis strains can develop disease resistance in Labeo rohita.\n\nStructure\n\nCell wall \n\nThe cell wall of Bacillus is a structure on the outside of the cell that forms the second barrier between the bacterium and the environment, and at the same time maintains the rod shape and withstands the pressure generated by the cell's turgor. The cell wall is made of teichoic and teichuronic acids. B. subtilis is the first bacterium for which the role of an actin-like cytoskeleton in cell shape determination and peptidoglycan synthesis was identified and for which the entire set of peptidoglycan-synthesizing enzymes was localized. The role of the cytoskeleton in shape generation and maintenance is important.\n\nBacillus species are rod-shaped, endospore-forming aerobic or facultatively anaerobic, Gram-positive bacteria; in some species cultures may turn Gram-negative with age. The many species of the genus exhibit a wide range of physiologic abilities that allow them to live in every natural environment. Only one endospore is formed per cell. The spores are resistant to heat, cold, radiation, desiccation, and disinfectants.\n\nOrigin of name \nThe genus Bacillus was named in 1835 by Christian Gottfried Ehrenberg, to contain rod-shaped (bacillus) bacteria. He had seven years earlier named the genus Bacterium. Bacillus was later amended by Ferdinand Cohn to further describe them as spore-forming, Gram-positive, aerobic or facultatively anaerobic bacteria. Like other genera associated with the early history of microbiology, such as Pseudomonas and Vibrio, the 266 species of Bacillus are ubiquitous. The genus has a very large ribosomal 16S diversity.\n\nIsolation and identification\nEstablished methods for isolating Bacillus species for culture primarily involve suspension of sampled soil in distilled water, heat shock to kill off vegetative cells leaving primarily viable spores in the sample, and culturing on agar plates with further tests to confirm the identity of the cultured colonies. Additionally, colonies which exhibit characteristics typical of Bacillus bacteria can be selected from a culture of an environmental sample which has been significantly diluted following heat shock or hot air drying to select potential Bacillus bacteria for testing.\n\nCultured colonies are usually large, spreading, and irregularly shaped. Under the microscope, the Bacillus cells appear as rods, and a substantial portion of the cells usually contain oval endospores at one end, making them bulge.\n\nCharacteristics of Bacillus spp. \nS.I. Paul et al. (2021) isolated and identified multiple strains of Bacillus species (strains WS1A, YBS29, KSP163A, OA122, ISP161A, OI6, WS11, KSP151E, S8) from marine sponges of the Saint Martin's Island Area of the Bay of Bengal, Bangladesh. Based on their study, colony, morphological, physiological, and biochemical characteristics of Bacillus spp. are shown in the Table below.\n\nNote: + = Positive, – =Negative, O= Oxidative, F= Fermentative\n\nPhylogeny\nThree proposals have been presented as representing the phylogeny of the genus Bacillus. The first proposal, presented in 2003, is a Bacillus-specific study, with the most diversity covered using 16S and the ITS regions. It divides the genus into 10 groups. This includes the nested genera Paenibacillus, Brevibacillus, Geobacillus, Marinibacillus and Virgibacillus.\n\nThe second proposal, presented in 2008,  constructed a 16S (and 23S if available) tree of all validated species. The genus Bacillus contains a very large number of nested taxa and majorly in both 16S and 23S. It is paraphyletic to the Lactobacillales (Lactobacillus, Streptococcus, Staphylococcus, Listeria, etc.), due to Bacillus coahuilensis and others.\n\nA third proposal, presented in 2010, was a gene concatenation study, and found results similar to the 2008 proposal, but with a much more limited number of species in terms of groups. (This scheme used Listeria as an outgroup, so in light of the ARB tree, it may be \"inside-out\").\n\nOne clade, formed by Bacillus anthracis, Bacillus cereus, Bacillus mycoides, Bacillus pseudomycoides, Bacillus thuringiensis, and Bacillus weihenstephanensis under the 2011 classification standards, should be a single species (within 97% 16S identity), but due to medical reasons, they are considered separate species (an issue also present for four species of Shigella and Escherichia coli).\n\nA phylogenomic study of 1104 Bacillus proteomes was based on 114 core proteins and delineated the relationships among the various species, defined as Bacillus from the NCBI taxonomy. The various strains were clustered into species, based on Average Nucleotide identity (ANI) values, with a species cutoff of 95%.\n\nSpecies \n\n B. Symun\n B. acidicola\n B. acidiproducens\n B. acidocaldarius\n B. acidoterrestris\n B. aeolius\n B. aerius\n B. aerophilus\n B. agaradhaerens\n B. agri\n B. aidingensis\n B. akibai\n B. albus\n B. alcalophlus\n B. algicola\n B. alginolyticus\n B. alkalidiazotrophicus\n B. alkalinitrilicus\n B. alkalisediminis\n B. alkalitelluris\n B. altitudinis\n B. alveayuensis\n B. alvei\n B. amyloliquefaciens\n B. a. subsp. amyloliquefaciens\n B. a. subsp. plantarum\n B. aminovorans\n B. amylolyticus\n B. andreesenii\n B. aneurinilyticus\n B. anthracis\n B. aquimaris\n B. arenosi\n B. arseniciselenatis\n B. arsenicus\n B. aurantiacus\n B. arvi\n B. aryabhattai\n B. asahii\n B. atrophaeus\n B. axarquiensis\n B. azotofixans\n B. azotoformans\n B. badius\n B. barbaricus\n B. bataviensis\n B. beijingensis\n B. benzoevorans\n B. beringensis\n B. berkeleyi\n B. beveridgei\n B. bogoriensis\n B. boroniphilus\n B. borstelensis\n B. brevis\n B. butanolivorans\n B. canaveralius\n B. carboniphilus\n B. cecembensis\n B. cellulosilyticus\n B. centrosporus\n B. cereus\n B. chagannorensis\n B. chitinolyticus\n B. chondroitinus\n B. choshinensis\n B. chungangensis\n B. cibi\n B. circulans\n B. clarkii\n B. clausii\n B. coagulans\n B. coahuilensis\n B. cohnii\n B. composti\n B. curdlanolyticus\n B. cycloheptanicus\n B. cytotoxicus\n B. daliensis\n B. decisifrondis\n B. decolorationis\n B. deserti\n B. dipsosauri\n B. drentensis\n B. edaphicus\n B. ehimensis\n B. eiseniae\n B. enclensis\n B. endophyticus\n B. endoradicis\n B. farraginis\n B. fastidiosus\n B. fengqiuensis\n B. filobacterium rodentuim\n B. firmus\n B. flexus\n B. foraminis\n B. fordii\n B. formosus\n B. fortis\n B. fumarioli\n B. funiculus\n B. fusiformis\n B. gaemokensis\n B. galactophilus\n B. galactosidilyticus\n B. galliciensis\n B. gelatini\n B. gibsonii\n B. ginsengi\n B. ginsengihumi\n B. ginsengisoli\n B. glucanolyticus\n B. gordonae\n B. gottheilii\n B. graminis\n B. halmapalus\n B. haloalkaliphilus\n B. halochares\n B. halodenitrificans\n B. halodurans\n B. halophilus\n B. halosaccharovorans\n B. hemicellulosilyticus\n B. hemicentroti\n B. herbersteinensis\n B. horikoshii\n B. horneckiae\n B. horti\n B. huizhouensis\n B. humi\n B. hwajinpoensis\n B. idriensis\n B. indicus\n B. infantis\n B. infernus\n B. insolitus\n B. invictae\n B. iranensis\n B. isabeliae\n B. isronensis\n B. jeotgali\n B. kaustophilus\n B. kobensis\n B. kochii\n B. kokeshiiformis\n B. koreensis\n B. korlensis\n B. kribbensis\n B. krulwichiae\n B. laevolacticus\n B. larvae\n B. laterosporus\n B. lautus\n B. lehensis\n B. lentimorbus\n B. lentus\n B. licheniformis\n B. ligniniphilus\n B. litoralis\n B. locisalis\n B. luciferensis\n B. luteolus\n B. luteus\n B. macauensis\n B. macerans\n B. macquariensis\n B. macyae\n B. malacitensis\n B. mannanilyticus\n B. marisflavi\n B. marismortui\n B. marmarensis\n B. massiliensis\n B. megaterium\n \"B. mesentericus\"\n B. mesonae\n B. methanolicus\n B. methylotrophicus\n B. migulanus\n B. mojavensis\n B. mucilaginosus\n B. muralis\n B. murimartini\n B. mycoides\n B. naganoensis\n B. nanhaiensis\n B. nanhaiisediminis\n B. nealsonii\n B. neidei\n B. neizhouensis\n B. niabensis\n B. niacini\n B. novalis\n B. oceanisediminis\n B. odysseyi\n B. okhensis\n B. okuhidensis\n B. oleronius\n B. oryzaecorticis\n B. oshimensis\n B. pabuli\n B. pakistanensis\n B. pallidus\n B. pallidus\n B. panacisoli\n B. panaciterrae\n B. pantothenticus\n B. parabrevis\n B. paraflexus\n B. pasteurii\n B. patagoniensis\n B. peoriae\n B. persepolensis\n B. persicus\n B. pervagus\n B. plakortidis\n B. pocheonensis\n B. polygoni\n B. polymyxa\n B. popilliae\n B. pseudalcalophilus\n B. pseudofirmus\n B. pseudomycoides\n B. psychrodurans\n B. psychrophilus\n B. psychrosaccharolyticus\n B. psychrotolerans\n B. pulvifaciens\n B. pumilus\n B. purgationiresistens\n B. pycnus\n B. qingdaonensis\n B. qingshengii\n B. reuszeri\n B. rhizosphaerae\n B. rigui\n B. ruris\n B. safensis\n B. salarius\n B. salexigens\n B. saliphilus\n B. schlegelii\n B. sediminis\n B. selenatarsenatis\n B. selenitireducens\n B. seohaeanensis\n B. shacheensis\n B. shackletonii\n B. siamensis\n B. silvestris\n B. simplex\n B. siralis\n B. smithii\n B. soli\n B. solimangrovi\n B. solisalsi\n B. songklensis\n B. sonorensis\n B. sphaericus\n B. sporothermodurans\n B. stearothermophilus\n B. stratosphericus\n B. subterraneus\n B. subtilis\n B. s. subsp. inaquosorum\n B. s. subsp. spizizenii\n B. s. subsp. subtilis\n B. taeanensis\n B. tequilensis\n B. thermantarcticus\n B. thermoaerophilus\n B. thermoamylovorans\n B. thermocatenulatus\n B. thermocloacae\n B. thermocopriae\n B. thermodenitrificans\n B. thermoglucosidasius\n B. thermolactis\n B. thermoleovorans\n B. thermophilus\n B. thermoproteolyticus\n B. thermoruber\n B. thermosphaericus\n B. thiaminolyticus\n B. thioparans\n B. thuringiensis\n B. tianshenii\n B. trypoxylicola\n B. tusciae\n B. validus\n B. vallismortis\n B. vedderi\n B. velezensis\n B. vietnamensis\n B. vireti\n B. vulcani\n B. wakoensis\n B. xiamenensis\n B. xiaoxiensis\n B. zanthoxyli\n B. zhanjiangensis\n\n Ecological and clinical significance Bacillus species are ubiquitous in nature, e.g. in soil. They can occur in extreme environments such as high pH (B. alcalophilus), high temperature (B. thermophilus), and high salt concentrations (B. halodurans). They also are very commonly found as endophytes in plants where they can play a critical role in their immune system, nutrient absorption and nitrogen fixing capabilities. B. thuringiensis produces a toxin that can kill insects and thus has been used as insecticide. B. siamensis has antimicrobial compounds that inhibit plant pathogens, such as the fungi Rhizoctonia solani and Botrytis cinerea, and they promote plant growth by volatile emissions. Some species of Bacillus are naturally competent for DNA uptake by transformation.\n Two Bacillus species are medically significant: B. anthracis, which causes anthrax; and B. cereus, which causes food poisoning, with symptoms similar to that caused by Staphylococcus.\n B. cereus  produces toxins which cause two different set of symptoms:\n emetic toxin which can cause vomiting and nausea\n diarrhea\n B. thuringiensis is an important insect pathogen, and is sometimes used to control insect pests.\n B. subtilis is an important model organism. It is also a notable food spoiler, causing ropiness in bread and related food.\n B. subtilis can also produce and secrete antibiotics.\n Some environmental and commercial strains of B. coagulans may play a role in food spoilage of highly acidic, tomato-based products.\n\nIndustrial significance\nMany Bacillus species are able to secrete large quantities of enzymes. Bacillus amyloliquefaciens is the source of a natural antibiotic protein barnase (a ribonuclease), alpha amylase used in starch hydrolysis, the protease subtilisin used with detergents, and the BamH1 restriction enzyme used in DNA research.\n\nA portion of the Bacillus thuringiensis genome was incorporated into corn (and cotton) crops. The resulting GMOs are  resistant to some insect pests. Bacillus subtilis (natto) is the key microbial participant in the ongoing production of the soya-based traditional natto fermentation, and some Bacillus species are on the Food and Drug Administration's GRAS (generally regarded as safe) list. The capacity of selected Bacillus strains to produce and secrete large quantities (20–25 g/L) of extracellular enzymes has placed them among the most important industrial enzyme producers. The ability of different species to ferment in the acid, neutral, and alkaline pH ranges, combined with the presence of thermophiles in the genus, has led to the development of a variety of new commercial enzyme products with the desired temperature, pH activity, and stability properties to address a variety of specific applications. Classical mutation and (or) selection techniques, together with advanced cloning and protein engineering strategies, have been exploited to develop these products. Efforts to produce and secrete high yields of foreign recombinant proteins in Bacillus hosts initially appeared to be hampered by the degradation of the products by the host proteases. Recent studies have revealed that the slow folding of heterologous proteins at the membrane-cell wall interface of Gram-positive bacteria renders them vulnerable to attack by wall-associated proteases. In addition, the presence of thiol-disulphide oxidoreductases in B. subtilis may be beneficial in the secretion of disulphide-bond-containing proteins. Such developments from our understanding of the complex protein translocation machinery of Gram-positive bacteria should allow the resolution of current secretion challenges and make Bacillus species preeminent hosts for heterologous protein production. Bacillus strains have also been developed and engineered as industrial producers of nucleotides, the vitamin riboflavin, the flavor agent ribose, and the supplement poly-gamma-glutamic acid. With the recent characterization of the genome of B. subtilis 168 and of some related strains, Bacillus species are poised to become the preferred hosts for the production of many new and improved products as we move through the genomic and proteomic era.\n\nUse as model organismBacillus subtilis is one of the best understood prokaryotes, in terms of molecular and cellular biology. Its superb genetic amenability and relatively large size have provided the powerful tools required to investigate a bacterium from all possible aspects. Recent improvements in fluorescent microscopy techniques have provided novel insight into the dynamic structure of a single cell organism. Research on B. subtilis has been at the forefront of bacterial molecular biology and cytology, and the organism is a model for differentiation, gene/protein regulation, and cell cycle events in bacteria.\n\n See also \n Paenibacillus and Virgibacillus, genera of bacteria formerly included in Bacillus''.\n\nReferences\n\nExternal links \n\n Bacillus genomes and related information at PATRIC, a Bioinformatics Resource Center funded by NIAID\n\n \nBacteria genera\nGram-positive bacteria"
}