{
  "title": "Carlos Chagas Filho",
  "content": "Carlos Chagas Filho (September 10, 1910 – February 16, 2000) was a Brazilian physician, biologist and scientist active in the field of neuroscience. He was internationally renowned for his investigations on the neural mechanisms underlying the phenomenon of electrogenesis by the electroplaques of electric fishes. He was also an important scientific leader, being one of the founders of the Biophysics Institute of the Federal University of Rio de Janeiro and was also a president for 16 years of the Vatican's Pontifical Academy of Sciences, and president of the Brazilian Academy of Sciences (1965–1967).\n\nLife\nHe was the second son of Carlos Chagas (1879–1934), an eminent scientist who is credited with the discovery of Chagas disease. His oldest brother was Evandro Chagas (1905–1940), also a physician and scientist specialized, like his father, in tropical medicine.\n\nHe studied medicine from 1926 to 1931 at the Faculdade de Medicina da Universidade do Brasil (presently the Federal University of Rio de Janeiro). While a student he worked at Manguinhos, where the Instituto Oswaldo Cruz was founded by the physician Oswaldo Cruz (1872–1917) and where his father worked, as well as at a hospital in Lassance, state of Minas Gerais, where his father had discovered Chagas disease. After graduation, he went to become a director of this hospital during 1932. But what he really liked to do was biomedical research, following the example of his father and colleagues, so in the next years he worked with several leaders in the field of physiology, such as Miguel Osório de Almeida (1890–1952) and José Carneiro Felippe. One year after graduation, he accepted a teaching post as assistant professor at the Medical School, in the chair of Biological Physics. With the death of its incumbent, Lafayette Rodrigues Pereira, he became its chairman and full professor.\n\nFeeling the need to specialize further in neurophysiology, Filho travelled to France, where he worked with René Wurmser and Alfred Fessard, in Paris, and to England, where he worked with A.V. Hill (1886–1977). Returning to Brazil, he established a Laboratory of Biophysics at the Medical School and assembled a group of students and researchers. In 1945 he achieved the elevation of the Laboratory to the Biophysics Institute, which in a short time became one of the most important and excellent research centers in Brazil. He was its director for a long time, as well as the dean of the Medical School. The Institute presently bears his name. Carlos Chagas Filho retired in 1980, but continued to work steadfastly almost until his death, at 89 years of age.\n\nWork\nFilho's main scientific contribution was centered on the study of the electroplaques of the \"poraquê\" or electric eel (Electrophorus electricus), actually a fresh water electric fish native to the Amazon. With his group, he made important and original advances in the elucidation of its anatomy and electrophysiology, cytochemistry, as well as its nervous control. He discovered the brain command structures which control electrical discharges. He discovered also that the electroplaques has two kinds of excitability, one which is direct, and another which is reflex via the nervous pathways. He studied also the effects of curare on the electroplaques, which are modified striated muscles and thus have synaptic transmission based on acetylcholine (curare is an antagonist of this neurotransmitter). Filho also isolated the ACh membrane receptor.\n\nAs an educator, Filho left an important influence on biomedical research in Brazil, through his many scientific disciples and colleagues at the Biophysics Institute, such as Aristides Azevedo Pacheco Leão. It was during the initial years of the Institute, also, that Rita Levi-Montalcini (1909-), then a young researcher of Jewish descent who had to escape fascism, worked towards her important discoveries on neurotrophic factors, supported by Carlos Chagas Filho. She later received the Nobel Prize of Physiology and Medicine.\n\nHe published several books, including an autobiography, a biographical memoir about his father and more than 100 scientific papers.\n\nScientific leadership and honours \nDr. Chagas Filho played a significant role as international leader and representative of Brazilian science abroad. He was a Brazilian delegate and ambassador (1966) to UNESCO in Paris, and member of the Research Council of the Pan American Health Organization (PAHO), in Washington, DC. At the United Nations he was president of the Special Committee for the Application of Science and Technology to Development. Together with Nobel Prize winner, physicist Abdus Salam (1926–1996), he founded the International Federation of Institutes for Advanced Sciences (IFIAS).\n\nIn 1972, he was appointed by Pope Paul VI to the presidency of the Pontifical Academy of Sciences, which he occupied until 1989. During his tenure, he was distinguished with the historical task of rehabilitating Galileo Galilei by the Roman Catholic Church and with coordinating a study of the historical and scientific validity of the Turin shroud. He was deeply religious and sought to reconcile science and religion as best as possible. Thus, he led the Academy of Sciences through a number of important meetings and publications, examining controversial issues such as the brain and conscience, and attracting great scientific personalities to the Academy, including a number of Nobel awardees.\n\nIn Brazil he was a member, vice-president and president of the Brazilian Academy of Sciences (1941–2000) and member of the Brazilian Academy of Letters (1974–2000), a member of the National Research Council and one of the founders and member of the Brazilian Society for the Advancement of Science.\n\nCarlos Chagas Filho was awarded with 16 titles of Honoris Causa Doctor in many national and foreign universities, and 19 decorations, including that of Légion d'Honneur (1979) and the Brazilian Order of Scientific Merit. He was a member of the French Académie des Sciences and Académie Nationale de Médecine, Academia das Ciências de Lisboa, American Academy of Arts and Sciences, American Philosophical Academy, Royal Academy of Belgium, Romanian Academy of Sciences and the International Academy of the History of Sciences.\n\nAmong his many scientific awards, he received the Moinho Santista Science Prize (1960); the Prêmio Álvaro Alberto para a Ciência e Tecnologia (1988); and the Prix mondial Cino Del Duca, by the Fondation Simone et Cino Del Duca, France (1989).\n\nBibliography\n Chagas Filho, C. Carlos Chagas, Meu Pai. Rio de Janeiro, Casa de Oswaldo Cruz/Fiocruz, 1993.\n E Gomes-Quintana, RD Machado, C Chagas Filho. Cholinergic membranes from normal and denervated electric organ of Electrophorus electricus (L.). IRCS Med. Sci Biochem, 1980.\n CS Mermelstein, V Moura Neto, C Chagas Filho . Desmin expression in the electric organs of Electrophorus electricus (L.). J Cell Biochem, 1988.\n H Meyer, G Oliveira Castro, C Chagas Filho. Quelques aspects de l’histogenese et de l’ontogenese des organes électriques chez l’ Electrophorus electricus… CR Acad Sci Paris, 1971.\n C Chagas Filho, E Penna-Franca, A Hassón-Voloch. Studies of the mechanism of curarization. An Acad Bras Cien, 1957.\n\nExternal links\n Almeida DF. Carlos Chagas Filho, Scientist and Citizen. An Acad Bras Cienc. 2000 Sep;72(3):299-300. Full text in English\n Carlos Chagas Filho. Brazilian Academy of Sciences biography (In English)\n Carlos Chagas Filho. Notable Brazilians. Instituto Brasileiro de Informação Científica e Tecnológica. (In Portuguese)\n Carlos Chagas Filho. Brazilian Academy of Letters biography (in Portuguese)\n Pinto-Dias, JC. Carlos Chagas Filho e a doença de Chagas. Alguns traços à luz de confidências e inconfidências . Rev. Soc. Bras. Med. Trop. 2000; 33(3). Eulogy (in Portuguese). Full text\n Biography and interviews. Instituto Oswaldo Cruz. (In Portuguese)\n Instituto de Biofísica Carlos Chagas Filho website.\nDarcy Fontoura de Almeida, «Carlos Chagas Filho», Biographical Memoirs - Proceedings of the American Philosophical Society (vol. 147, no. 1, 2003, pp. 77–82)\n\n1910 births\n2000 deaths\nBrazilian neuroscientists\nRecipients of the National Order of Scientific Merit (Brazil)\nBrazilian physiologists\nFederal University of Rio de Janeiro alumni\nMembers of the Brazilian Academy of Letters\nMembers of the Brazilian Academy of Sciences\nPresidents of the Pontifical Academy of Sciences\nMembers of the French Academy of Sciences\nTWAS fellows\n20th-century Brazilian physicians"
}