{
  "title": "Catatonia",
  "content": "Catatonia is a complex neuropsychiatric behavioral syndrome that is characterized by abnormal movements, immobility, abnormal behaviors, and withdrawal. The onset of catatonia can be acute or subtle and symptoms can wax, wane, or change during episodes. It has historically been related to schizophrenia (catatonic schizophrenia), but catatonia is most often seen in mood disorders. It is now known that catatonic symptoms are nonspecific and may be observed in other mental, neurological, and medical conditions. Catatonia is not a stand-alone diagnosis (although some experts disagree), and the term is used to describe a feature of the underlying disorder.\n\nThere are several subtypes of catatonia: akinetic catatonia, excited catatonia, malignant catatonia, and delirious mania.\n\nRecognizing and treating catatonia is very important as failure to do so can lead to poor outcomes and can be potentially fatal. Treatment with benzodiazepines or ECT can lead to remission of catatonia. There is growing evidence of the effectiveness of the NMDA receptor antagonists amantadine and memantine for benzodiazepine-resistant catatonia. Antipsychotics are sometimes employed, but they can worsen symptoms and have serious adverse effects.\n\nSigns and symptoms\nThe presentation of a patient with catatonia varies greatly depending on the subtype and underlying cause, and can be acute or subtle.\n\nBecause most patients with catatonia have an underlying psychiatric illness, the majority will present with worsening depression, mania, or psychosis followed by catatonia symptoms. Catatonia presents as a motor disturbance in which patients will display marked reduction in movement, marked agitation, or a mixture of both despite having the physical capacity to move normally. These patients may be unable to start an action or stop one. Movements and mannerisms may be repetitive, or purposeless.\n\nThe most common signs of catatonia are immobility, mutism, withdrawal and refusal to eat, staring, negativism, posturing (rigidity), rigidity, waxy flexibility/catalepsy, stereotypy (purposeless, repetitive movements), echolalia or echopraxia, verbigeration (repeat meaningless phrases). It should not be assumed that patients presenting with catatonia are unaware of their surroundings as some patients can recall in detail their catatonic state and their actions.\n\nThere are several subtypes of catatonia and they are characterized by the specific movement disturbance and associated features. Although catatonia can be divided into various subtypes, the natural history of catatonia is often fluctuant and different states can exist within the same individual.\n\nSubtypes \nWithdrawn Catatonia: This form of catatonia is characterized by decreased response to external stimuli, immobility or inhibited movement, mutism, staring, posturing, and negativism. Patients may sit or stand in the same position for hours, may hold odd positions, and may resist movement of their extremities.\n\nExcited Catatonia: Excited catatonia is characterized by odd mannerisms/gestures, performing purposeless or inappropriate actions, excessive motor activity, restlessness, stereotypy, impulsivity, agitation, and combativeness. Speech and actions may be repetitive or mimic another person's. People in this state are extremely hyperactive and may have delusions and hallucinations. Catatonic excitement is commonly cited as one of the most dangerous mental states in psychiatry.\n\nMalignant Catatonia: Malignant catatonia is a life-threatening condition that may progress rapidly within a few days. It is characterized by fever, abnormalities in blood pressure, heart rate, respiratory rate, diaphoresis (sweating), and delirium. Certain lab findings are common with this presentation; however, they are nonspecific, which means that they are also present in other conditions and do not diagnose catatonia. These lab findings include: leukocytosis, elevated creatine kinase, low serum iron. The signs and symptoms of malignant catatonia overlap significantly with neuroleptic malignant syndrome (NMS) and so a careful history, review of medications, and physical exam are critical to properly differentiate these conditions. For example, if the patient has waxy flexibility and holds a position against gravity when passively moved into that position, then it is likely catatonia. If the patient has a \"lead-pipe rigidity\" then NMS should be the prime suspect.\n\nOther forms:\n Periodic catatonia is an inconsistently defined entity. In the Wernicke-Kleist-Leonhard school, it is a distinct form of \"non-system schizophrenia\" characterized by recurrent acute phases with hyperkinetic and akinetic features and often psychotic symptoms, and the build-up of a residual state in between these acute phases, which is characterized by low-level catatonic features and aboulia of varying severity. The condition has a strong hereditary component. According to modern classifications, this may be diagnosed as a form of bipolar disorder, schizoaffective disorder or schizophrenia. Independently, the term periodic catatonia is sometimes used in modern literature to describe a syndrome of recurrent phases of acute catatonia (excited or inhibited type) with full remission between episodes, which resembles the description of \"motility psychosis\" in the Wernicke-Kleist-Leonhard school.\n System catatonias or systematic catatonias are only defined in the Wernicke-Kleist-Leonhard school. These are chronic-progressive conditions characterized by specific disturbances of volition and psychomotricity, leading to a dramatic decline of executive and adaptive functioning and ability to communicate. They are considered forms of schizophrenia but distinct from other schizophrenic conditions. Affective flattening and apparent loss of interests are common but may be related to reduced emotional expression rather than lack of emotion. Heredity is low. Of the 21 different forms (6 \"simple\" and 15 \"combined\" forms) that have been described, most overlap only partially - if at all - with current definitions of either catatonia or schizophrenia, and thus are difficult to classify according to modern diagnostic manuals.\n Early childhood catatonias are also a diagnosis exclusive to the Wernicke-Kleist-Leonhard school, and refers to system catatonias that manifest in young children. Clinically, these conditions resemble severe regressive forms of autism.\n Chronic catatonia-like breakdown or autistic catatonia refers to a functional decline seen in some patients with pre-existing autism spectrum disorder and/or intellectual disability which usually runs a chronic-progressive course and encompasses attenuated catatonic symptoms as well as mood and anxiety symptoms that increasingly interfere with adaptive functioning. Onset is typically insidious and often mistaken for background autistic symptoms. Slowing of voluntary movement, reduced speech, aboulia, increased prompt dependency and obsessive-compulsive symptoms are frequently seen; negativism, (auto-)aggressive behaviors and ill-defined hallucinations have also been reported. Both the causes of this disorder as well as its prognosis appear to be heterogenous, with most patients showing partial recovery upon treatment. It seems to be related to chronic stress as a result of life transitions, loss of external time structuring, sensory sensitivities and/or traumatic experiences, co-morbid mental disorders, or other unknown causes. Since clinical catatonia can not always be diagnosed, this condition has also been renamed to the more general term \"late regression\".\n\nComplications\nPatients may experience several complications from being in a catatonic state. The nature of these complications will depend on the type of catatonia being experienced by the patient. For example, patients presenting with withdrawn catatonia may have refusal to eat which will in turn lead to malnutrition and dehydration. Furthermore, if immobility is a symptom the patient is presenting with, then they may develop pressure ulcers, muscle contractions, and are at risk of developing deep vein thrombosis (DVT) and pulmonary embolus (PE). Patients with excited catatonia may be aggressive and violent, and physical trauma may result from this. Catatonia may progress to the malignant type which will present with autonomic instability and may be life-threatening. Other complications also include the development of pneumonia and neuroleptic malignant syndrome.\n\nCauses \n\nCatatonia is almost always secondary to another underlying illness, often a psychiatric disorder. Mood disorders such as a bipolar disorder and depression are the most common etiologies to progress to catatonia.  Other psychiatric associations include schizophrenia and other primary psychotic disorders. It also is related to autism spectrum disorders and ADHD. Psychodynamic theorists have interpreted catatonia as a defense against the potentially destructive consequences of responsibility, and the passivity of the disorder provides relief.\n\nCatatonia is also seen in many medical disorders, including infections (such as encephalitis), autoimmune disorders, meningitis, focal neurological lesions (including strokes), alcohol withdrawal, abrupt or overly rapid benzodiazepine withdrawal, cerebrovascular disease, neoplasms, head injury, and some metabolic conditions (homocystinuria, diabetic ketoacidosis, hepatic encephalopathy, and hypercalcaemia).\n\nPathogenesis \nThe pathophysiology that leads to catatonia is still poorly understood and a definite mechanism remains unknown. Neurologic studies have implicated several pathways; however, it remains unclear whether these findings are the cause or the consequence of the disorder.\n\nAbnormalities in GABA, glutamate signaling, serotonin, and dopamine transmission are believed to be implicated in catatonia.\n\nFurthermore, it has also been hypothesized that pathways that connect the basal ganglia with the cortex and thalamus is involved in the development of catatonia.\n\nDiagnosis\n\nThere is not yet a definitive consensus regarding diagnostic criteria of catatonia. In the fifth edition of the American Psychiatric Association's Diagnostic and Statistical Manual of Mental Disorders (DSM-5, 2013) and the World Health Organization's eleventh edition of the International Classification of Diseases (ICD-11, 2022), the classification is more homogeneous than in earlier editions. Prominent researchers in the field have other suggestions for diagnostic criteria.\n\nDSM-5 classification\n\nThe DSM-5 does not classify catatonia as an independent disorder, but rather it classifies it as catatonia associated with another mental disorder, due to another medical condition, or as unspecified catatonia.\n\nCatatonia is diagnosed by the presence of three or more of the following 12 psychomotor symptoms in association with a mental disorder, medical condition, or unspecified:\n stupor: no psycho-motor activity; not actively relating to the environment\n catalepsy: passive induction of a posture held against gravity\n waxy flexibility: allowing positioning by an examiner and maintaining that position\n mutism: no, or very little, verbal response (exclude if known aphasia)\n negativism: opposition or no response to instructions or external stimuli\n posturing: spontaneous and active maintenance of a posture against gravity\n mannerisms that are odd, circumstantial caricatures of normal actions\n stereotypy: repetitive, abnormally frequent, non-goal-directed movements\n agitation, not influenced by external stimuli\n grimacing: keeping a fixed facial expression\n echolalia: mimicking another's speech\n echopraxia: mimicking another's movements.\n\nOther disorders (additional code 293.89 [F06.1] to indicate the presence of the co-morbid catatonia):\n Catatonia associated with autism spectrum disorder\n Catatonia associated with schizophrenia spectrum and other psychotic disorders\n Catatonia associated with brief psychotic disorder\n Catatonia associated with schizophreniform disorder\n Catatonia associated with schizoaffective disorder\n Catatonia associated with a substance-induced psychotic disorder\n Catatonia associated with bipolar and related disorders\n Catatonia associated with major depressive disorder\n Catatonic disorder due to another medical condition\n\nIf catatonic symptoms are present but do not form the catatonic syndrome, a medication- or substance-induced aetiology should first be considered.\n\nICD-11 classification\n\nIn ICD-11 catatonia is defined as a syndrome of primarily psychomotor disturbances that is characterized by the simultaneous occurrence of several symptoms such as stupor; catalepsy; waxy flexibility; mutism; negativism; posturing; mannerisms; stereotypies; psychomotor agitation; grimacing; echolalia and echopraxia. Catatonia may occur in the context of specific mental disorders, including mood disorders, schizophrenia or other primary psychotic disorders, and Neurodevelopmental disorders, and may be induced by psychoactive substances, including medications. Catatonia may also be caused by a medical condition not classified under mental, behavioral, or neurodevelopmental disorders.\n\nAssessment/Physical \nCatatonia is often overlooked and under-diagnosed. Patients with catatonia most commonly have an underlying psychiatric disorder, for this reason, physicians may overlook signs of catatonia due to the severity of the psychosis the patient is presenting with. Furthermore, the patient may not be presenting with the common signs of catatonia such as mutism and posturing. Additionally, the motor abnormalities seen in catatonia are also present in psychiatric disorders. For example, a patient with mania will show increased motor activity that may progress to exciting catatonia. One way in which physicians can differentiate between the two is to observe the motor abnormality. Patients with mania present with increased goal-directed activity. On the other hand, the increased activity in catatonia is not goal-directed and often repetitive.\n\nCatatonia is a clinical diagnosis and there is no specific laboratory test to diagnose it. However, certain testing can help determine what is causing the catatonia. An EEG will likely show diffuse slowing. If seizure activity is driving the syndrome, then an EEG would also be helpful in detecting this. CT or MRI will not show catatonia; however, they might reveal abnormalities that might be leading to the syndrome. Metabolic screens, inflammatory markers, or autoantibodies may reveal reversible medical causes of catatonia.\n\nVital signs should be frequently monitored as catatonia can progress to malignant catatonia which is life-threatening. Malignant catatonia is characterized by fever, hypertension, tachycardia, and tachypnea.\n\nRating scale\nVarious rating scales for catatonia have been developed, however, their utility for clinical care has not been well established. The most commonly used scale is the Bush-Francis Catatonia Rating Scale (BFCRS) (external link is provided below). The scale is composed of 23 items with the first 14 items being used as the screening tool. If 2 of the 14 are positive, this prompts for further evaluation and completion of the remaining 9 items.\n\nA diagnosis can be supported by the lorazepam challenge or the zolpidem challenge. While proven useful in the past, barbiturates are no longer commonly used in psychiatry; thus the option of either benzodiazepines or ECT.\n\nDifferential diagnosis \nThe differential diagnosis of catatonia is extensive as signs and symptoms of catatonia may overlap significantly with those of other conditions. Therefore, a careful and detailed history, medication review, and physical exam are key to diagnosing catatonia and differentiating it from other conditions. Furthermore, some of these conditions can themselves lead to catatonia. The differential diagnosis is as follows:\n Neuroleptic malignant syndrome (NMS) and catatonia are both life-threatening conditions that share many of the same characteristics including fever, autonomic instability, rigidity, and delirium. Lab values of low serum iron, elevated creatine kinase, and white blood cell count are also shared by the two disorders further complicating the diagnosis. There are features of malignant catatonia (posturing, impulsivity, etc.) that are absent from NMS and the lab results are not as consistent in malignant catatonia as they are in NMS. Some experts consider NMS to be a drug-induced condition associated with antipsychotics, particularly, first generation antipsychotics, but it has not been established as a subtype. Therefore, discontinuing antipsychotics and starting benzodiazepines is a treatment for this condition, and similarly it is helpful in catatonia as well.\n Anti-NMDA receptor encephalitis is an autoimmune disorder characterized by neuropsychiatric features and the presence of IgG antibodies. The presentation of anti-NMDAR encephalitis has been categorized into 5 phases: prodromal phase, psychotic phase, unresponsive phase, hyperkinetic phase, and recovery phase. The psychotic phase progresses into the unresponsive phase characterized by mutism, decreased motor activity, and catatonia.\n Both serotonin syndrome and malignant catatonia may present with signs and symptoms of delirium, autonomic instability, hyperthermia, and rigidity. Again, similar to the presentation in NSM. However, patients with Serotonin syndrome have a history of ingestion of serotonergic drugs (Ex: SSRI). These patients will also present with hyperreflexia, myoclonus, nausea, vomiting, and diarrhea.\n Malignant hyperthermia and malignant catatonia share features of autonomic instability, hyperthermia, and rigidity. However, malignant hyperthermia is a hereditary disorder of skeletal muscle that makes these patients susceptible to exposure to halogenated anesthetics and/or depolarizing muscle relaxants like succinylcholine. Malignant hyperthermia most commonly occurs in the intraoperative or postoperative periods. Other signs and symptoms of malignant hyperthermia include metabolic and respiratory acidosis, hyperkalemia, and cardiac arrhythmias.\n Akinetic mutism is a neurological disorder characterized by a decrease in goal-directed behavior and motivation; however, the patient has an intact level of consciousness. Patients may present with apathy, and may seem indifferent to pain, hunger, or thirst. Akinetic mutism has been associated with structural damage in a variety of brain areas. Akinetic mutism and catatonia may both manifest with immobility, mutism, and waxy flexibility. Differentiating both disorders is the fact that akinetic mutism does not present with echolalia, echopraxia, or posturing. Furthermore, it is not responsive to benzodiazepines as is the case for catatonia.\n Elective mutism has an anxious etiology but has also been associated with personality disorders. Patients with this disorder fail to speak with some individuals but will speak with others. Likewise, they may refuse to speak in certain situations; for example, a child who refuses to speak at school but is conversational at home. This disorder is distinguished from catatonia by the absence of any other signs/symptoms.\n Nonconvulsive status epilepticus is seizure activity with no accompanying tonic-clonic movements. It can present with stupor, similar to catatonia, and they both respond to benzodiazepines. Nonconvulsive status epilepticus is diagnosed by the presence of seizure activity seen on electroencephalogram (EEG). Catatonia on the other hand, is associated with normal EEG or diffuse slowing.\n Delirium is characterized by fluctuating disturbed perception and consciousness in the ill individual. It has hypoactive and hyperactive or mixed forms. People with hyperactive delirium present similarly to those with excited catatonia and have symptoms of restlessness, agitation, and aggression. Those with hypoactive delirium present with similarly to retarded catatonia, withdrawn and quiet. However, catatonia also includes other distinguishing features including posturing and rigidity as well as a positive response to benzodiazepines.\n Patients with locked-in syndrome present with immobility and mutism; however, unlike patients with catatonia who are unmotivated to communicate, patients with locked-in syndrome try to communicate with eye movements and blinking. Furthermore, locked-in syndrome is caused by damage to the brainstem.\n Stiff-person syndrome and catatonia are similar in that they may both present with rigidity, autonomic instability and a positive response to benzodiazepines. However, stiff-person syndrome may be associated with anti-glutamic acid decarboxylase (anti-GAD) antibodies and other catatonic signs such as mutism and posturing are not part of the syndrome.\n Untreated late-stage Parkinson's disease may present similarly to retarded catatonia with symptoms of immobility, rigidity, and difficulty speaking. Further complicating the diagnosis is the fact that many patients with Parkinson's disease will have major depressive disorder, which may be the underlying cause of catatonia. Parkinson's disease can be distinguished from catatonia by a positive response to levodopa. Catatonia on the other hand will show a positive response to benzodiazepines.\n Extrapyramidal side effects of antipsychotic medication, especially dystonia and akathisia, can be difficult to distinguish from catatonic symptoms, or may confound them in the psychiatric setting. Extrapyramidal motor disorders usually do not involve social symptoms like negativism, while individuals with catatonic excitement typically do not have the physically painful compulsion to move that is seen in akathisia.\n Certain stimming behaviors and stress responses in individuals with autism spectrum disorders can present similarly to catatonia. In autism spectrum disorders, chronic catatonia is distinguished by a lasting deterioration of adaptive skills from the background of pre-existing autistic symptomatology that cannot be easily explained. Acute catatonia is usually clearly distinguishable from autistic symptoms.\n The diagnostic entities of obsessional slowness and psychogenic parkinsonism show overlapping features with catatonia, such as motor slowness, gegenhalten (oppositional paratonia), mannerisms, and reduced or absent speech. However, psychogenic parkinsonism involves tremor which is unusual in catatonia. Obsessional slowness is a controversial diagnosis, with presentations ranging from severe but common manifestations of obsessive compulsive disorder to catatonia.\n Down Syndrome Disintegrative Disorder (or Down Syndrome Regression Disorder, DSDD / DSRD) is a chronic condition characterized by loss of previously acquired adaptive, cognitive and social functioning occurring in persons with Down Syndrome, usually during adolescence or early adulthood. The clinical picture is variable, but often includes catatonic signs, which is why it was called \"catatonic psychosis\" in initial reports in 1946. DSDD seems to phenotypically overlap with obsessional slowness (see above) and catatonia-like regression occurring in ASD.\n\nTreatment\nThe initial treatment of catatonia is to stop medication that could be potentially leading to the syndrome. These may include steroids, stimulants, anticonvulsants, neuroleptics, dopamine blockers, etc. The next step is to provide a \"lorazepam challenge,\" in which patients are given 2 mg of IV lorazepam (or another benzodiazepine). Most patients with catatonia will respond significantly to this within the first 15–30 minutes. If no change is observed during the first dose, then a second dose is given and the patient is re-examined. If the patient responds to the lorazepam challenge, then lorazepam can be scheduled at interval doses until the catatonia resolves. The lorazepam must be tapered slowly, otherwise, the catatonia symptoms may return. The underlying cause of the catatonia should also be treated during this time. If within a week the catatonia is not resolved, then ECT can be used to reverse the symptoms. ECT in combination with benzodiazepines is used to treat malignant catatonia. In France, zolpidem has also been used in diagnosis, and response may occur within the same time period. Ultimately the underlying cause needs to be treated.\n\nElectroconvulsive therapy (ECT) is an effective treatment for catatonia that is well acknowledged. ECT has also shown favorable outcomes in patients with chronic catatonia. However, it has been pointed out that further high quality randomized controlled trials are needed to evaluate the efficacy, tolerance, and protocols of ECT in catatonia.\n\nAntipsychotics should be used with care as they can worsen catatonia and are the cause of neuroleptic malignant syndrome, a dangerous condition that can mimic catatonia and requires immediate discontinuation of the antipsychotic.\n\nThere is evidence clozapine works better than other antipsychotics to treat catatonia, following a recent systematic review.\n\nExcessive glutamate activity is believed to be involved in catatonia; when first-line treatment options fail, NMDA antagonists such as amantadine or memantine may be used. Amantadine may have an increased incidence of tolerance with prolonged use and can cause psychosis, due to its additional effects on the dopamine system. Memantine has a more targeted pharmacological profile for the glutamate system, reduced incidence of psychosis and may therefore be preferred for individuals who cannot tolerate amantadine. Topiramate is another treatment option for resistant catatonia; it produces its therapeutic effects by producing glutamate antagonism via modulation of AMPA receptors.\n\nPrognosis\nPatients who experience an episode of catatonia are more likely to experience another recurring episode. Treatment response for patients with catatonia is 50–70% and these patients have a good prognosis. However, failure to respond to medication is a very poor prognosis. Many of these patients will require long-term and continuous mental health care. For patients with catatonia with underlying schizophrenia, the prognosis is much poorer.\n\nEpidemiology \nCatatonia has been mostly studied in acutely ill psychiatric patients. Catatonia frequently goes unrecognized, leading to the belief that the syndrome is rare; however, this is not true and prevalence has been reported to be as high as 10% in patients with acute psychiatric illnesses. One large population estimate has suggested that the incidence of catatonia is 10.6 episodes per 100 000 person-years. It occurs in males and females in approximately equal numbers. 21-46% of all catatonia cases can be attributed to a general medical condition.\n\nHistory \nReports of stupor-like and catatonia-like states abound in the history of psychiatry. After the middle of the 19th century there was an increase of interest in the motor disorders accompanying madness, culminating in the publication by Karl Ludwig Kahlbaum in 1874 of  (Catatonia or Tension Insanity).\n\nSee also\n\n Akinetic mutism\n Autistic catatonia\n Awakenings (1990 biopic about catatonic patients, based on Oliver Sacks's book of the same name)\n Blank expression\n Botulism\n Disorganized schizophrenia\n Homecoming (features catatonia as a main plot point)\n Karolina Olsson\n Oneiroid syndrome\n Paranoid schizophrenia\n Persistent vegetative state\n Resignation syndrome\n Sensory overload\n Tonic immobility\n Sleep paralysis\n\nReferences\n\nExternal links \n Catatonia in DSM-5\n Encyclopedia of Mental Disorders – Catatonic Disorders\n  \"Schizophrenia: Catatonic Type\" video by Heinz Edgar Lehmann, 1952\n Bush-Francis Catatonia Rating Scale\n\nMood disorders\nSchizophrenia\nPsychopathological syndromes"
}