{
  "title": "External counterpulsation",
  "content": "External counterpulsation  therapy (ECP) is a procedure that may be performed on individuals with angina, heart failure, or cardiomyopathy.\n\nMedical uses\nThe FDA approved the CardiAssistTM ECP system for the treatment of angina, acute myocardial infarction and cardiogenic shock under a 510(k) submission in 1980 Since then, additional ECP devices have been cleared by the FDA for use in treating stable or unstable angina pectoris, acute myocardial infarction, cardiogenic shock, and congestive heart failure.\n\nStudies have found EECP to be beneficial for patients with erectile dysfunction and some COPD patients. Additionally, improvements in exercise endurance in the non-diseased patient has been found in research studies.\n\nSome reviews did not find sufficient evidence that it was useful for either angina or heart failure. Other reviews found tentative benefit in those with angina that does not improve with medications.\n\nFor stroke due to lack of blood flow a 2012 Cochrane review found insufficient evidence to make conclusions.\n\nSignificantly improved the exercise endurance of normal adults, low endurance adults, and COPD patients.\n\nMethod\nWhile an individual is undergoing ECP, they have pneumatic cuffs on their legs and is connected to telemetry monitors that monitor heart rate and rhythm. The most common type in use involves three cuffs placed on each leg (on the calves, the lower thighs, and the upper thighs (or buttocks)). The cuffs are timed to inflate and deflate based on the individual's electrocardiogram. The cuffs should ideally inflate at the beginning of diastole and deflate at the beginning of systole. During the inflation portion of the cycle, the calf cuffs inflate first, then the lower thigh cuffs, and finally the upper thigh cuffs. Inflation is controlled by a pressure monitor, and the cuffs are inflated to about 200 mmHg.\n\nOf note, therapies are tailored on an individual basis but beginning regimens tend to include daily one-hour treatments that occur 5 days of the week and last 6–8 weeks with an average overall of 35 hours.\n\nPhysiological considerations\nOne theory is that ECP exposes the coronary circulation to increased shear stress, and that this results in the production of a cascade of growth factors that result in new blood vessel formation in the heart (arteriogenesis and angiogenesis).\n\nTo best understand the pathophysiology of the therapy it is easiest to understand what each step does. To begin with, as the cuffs on each leg inflate, starting at the calf and working up to the upper thighs, blood is propelled back to the heart thereby increasing the venous return or preload. This increase in preload occurs simultaneously with diastole which happens to be the time during the cardiac cycle in which coronary perfusion occurs. So, by increasing the coronary perfusion, you allow more oxygen to perfuse the heart and ultimately generate more collateral circulation without actually increasing the work of the heart. Additionally, cardiac output is increased via the Frank-Starling mechanism secondary to the increased venous return. As the cardiac cycle progresses to systole, the cuffs on the extremities deflate, allowing for the increased cardiac output to adequately perfuse all tissues including the extremities.\n\nReferences\n\nUSFDA Approved EECP Treatment Center | Dr. Chandandeep Sandhu, MBBS FCGP FIPM FAM PGC (Cardiology) (11 March 2022)\n\nKKM Approved EECP Treatment Centre Malaysia | Dr Wan Faizal Wan MD (Moscow), MRCP (Ireland), Interventional Cardiology Fellowship (MAL), CCDS (USA), EAPCI (Europe), PgDip Preventive Cardiovascular Medicine (NSW)\n\nCardiac procedures"
}