{
  "title": "H.E.A.R.",
  "content": "H.E.A.R. is a non-profit organization dedicated to preventing hearing loss, mainly from loud rock music. The acronym stands for Hearing Education and Awareness for Rockers.  It was founded in 1988 by rock musician Kathy Peck and physician Flash Gordon, M.D. after Kathy developed tinnitus and hearing loss after playing with the band The Contractions.\n\nThe initial funding for the organization's formation was provided by guitarist and songwriter for The Who, Pete Townshend, who also developed tinnitus as a result of loud volumes at Who concerts, and a particular incident during a live performance of My Generation, when drummer Keith Moon set off some explosives inside his drum kit right next to Townshend.\n\nMusician-producer Todd Rundgren appeared in a public service announcement for the organization.\n\nKathy Peck is a musician and was the bass player and singer for the San Francisco punk rock band The Contractions. Peck herself has hearing damage caused by years of playing loud music. She is an advocate and educator for the prevention of hearing loss, and in 1988 together with Dr. Flash Gordon founded the Hearing Educators and Awareness for Rockers (H.E.A.R.) organization, a non-profit that over the years has provided concertgoers with free earplugs and has organized prevention campaigns to educate the public. \nPeck's work is focused on educating and improving the quality of life for people with hearing loss or tinnitus. This disability can have a painful and debilitating output on the daily life of people with hearing loss. On the H.E.A.R. organization's web site you can find information about different types and features of earplugs, how to protect your hearing, levels or categories of deafness, and much more information pertaining to this topic. \nIn March 2013, the Mayor of New York City Michael Bloomberg launched a campaign for hearing protection and preservation aimed at teenagers and young adults listening to loud music on MP3 players and earbuds, Peck showed support for the campaign and made reference to the fact that hearing damage or deafness is something that can happen at a young age, a loud blast or overexposure of loud sounds and/or music are contributing factors and prevention through hearing protection is the best way to avoid permanent ear damage.\n\nReferences\n\nExternal links\nOfficial Site\n Music Life Radio Interview with Kathy Peck – June 2012\n NBC News Health News \"Turn it Up? Musicians Run Far Higher Risk of Hearing Loss\" by Jonel Aleccia, April 30, 2014\n Newsweek,\"A Little Bit Louder, Please,\" by David Noonan, 10/11/2007\n Audiology Online, \"Interview with Kathy Peck,\" 4 October 2000]\n East Bay Express, \"The Metronome Diary: H.E.A.R.ing things,\" by Chris Baty, 25 May 2001\n Prevention, \"Health Hero: Kathy Peck,\" by Katie Becker, 2007\n Kathy Peck NAMM Oral History Program Interview (2008)\nNational Association of Schools of Music (NASM) and the Performing Arts Medicine Association (PAMA) Advisories on Hearing Health.\n\nAudiology organizations\nHearing loss"
}