{
  "title": "Hemorrhagic gastroenteritis",
  "content": "Hemorrhagic gastroenteritis (HGE) is a disease of dogs characterized by sudden vomiting and bloody diarrhea.  The symptoms are usually severe, and HGE can be fatal if not treated.  HGE is most common in young adult dogs of any breed, but especially small dogs such as the Toy Poodle and Miniature Schnauzer.  It is not contagious.\n\nCause\nThe cause is uncertain.  Suspected causes include abnormal responses to bacteria or bacterial endotoxin, or a hypersensitivity to food.  Pathologically there is an increase in the permeability of the intestinal lining and a leakage of blood and proteins into the bowel.  Clostridium perfringens has been found in large numbers in the intestines of many affected dogs.\n\nClinical signs\nProfuse vomiting is usually the first symptom, followed by depression and bloody diarrhea with a foul odor.  Severe hypovolemia (low blood volume) is one of the hallmarks of the disease, and severe hemoconcentration (concentrated blood) is considered necessary for diagnosis.  The progression of HGE is so rapid that hypovolemic shock and death can occur within 24 hours.  Disseminated intravascular coagulation (DIC) is a possible sequela of HGE. As a result, this disease can cause severe damage.\n\nDiagnosis\nClinical signs of HGE and canine parvovirus (CPV) are similar enough that they need to be differentiated.  It may or may not be detected by a high or low white blood cell count, and there may be a low hematocrit.  A negative fecal parvovirus test is sometimes necessary to completely rule out CPV.  Other potential causes of vomiting and diarrhea, white foam from the mouth include gastrointestinal parasites, bacterial infections including E. coli, Campylobacter, or Salmonella, protozoal infections such as coccidiosis or giardiasis, and gastrointestinal cancer.\n\nTreatment\nThe most important aspect of treatment of HGE is intravenous fluid therapy to replace lost fluid volume.  The vomiting and diarrhea are treated symptomatically and will usually resolve after one to two days.  Antibiotics targeting C. perfringens are also used but recent studies have shown no difference in outcome or survival rate between patients given antibiotics and those not when no signs of sepsis were present. In other words, if there are no signs of sepsis, antibiotics will not hasten a recovery or improve outcome.  With prompt, aggressive treatment, the prognosis is good.  There is less than 10 percent mortality with treatment, but 10 to 15 percent of cases will recur.\n\nSee also\nGastroenteritis\n\nReferences\n  \n\nDog diseases"
}