{
  "title": "Hubert Schoemaker",
  "content": "Hubert Jacob Paul Schoemaker (March 23, 1950 – January 1, 2006) was a Dutch biotechnologist. He was a co-founder and the president of one of America's first biotechnology companies, Centocor, which was founded in 1979 for the commercialising of monoclonal antibodies.  In 1999 he founded Neuronyx, Inc., for the manufacture of stem cells and the development of stem-cell therapies.\n\nEarly life and education\nSchoemaker was born in Deventer, Netherlands. He attended St. Bernardus School in Deventer, and Canisius College, Nijmegen.  In 1969 he moved to the United States to attend the University of Notre Dame, where he majored in chemistry, graduating in May 1972. Soon after he married Ann Postorino.\n\nHe then earned a doctorate in biochemistry in 1975 from the Massachusetts Institute of Technology. Supervised by Paul Schimmel, his doctoral research was an investigation of the structure function relationships of transfer RNAs and their complexes.\n\nCareer\nAfter declining postdoctoral research positions with Stanley Cohen and Klaus Weber, Schoemaker chose to work as a research scientist in industry. \nHis choice was influenced by the severe disabilities suffered by his first daughter, Maureen, who was born with lissencephaly and needed specialised care. This inspired Schoemaker to become involved in commercial biotechnology.\n\nIn 1976 Schoemaker joined Corning Medical, a Boston-based division of Corning Glass Works. At Corning Schoemaker rapidly progressed from being a specialist in immunoassay development for diagnostics to heading research and development. Among his achievements at the company was devising effective diagnostic kit tests for thyroid disorders.\n\nIn 1979 Schoemaker became involved in the founding of Centocor together with a former Corning Medical colleague Ted Allen and the bioentrepreneur Michael Wall with whom he had some dealings while at Corning. Inspired by the work of Hilary Koprowski, who developed some of the earliest monoclonal antibodies against tumour antigens and influenza viral antigens, the objective of Centocor was to commercialise monoclonal antibodies for diagnostics and therapeutics. In 1980 Schoemaker joined Centocor and soon after became its first chief executive officer.\n\nFrom the start Centocor decided to fill its product pipeline through partnerships with research institutions and marketing alliances. Central to this policy was Schoemaker's ability to network and the company's decision to design diagnostic kits so that were compatible with existing diagnostic systems. Under Schoemaker's leadership Centocor rapidly grew into a profitable diagnostic business. By 1985 the company had revenues of approximately $50 million. In part this success was built upon the swift approval the company won for two of its tests. The first was for gastrointestinal cancer test and the other was for hepatitis B. Between 1983 and 1986 Centocor introduced three other diagnostic tests to the market: one for ovarian cancer (the first diagnostic test available for the disease), one for breast cancer and one for colorectal cancer.\n\nDespite the company's success on the diagnostic front, Schoemaker was plunged in 1992 into efforts to save the company from bankruptcy when its first therapeutic, Centoxin, a drug designed to treat septic shock, failed to win FDA approval. In part the crisis had come about as a result of the company's executives trying to go it alone in developing the drug. What saved the company was a return to the policy of collaboration. Learning from its mistakes with Centoxin, in December 1994 Centocor gained marketing approval for ReoPro, a monoclonal antibody drug for cardiovascular disease. The first therapeutic to ever receive simultaneous US and European approvals, and the second monoclonal antibody to ever win approval as a drug, ReoPro marked a milestone for both Centocor and for monoclonal antibodies therapeutics. ReoPro was to be followed in August 1998 by the approval of Centocor's Remicade, a drug to treat auto-immune disorders like Crohn's disease and rheumatoid arthritis.\n\nAfter selling Centocor to Johnson and Johnson in 1999, Schoemaker went on to form Neuronyx, Inc., a biotech company focused on developing cellular therapies. After Schoemaker died in 2006 the company was continued by his wife Anne Faulkner Schoemaker. Initial work focused on using stem cells taken from adult bone marrow to help regenerate heart tissue damaged during heart attacks. Later the company turned direction to looking at the development of a treatment for incision wounds in women following breast cancer reconstruction surgery. The company later changed its name to Garnet BioTherapeutics. Despite promising clinical results and raising more than $55 million in venture capital funding, the company was unable to continue.\n\nDeath\nSchoemaker was diagnosed in 1994 with a form of brain cancer, medulloblastoma. \nHe died on January 1, 2006, at age 55.\n\nReferences\n\nExternal links\nHubert Schoemaker on WhatisBiotechnology.org\n \n \n\n1950 births\n2006 deaths\nAmerican biochemists\n20th-century American businesspeople\nDutch businesspeople\nBiotechnologists\nAmerican immunologists\nPeople from Deventer\nDutch emigrants to the United States\nMassachusetts Institute of Technology School of Science alumni\nUniversity of Notre Dame alumni\nDeaths from brain cancer in the United States\nDeaths from cancer in Pennsylvania\nDutch immunologists"
}