{
  "title": "Sickness bag",
  "content": "A sickness bag (also known as a sick sack, airsick bag, airsickness bag, emesis bag, sick bag, barf bag, vomit bag, disposal bag, waste bag, doggie bag or motion sickness bag) is a small bag commonly provided to passengers on board airplanes and boats to collect and contain vomit in the event of motion sickness.\n\nHistory \nThe plastic-lined airsickness bag was created by inventor Gilmore Schjeldahl for Northwest Orient Airlines in 1949. Previously bags had been made from waxed paper or card. Modern bags are still mainly made from plastic-lined paper, but a significant proportion are now made completely from plastic.\n\nCollecting \nAmong the collectors of aeronautical memorabilia there is a sub-culture of sickness-bag aficionados. The Guinness Book of Records recognizes Dutchman Niek Vermeulen as the world record holder for the number of different bags (6016 as of 29 January 2010).\n\nIn 2004, Virgin Atlantic issued a limited edition set of half a million bags in collaboration with designer Oz Dean of 'forcefeed:swede'. Oz had conceived and run an online gallery of sick bags since 2000 under the project name \"Design for Chunks\". It challenged designers to illustrate the usually dull medium of the sick bag, as opposed to T-shirts or splash pages which were the standard challenges at the time.\n\nAlthough the project achieved cult status in a short time amongst the design community, Dean felt that it had run its course and closed it down in 2003. With the offer of doing the project for real (from Virgin Atlantic) \"DFC\" was opened up again, in 2004, with the strapline \"This time it's real!\" The printed bags were intended to be on the global fleet of planes for 6 months but only lasted 3, with people walking through the aisles collecting the sets. The project divided opinion. The whole set of 20 finalists designs as a framed piece can be found in the Virgin Atlantic Clubhouse at Heathrow, UK or online at the archived website.\n\nVirgin Atlantic released another four bags promoting the Star Wars movie Star Wars: Episode III – Revenge of the Sith shortly after the \"Design for Chunks\" project.\n\nSteven J. Silberberg is also a collector of air sickness bags; his collection, the Air Sickness Bag Virtual Museum, holds 2297 bags.\n\nThe Imperial War Museum in London has a sea sickness bag issued to D-Day landing troops in its collections.\n\nAlternative uses \nThe development of larger aircraft and advances in design have reduced the occurrence of air sickness. This has led to bags being given a secondary use as general purpose waterproof waste containers which is often reflected in the labeling of the bag and instructional diagrams. Another common use is that of a photographic mailing envelope (especially Australia). Airlines have also printed bags to serve as card game scoresheets and Continental Airlines once suggested that they be used as doggy bags for airline food. Non-airline aircrew have occasionally used these bags as improvised urinals or fecal collection devices aboard aircraft lacking on-board toilets. A specialized urine collection bag known colloquially as the \"piddle pack\" developed as an improvement from this practice. In 2010, Spirit Airlines began selling advertising space on its air sickness bags.\n\nSome airlines have used humor in their designs. For a short time, Hapag-Lloyd Express (now TUI fly Deutschland) had bags that stated \"Thank you for your criticism!\". The defunct ATA Airlines used airsickness bags that had \"Occupied\" on them. Delta Air Lines has \"Feel Better?\" printed on the bag. NIKI Airlines uses sickbags with the legend Speibsackerl on them; this translates to \"puke bag\".\n\nAs some amusement rides can also cause vomitting the availability of sickness bags at amusement parks or funfairs like Oktoberfest may be sensitive, but is not practicised.\n\nSee also\nAircraft safety card\nInflight magazine\n\nReferences\n\nExternal links \n\nIn-flight passenger facilities\nBags\nEphemera\nbag"
}