{
  "title": "Alexander Kerensky",
  "content": "Alexander Fyodorovich Kerensky ( – 11 June 1970) was a Russian lawyer and revolutionary who led the Russian Provisional Government and the short-lived Russian Republic for three months from late July to early November 1917.\n\nAfter the February Revolution of 1917, he joined the newly formed provisional government, first as Minister of Justice, then as Minister of War, and after July as the government's second Minister-Chairman. He was the leader of the social-democratic Trudovik faction of the Socialist Revolutionary Party. Kerensky was also a vice-chairman of the Petrograd Soviet, a position that held a sizable amount of power. Kerensky became the prime minister of the Provisional Government, and his tenure was consumed with World War I. Despite mass opposition to the war, Kerensky chose to continue Russia's participation. His government cracked down on anti-war sentiment and dissent in 1917, which made his administration even more unpopular.\n\nKerensky remained in power until the October Revolution. This revolution saw the Bolsheviks create a Leninist government, led by Vladimir Lenin, to replace his government. Kerensky fled Russia and lived the remainder of his life in exile. He divided his time between Paris and New York City. Kerensky worked for the Hoover Institution at Stanford University.\n\nBiography\n\nEarly life and activism \nAlexander Kerensky was born in Simbirsk (now Ulyanovsk) on the Volga river on 4 May 1881 and was the eldest son in the family. His father, Fyodor Mikhailovich Kerensky, was a teacher and director of the local gymnasium and was later promoted to be an inspector of public schools. His paternal grandfather Mikhail Ivanovich served as a priest in the village of Kerenka in the Gorodishchensky district of the Penza Governorate from 1830. The surname Kerensky comes from the name of this village. His maternal grandfather was head of the Topographical Bureau of the Kazan Military District. His mother, Nadezhda Aleksandrovna (née Adler), was the granddaughter of a former serf who had managed to purchase his freedom before serfdom was abolished in 1861. He subsequently embarked upon a mercantile career, in which he prospered. This allowed him to move his business to Moscow, where he continued his success and became a wealthy Moscow merchant.\n\nMembers of the Kerensky and Ulyanov families were friends; Kerensky's father was the teacher of Vladimir Ulyanov (Lenin) and had even secured him acceptance into the University of Kazan.  In 1889, when Kerensky was eight, the family moved to Tashkent, where his father had been appointed the main inspector of public schools (superintendent). Alexander graduated with honours in 1899. The same year he entered St. Petersburg University, where he studied history and philology. The next year he switched to law. He earned his law degree in 1904 and married Olga Lvovna Baranovskaya, the daughter of a Russian general, the same year. Kerensky joined the Narodnik movement and worked as a legal counsel to victims of the Revolution of 1905. At the end of 1904, he was jailed on suspicion of belonging to a militant group. Afterwards, he gained a reputation for his work as a defence lawyer in a number of political trials of revolutionaries.\n\nIn 1912, Kerensky became widely known when he visited the goldfields at the Lena River and published material about the Lena massacre. In the same year, Kerensky was elected to the Fourth Duma as a member of the Trudoviks, a socialist, non-Marxist labour party founded by Alexis Aladin that was associated with the Socialist-Revolutionary Party, and joined a Freemason society uniting the anti-monarchy forces that strived for democratic renewal of Russia. In fact, the Socialist Revolutionary Party bought Kerensky a house, as he otherwise would not be eligible for election to the Duma, according to the Russian property-laws. He soon became a significant member of the Progressive Bloc, which included several socialist parties, Mensheviks, and Liberals – but not Bolsheviks. He was a brilliant orator and skilled parliamentary leader of the socialist opposition to the government of Tsar Nicholas II.\n\nDuring the 4th Session of the Fourth Duma in spring 1915, Kerensky appealed to Mikhail Rodzianko with a request from the Council of elders to inform the tsar that to succeed in the war he must:\n1) change his domestic policy,\n2) proclaim a General Amnesty for political prisoners,\n3) restore the Constitution of Finland,\n4) declare autonomy of Poland,\n5) provide national minorities autonomy in the field of culture,\n6) abolish restrictions against Jews,\n7) end religious intolerance,\n8) stop the harassment of legal trade union organizations.\n\nKerensky was an active member of the irregular Freemasonic lodge, the Grand Orient of Russia's Peoples, which derived from the Grand Orient of France. Kerensky was Secretary-General of the Grand Orient of Russia's Peoples and stood down following his ascent to the government in July 1917. He was succeeded by a Menshevik, Alexander Halpern.\n\nRasputin \nIn response to bitter resentments held against the imperial favourite Grigori Rasputin in the midst of Russia's failing effort in World War I, Kerensky, at the opening of the Duma on 2 November 1916, called the imperial ministers \"hired assassins\" and \"cowards\", and alleged that they were \"guided by the contemptible Grishka Rasputin!\" Grand Duke Nicholas Mikhailovich, Prince Georgy Lvov, and General Mikhail Alekseyev attempted to persuade the Emperor Nicholas II to send away the Empress Alexandra Feodorovna, Rasputin's steadfast patron, either to the Livadia Palace in Yalta or to Britain. Mikhail Rodzianko, Zinaida Yusupova (the mother of Felix Yusupov), Alexandra's sister Elisabeth, Grand Duchess Victoria and the empress's mother-in-law Maria Feodorovna also tried to influence and pressure the imperial couple to remove Rasputin from his position of influence within the imperial household, but without success. According to Kerensky, Rasputin had terrorised the empress by threatening to return to his native village.\n\nMembers of the nobility murdered Rasputin in December 1916, and he was buried near the imperial residence in Tsarskoye Selo. Shortly after the February Revolution of 1917, Kerensky ordered soldiers to re-bury the corpse at an unmarked spot in the countryside. However, the truck broke down or was forced to stop because of the snow on Lesnoe Road outside of St. Petersburg. It is likely the corpse was incinerated (between 3 and 7 in the morning) in the cauldrons of the nearby boiler shop of the Saint Petersburg State Polytechnical University, including the coffin, without leaving a single trace.\n\nRussian Provisional Government of 1917 \n\nWhen the February Revolution broke out in 1917, Kerensky – together with Pavel Milyukov – was one of its most prominent leaders. As one of the Duma's most well-known speakers against the monarchy and as a lawyer and defender of many revolutionaries, Kerensky became a member of the Provisional Committee of the State Duma and was elected vice-chairman of the newly formed Petrograd Soviet. These two bodies, the Duma and the Petrograd Soviet, or – rather – their respective executive committees, soon became each other's antagonists on most matters except regarding the end of the tsar's autocracy.\n\nThe Petrograd Soviet grew to include 3000 to 4000 members, and their meetings could drown in a blur of everlasting orations. At the meeting of  to  the Executive Committee of the Petrograd Soviet, or Ispolkom, formed a self-appointed committee, with (eventually) three members from each of the parties represented in the Soviet. Kerensky became one of the members representing the Socialist Revolutionary Party (the SRs).\n\nOn , without any consultation with the government, the Ispolkom of the Soviet issued the infamous Order No. 1, intended only for the 160,000-strong Petrograd garrison, but soon interpreted as applicable to all soldiers at the front. The order stipulated that all military units should form committees like the Petrograd Soviet. This led to confusion and \"stripping of officers' authority\"; further, \"Order No. 3\" stipulated that the military was subordinate to Ispolkom in the political hierarchy. The ideas came from a group of socialists and aimed to limit the officers' power to military affairs. The socialist intellectuals believed the officers to be the most likely counterrevolutionary elements. Kerensky's role in these orders is unclear, but he participated in the decisions. But just as before the revolution he had defended many who disliked the tsar, he now saved the lives of many of the tsar's civil servants about to be lynched by mobs.\n\nAdditionally, the Duma formed an executive committee which eventually became the Russian Provisional Government. As there was little trust between Ispolkom and this government (and as he was about to accept the office of Attorney General in the Provisional Government), Kerensky gave a most passionate speech, not just to the Ispolkom, but to the entire Petrograd Soviet. He then swore, as minister, never to violate democratic values, and ended his speech with the words \"I cannot live without the people. In the moment you begin to doubt me, then kill me.\" The huge majority (workers and soldiers) gave him great applause, and Kerensky now became the first and the only one who participated in both the Provisional Government and the Ispolkom. As a link between Ispolkom and the Provisional Government, the quite ambitious Kerensky stood to benefit from this position.\n \nAfter the first government crisis over Pavel Milyukov's secret note re-committing Russia to its original war-aims on 2–4 May, Kerensky became the Minister of War and the dominant figure in the newly formed socialist-liberal coalition government. On 10 May (Julian calendar), Kerensky started for the front and visited one division after another, urging the men to do their duty. His speeches were impressive and convincing for the moment, but had little lasting effect. Under Allied pressure to continue the war, he launched what became known as the Kerensky Offensive against the Austro-Hungarian/German South Army on . At first successful, the offensive soon met strong resistance and the Central Powers riposted with a strong counter-attack. The Russian army retreated and suffered heavy losses, and it became clear from many incidents of desertion, sabotage, and mutiny that the army was no longer willing to attack.\n\nThe military heavily criticised Kerensky for his liberal policies, which included stripping officers of their mandates and handing over control to revolutionary-inclined \"soldier committees\" () instead; abolition of the death penalty; and allowing revolutionary agitators to be present at the front. Many officers jokingly referred to commander-in-chief Kerensky as the \"persuader-in-chief\".\n\nOn 2 July 1917 the Provisional Government's first coalition collapsed over the question of Ukraine's autonomy. Following the July Days unrest in Petrograd (3–7 July [16–20 July, N.S.] 1917) and the official suppression of the Bolsheviks, Kerensky succeeded Prince Georgy Lvov as Russia's prime minister on . Following the Kornilov Affair, an attempted military coup d'état at the end of August, and the resignation of the other ministers, he appointed himself Supreme Commander-in-Chief, as well.\n\nOn 15 September Kerensky proclaimed Russia a republic, which was contrary to the non-socialists' understanding that the Provisional Government should hold power only until a Constituent Assembly should meet to decide Russia's form of government, but which was in line with the long-proclaimed aim of the Socialist Revolutionary Party. He formed a five-member Directory, which consisted of himself, Minister of Foreign Affairs Mikhail Tereshchenko, Minister of War General Aleksandr Verkhovsky, Minister of the Navy Admiral Dmitry Verderevsky and Minister of Posts and Telegraphs . He retained his post in the final coalition government in October 1917 until the Bolsheviks overthrew it on .\n\nKerensky faced a major challenge: three years of participation in World War had exhausted Russia, while the provisional government offered little motivation for a victory outside of continuing Russia's obligations towards its allies. Russia's continued involvement in the war was not popular among the lower and middle classes, and especially not popular among the soldiers. They had all believed that Russia would stop fighting when the Provisional Government took power, and subsequently felt deceived. Furthermore, Vladimir Lenin and his Bolshevik party were promising \"peace, land, and bread\" under a communist system. The Russian army, war-weary, ill-equipped, dispirited and ill-disciplined, was disintegrating, with soldiers deserting in large numbers. By autumn 1917, an estimated two million men had unofficially left the army.\n\nKerensky and other political leaders continued Russia's involvement in World War I, thinking that a glorious victory was the only road forward, and fearing that the economy, already under huge stress from the war effort, might become increasingly unstable if vital supplies from France and from the United Kingdom ceased flowing. The dilemma of whether to withdraw was a great one, and Kerensky's inconsistent and impractical policies further destabilised the army and the country at large.\n\nFurthermore, Kerensky adopted a policy that isolated the right-wing conservatives, both democratic and monarchist-oriented. His philosophy of \"no enemies to the left\" greatly empowered the Bolsheviks and gave them a free hand, allowing them to take over the military arm or \"voyenka\" () of the Petrograd and Moscow Soviets. His arrest of Lavr Kornilov and other officers left him without strong allies against the Bolsheviks, who ended up being Kerensky's strongest and most determined adversaries, as opposed to the right wing, which evolved into the White movement.\n\nOctober Revolution of 1917 \n\nDuring the Kornilov Affair, Kerensky had distributed arms to the Petrograd workers, and by November most of these armed workers had gone over to the Bolsheviks. On  1917, the Bolsheviks launched the second Russian revolution of the year. Kerensky's government in Petrograd had almost no support in the city. Only one small force, a subdivision of the 2nd company of the First Petrograd Women's Battalion, also known as The Women's Death Battalion, was willing to fight for the government against the Bolsheviks, but this force was overwhelmed by the numerically superior pro-Bolshevik forces, defeated, and captured. The Bolsheviks overthrew the government rapidly by seizing governmental buildings and the Winter Palace.\n\nKerensky escaped the Bolsheviks and fled to Pskov, where he rallied some loyal troops for an attempt to re-take the city. His troops managed to capture Tsarskoye Selo but were beaten the next day at Pulkovo. Kerensky narrowly escaped, and he spent the next few weeks in hiding before fleeing the country, eventually arriving in France. During the Russian Civil War, he supported neither side, as he opposed both the Bolshevik regime and the White Movement.\n\nPersonal life \n\nKerensky was married to Olga Lvovna Baranovskaya and they had two sons, Oleg (1905–1984) and Gleb (1907–1990), who both went on to become engineers. Kerensky's grandson (also named Oleg), according to the Internet Movie Database, played his grandfather's role in the 1981 film Reds. Kerensky and Olga were divorced in 1939 soon after he settled in Paris, and, in 1939, while visiting the United States he met and married Lydia Ellen \"Nell\" Tritton (1899–1946), the Australian former journalist who had become his press secretary and translator. The marriage took place in Martins Creek, Pennsylvania.\n\nWhen Germany invaded France in 1940, they emigrated to the United States. After the Axis invasion of the Soviet Union in 1941, Kerensky offered his support to Joseph Stalin. \n\nWhen his wife Nell became terminally ill in 1945, Kerensky travelled with her to Brisbane, Australia, and lived there with her family. She suffered a stroke in February 1946, and he remained there until her death on 10 April 1946. Kerensky then returned to the United States, where he spent the rest of his life.\n\nKerensky eventually settled in New York City, living on the Upper East Side on 91st Street near Central Park but spent much of his time at the Hoover Institution at Stanford University in California, where he both used and contributed to the Institution's huge archive on Russian history, and where he taught graduate courses. He wrote and broadcast extensively on Russian politics and history. His last public lecture was delivered at Kalamazoo College in Kalamazoo, Michigan, in October 1967.\n\nDeath \n\nKerensky died of arteriosclerotic heart disease at St. Luke's Hospital in New York City on 11 June 1970 after being initially admitted from injuries sustained in a fall. At 89, he was one of the last surviving major participants in the turbulent events of 1917. The local Russian Orthodox Churches in New York City refused to grant Kerensky burial rites because of his association with Freemasonry, and because they saw him as largely responsible for the Bolsheviks seizing power. A Serbian Orthodox Church also refused burial rites. Kerensky's body was flown to London, where he was buried at the non-denominational Putney Vale Cemetery.\n\nWorks\n The Prelude to Bolshevism (1919). .\n The Catastrophe (1927)\n The Crucifixion of Liberty (1934)\n Russia and History's Turning Point (1965)\n Memoirs (1966)\n\nArchives \nPapers of the Kerensky family are held at the Cadbury Research Library, University of Birmingham.\n\nSee also\n Jailbirds of Kerensky\n\nExplanatory notes\n\nReferences\n\nFurther reading \n \n Lipatova, Nadezhda V. \"On the Verge of the Collapse of Empire: Images of Alexander Kerensky and Mikhail Gorbachev.\" Europe-Asia Studies 65.2 (2013): 264–289.\n Thatcher, Ian D. \"Post-Soviet Russian Historians and the Russian Provisional Government of 1917.\" Slavonic & East European Review 93.2 (2015): 315–337. online\n Thatcher, Ian D. \"Memoirs of the Russian Provisional Government 1917\" . Revolutionary Russia 27.1 (2014): 1–21. .\n\nExternal links \n\n \nAlexander Kerensky Archive at marxists.org\nAn account of Kerensky at Stanford in the 1950s\n\n \n\n1881 births\n1970 deaths\nPeople from Ulyanovsk\nPeople from Simbirsky Uyezd\nSocialist Revolutionary Party politicians\nTrudoviks\nHeads of government of the Russian Provisional Government\nJustice ministers of Russia\nDefence ministers of Russia\nDemocratic socialists\nMembers of the 4th State Duma of the Russian Empire\nMembers of the Grand Orient of Russia's Peoples\nRussian Constituent Assembly members\nCommanders-in-chief of the Russian Army\nPeople of the Russian Revolution\n20th-century presidents of Russia\nRussian anti-communists\nRussian democracy activists\nRussian nationalists\nRussian people of World War I\nRussian revolutionaries\nRussian socialists\nLeaders ousted by a coup\nWhite Russian emigrants to France\nWhite Russian emigrants to Australia\nWhite Russian emigrants to the United States\nStanford University faculty\nHoover Institution people\nBurials at Putney Vale Cemetery\nLawyers from the Russian Empire"
}