{
  "title": "Andrea Alciato",
  "content": "Andrea Alciato (8 May 149212 January 1550), commonly known as Alciati (Andreas Alciatus), was an Italian jurist and writer.  He is regarded as the founder of the French school of legal humanists.\n\nBiography\n\nAlciati was born in Alzate Brianza, near Milan, and settled in France in the early 16th century. He displayed great literary skill in his exposition of the laws, and was one of the first to interpret the civil law by the history, languages and literature of antiquity, and to substitute original research for the servile interpretations of the glossators. He published many legal works, and some annotations on Tacitus and accumulated a sylloge of Roman inscriptions from Milan and its territories, as part of his preparation for his history of Milan, written in 1504–05.\n\nAmong his several appointments, Alciati taught Law at the University of Bourges between 1529 and 1535. It was Guillaume Budé who encouraged the call to Bourges at the time. Pierre Bayle, in his General Dictionary (article \"Alciat\"), relates that he greatly increased his salary there, by the \"stratagem\" of arranging to get a job offer from the University of Bologna and using it as a negotiation point .\n\nAlciati is most famous for his Emblemata, published in dozens of editions from 1531 onward. This collection of short Latin verse texts and accompanying woodcuts created an entire European genre, the emblem book, which attained enormous popularity in continental Europe and Great Britain.\n\nAlciati died at Pavia in 1550.\n\nWorks\n\n Annotationes in tres libros Codicis (1515)\n Emblematum libellus (1531)\n \n Opera omnia (Basel 1546–49)\n Rerum Patriae, seu Historiae Mediolanensis, Libri IV (Milan, 1625) a history of Milan, written in 1504–05.\n De formula Romani Imperii (Basilae: Ioannem Oporinum, 1559, editio princeps)\n\nQuotation\n\nReferences\n\nExternal links\n\n \nAlciato at Glasgow – Reproductions of 22 editions of Alciato's emblems from 1531 to 1621\nDescription, Reproduction and translation Memorial University of Newfoundland\nEmblemata Latin text, Antwerp 1577, full digital facsimile, CAMENA Project\n\n1492 births\n1550 deaths\n16th-century Italian jurists\n16th-century writers in Latin\n16th-century Italian historians\nItalian Renaissance humanists\nPeople from the Province of Como"
}