{
  "title": "Arbitration in the United States",
  "content": "Arbitration, in the context of the law of the United States, is a form of alternative dispute resolution. Specifically, arbitration is an alternative to litigation through which the parties to a dispute agree to submit their respective evidence and legal arguments to a neutral third party (the arbitrator(s) or arbiter(s)) for resolution. In practice arbitration is generally used as a substitute for litigation, particularly when the judicial process is perceived as too slow, expensive or biased. In some contexts, an arbitrator may be described as an umpire.\n\nArbitration in the United States' most overarching clause is the Federal Arbitration Act (officially the United States Arbitration Act of 1925, commonly referred to as the FAA). The Act stipulates that arbitration in a majority of instances is legal when both parties, either after or prior to the arising of a dispute, agree to the arbitration. The Supreme Court has taken a pro-arbitration stance across most but not all cases, although the federal government, most recently in 2022, has passed certain exemptions to arbitration agreements. States are also generally prohibited from passing their own laws which the Supreme Court and other federal courts believe limit or discriminate against arbitration. \n\nThe practice of arbitration, especially \"forced\" arbitration clauses between workers/consumers and large companies or organizations, has been gaining a growing amount of scrutiny from both the general public and trial lawyers. Arbitration clauses face various challenges to enforcement, and clauses are unenforceable in the United States when a dispute which falls under the scope of an arbitration clause pertains to sexual harassment or assault.\n\nHistory\nAgreements to arbitrate were not enforceable at common law. This rule has been traced back to dictum by Lord Coke in Vynor’s Case, 8 Co. Rep. 81b, 77 Eng. Rep. 597 (1609), that agreements to arbitrate were revocable by either party.\n\nDuring the Industrial Revolution, merchants became increasingly opposed to this rule. They argued that too many valuable business relationships were being destroyed through years of expensive adversarial litigation, in courts whose rules differed significantly from the informal norms and conventions of businesspeople. Arbitration was promoted as being faster, less adversarial, and cheaper.\n\nThe result was the New York Arbitration Act of 1920, followed by the United States Arbitration Act of 1925 (now known as the Federal Arbitration Act). Both made agreements to arbitrate valid and enforceable (unless one party could show fraud or unconscionability or some other ground for rescission which undermined the validity of the entire contract). Due to the subsequent judicial expansion of the meaning of interstate commerce, the Supreme Court reinterpreted the FAA in a series of cases in the 1980s and 1990s to cover almost the full scope of interstate commerce. In the process, the Court held that the FAA preempted many state laws covering arbitration, some of which had been passed by state legislatures to protect their workers and consumers against powerful business interests. Starting in 1991 with the Gilmer decision arbitration expanded dramatically in the employment context, growing from 2.1 percent of employees subject to mandatory arbitration clauses in 1992 to 53.9% in 2017.\n\nTypes of Arbitration\n\nCommercial and other forms of contract arbitration\n\nSince commercial arbitration is based upon either contract law or the law of treaties, the agreement between the parties to submit their dispute to arbitration is a legally binding contract. All arbitral decisions are considered to be \"final and binding\". This does not, however, void the requirements of law. Any dispute not excluded from arbitration by virtue of law (for example, criminal proceedings) may be submitted to arbitration.\n\nFurthermore, arbitration agreements can only bind parties who have agreed, expressly or impliedly, to arbitrate, and parties cannot be required to submit to an arbitration process if they have not previously \"agreed so to submit\". It is only through the advance agreement of the parties that the arbitrator derives [any] authority to resolve disputes. Arbitration cannot bind non-signatories to an arbitration contract, even if those non-signatories later become involved with a signatory to a contract by accident (usually through the commission of a tort). However, third-party non-signatories can be bound by arbitration agreements based on theories of estoppel, agency relationships with a party, assumption of the contract containing the arbitration agreement, third-party beneficiary status under the contract, or piercing the corporate veil.\n\nThe question of whether two parties have actually agreed to arbitrate any disputes is one for judicial determination, because if the parties have not agreed to arbitrate then the arbitrator would have no authority. Where there is an arbitration agreement, doubts concerning \"the scope of arbitrable issues should be resolved in favor of arbitration\", but issues regarding whether a claim falls within the scope of arbitrable issues is a judicial matter, unless the parties have expressly agreed that the arbitrator may decide the scope of his or her own authority. Most courts hold that general arbitration clauses, such as an agreement to refer to arbitration any dispute \"arising from\" or \"related to\" a particular contract, do not authorize an arbitrator to determine whether a particular issue arises from or relates to the contract concerned. A minority view embraced by some courts is that this broad language can evidence the parties' clear and unmistakable intention to delegate the resolution of all issues to the arbitrator, including issues regarding arbitrability.\n\nLabor arbitration\nArbitration may be used as a means of resolving labor disputes, an alternative to strikes and lockouts. Labor arbitration comes in two varieties:\ninterest arbitration, which provides a method for resolving disputes about the terms to be included in a new contract when the parties are unable to agree, and\ngrievance arbitration, which provides a method for resolving disputes over the interpretation and application of a collective bargaining agreement.\n\nArbitration has also been used as a means of resolving labor disputes for more than a century. Labor organizations in the United States, such as the National Labor Union, called for arbitration as early as 1866 as an alternative to strikes to resolve disputes over the wages, benefits and other rights that workers would enjoy.\n\nInterest arbitration\nGovernments have relied on arbitration to resolve particularly large labor disputes, such as the Coal Strike of 1902. This type of arbitration, wherein a neutral arbitrator decides the terms of the collective bargaining agreement, is commonly known as interest arbitration. The United Steelworkers of America adopted an elaborate form of interest arbitration, known as the Experimental Negotiating Agreement, in the 1970s as a means of avoiding the long and costly strikes that had made the industry vulnerable to foreign competition. Major League Baseball uses a variant of interest arbitration, in which an arbitrator chooses between the two sides' final offers, to set the terms for contracts for players who are not eligible for free agency. Interest arbitration is now most frequently used by public employees who have no right to strike (for example, law enforcement and firefighters).\n\nGrievance arbitration\nUnions and employers have also employed arbitration to resolve employee and union grievances arising under a collective bargaining agreement. The Amalgamated Clothing Workers of America made arbitration a central element of the Protocol of Peace it negotiated with garment manufacturers in the second decade of the twentieth century. Grievance arbitration became even more popular during World War II, when most unions had adopted a no-strike pledge. The War Labor Board, which attempted to mediate disputes over contract terms, pressed for inclusion of grievance arbitration in collective bargaining agreements. The Supreme Court subsequently made labor arbitration a key aspect of federal labor policy in three cases which came to be known as the Steelworkers' Trilogy. The Court held that grievance arbitration was a preferred dispute resolution technique and that courts could not overturn arbitrators' awards unless the award does not draw its essence from the collective bargaining agreement. State and federal statutes may allow vacating an award on narrow grounds (e.g., fraud). These protections for arbitrator awards are premised on the union-management system, which provides both parties with due process. Due process in this context means that both parties have experienced representation throughout the process, and that the arbitrators practice only as neutrals. See National Academy of Arbitrators.\n\nSecurities arbitration\nIn the United States securities industry, arbitration has long been the preferred method of resolving disputes between brokerage firms, and between firms and their customers. The arbitration process operates under its own rules, as defined by contract. Securities arbitrations are held primarily by the Financial Industry Regulatory Authority.\n\nThe securities industry uses pre-dispute arbitration agreements, through which the parties agree to arbitrate their disputes before any such dispute arises. Those agreements were upheld by the United States Supreme Court in Shearson v. MacMahon, 482 U.S. 220 (1987) and today nearly all disputes involving brokerage firms, other than Securities class action claims, are resolved in arbitration.\n\nThe SEC has come under fire from members of the Senate Judiciary Committee for not fulfilling statutory duty to protect individual investors, because all brokers require arbitration, and arbitration does not provide a court-supervised discovery process, require arbitrators to follow rules of evidence or result in written opinions establishing precedence, or case law, or provide the efficiency gains it once did. Arbitrator selection bias, hidden conflicts of interest, and a case where an arbitration panel refused to follow instructions handed down from a judge, were also raised as issues.\n\nJudicial arbitration\nSome state court systems have promulgated court-ordered arbitration; family law (particularly child custody) is the most prominent example. Judicial arbitration is often merely advisory dispute resolution technique, serving as the first step toward resolution, but not binding either side and allowing for trial de novo. Litigation attorneys present their side of the case to an independent tertiary lawyer, who issues an opinion on settlement. Should the parties in question decide to continue to dispute resolution process, there can be some sanctions imposed from the initial arbitration per terms of the contract.\n\nArbitration clauses\n\nThe federal government has expressed a policy in support of arbitration clauses, because they reduce the burden on court systems to resolve disputes. This support is found in the Federal Arbitration Act, (FAA) which permits compulsory and binding arbitration, under which parties give up the right to appeal an arbitrator's decision to a court. In Prima Paint Corp. v. Flood & Conklin Mfg. Co., the U.S. Supreme Court established the \"separability principle\", under which enforceability of a contract must be challenged in arbitration before any court action, unless the arbitration clause itself has been challenged. Today, mandatory arbitration clauses are widespread in the United States, including by 15 of the largest 20 U.S. credit card issuers, 7 of the 8 largest cell phone companies, and 2 out of 3 major bike sharing companies in Seattle. Arbitration clauses can be enforceable if \"signed\" electronically, though California courts have stated that a handwritten signature to an arbitration agreement is easier to enforce than one done electronically.\n\nThe FAA has also been interpreted to preempt and invalidate state laws which prevent or discriminate against the enforcement of arbitration agreements. In one such case in 2023, which overruled California Assembly Bill 51, the Ninth Circuit Court of Appeals found that California's bill placed restrictions on the \"broad national policy\" favoring arbitration agreements. Similar fates have been bestowed upon legislation in New Jersey, New York, and Washington state which attempted to reduce the scope of arbitration clauses. \n\nIn insurance law, arbitration is complicated by the fact that insurance is regulated at the state level under the McCarran–Ferguson Act. From a federal perspective, however, a circuit court ruling has determined that McCarran-Ferguson requires a state statute rather than administrative interpretations. The Missouri Department of Insurance attempted to block a binding arbitration agreement under its state authority, but since this action was based only on a policy of the department and not on a state statute, the United States district court found that the Department of Insurance did not have the authority to invalidate the arbitration agreement.\n\nIn AT&T Mobility v. Concepcion (2011), the Supreme Court upheld an arbitration clause in a consumer standard form contract which waived the right to a lawsuit and class action. However, this clause was relatively generous in that the business paid all fees unless the action was determined to be frivolous and a small-claims court action remained available; these types of protections are recommended for the contract to remain enforceable and not unconscionable.\n\nThe Supreme Court has also ruled that questions on whether an arbitration clause should be enforced at all permits litigation involving the rest of the case to be stayed. In 2023's Coinbase v. Bielski, the court ruled that federal district courts must stay proceedings involving a case during an arbitration appeal on such case.\n\nArbitration clauses can also be written in a manner which excludes certain disputes from being required to be sent to arbitration. Motions to compel arbitration involving excluded disputes then on would not be honored, as seen in a 2023 ruling made by the Ninth Circuit via one of its judicial panels. In such ruling, the casino firm Saipan included an arbitration agreement which exempted licensing claims from being subject to mandatory arbitration.\n\nOpt out provisions \nSome arbitration clauses in the United States offer opportunities for parties to opt out of the arbitration agreement and not be subject to it. Many companies utilize opt out clauses within their arbitration agreements, most often giving 30 or 60 days for consumers in contracts between consumers and companies to either send a rejection notice by mail or by email.\n\nIncluding an opt out provision has been found to improve the likelihood of a contract to be found conscionable. In Hopkins v. World Acceptance Corp, a case cited in Ferrara v. Luxottica, failure to opt out of an arbitration agreement dilutes the ability to combat a motion to compel arbitration.\n\nMany credit card companies which have arbitration agreements allow card signers to opt out, although company procedures may make it difficult for consumers to exercise that option.\n\nProhibitions on arbitration\n\nChallenges to clause enforcement\n\nDetermination of validity \nAlthough properly drafted arbitration clauses are generally valid, they are subject to challenge in court for compliance with laws and public policy. Arbitration clauses may potentially be challenged as unconscionable and, therefore, unenforceable. Typically, the validity of an arbitration clause is decided by a court rather than an arbitrator. However, if the validity of the entire arbitration agreement is in dispute, then the issue is decided by the arbitrators in the first instance. This is known as the principle of separability. For example, in Rent-A-Center, West, Inc. v. Jackson, the Supreme Court of the United States held that \"under the FAA, where an agreement to arbitrate includes an agreement that the arbitrator will determine the enforceability of the agreement, if a party challenges specifically the enforceability of that particular agreement, the district court considers the challenge, but if a party challenges the enforceability of the agreement as a whole, the challenge is for the arbitrator.\"\n\nIn other words, the law typically allows federal courts to decide these types of \"gateway\" or validity questions, but the Supreme Court ruled that since Jackson targeted the entire contract rather than a specific clause, the arbitrator decided the validity. Public Citizen, an advocacy organization opposed to the enforcement of pre-dispute arbitration agreements, characterized the decision negatively: \"the court said that companies can write their contracts so that the companies' own arbitrator decides whether it's fair to submit a case to that arbitrator.\"\n\nArbitration clauses must also further provide a clear procedure, and confusion and/or ambiguity in an arbitration clause can also cause such clause to be struck down. One example of this phenomenon occurred in a lawsuit against SoLo Funds, where a Philadelphia federal judge ruled that because the app did not make clear its arbitration requirements, the clause was unconscionable and SoLo's bid to compel arbitration was not granted. Ambiguity-related nullifications of arbitration agreements further extend to proof of agreement between the parties, as in Romano v. BCBSM, Blue Cross Blue Shield of Michigan failed to compel arbitration against a former employee in June 2023 after US district judge George Caram Steeh III ruled that the online application process failed to adequately provide the employee notice of the arbitration agreement he would otherwise be bound to.\n\nModification of the arbitration clause \nA significant challenge to arbitrate agreements arose out of South Carolina through the case Hooters v. Phillips. In the 1999 case, a federal district court found that Hooters modified its dispute resolution rules in 1996 to be unfair enough that the court held that the agreement was unconscionable, partly due to Hooters requiring that all of the arbitrators in dispute resolution cases be selected from a list pre-approved by the company, which included Hooters managers. In April of 2022, the Court of Appeals for the Fourth Circuit found that in Coady v. Nationwide Motor Sales, because Nationwide Motor Sales' contract enabled them to be the sole party permitted to modify the contract that Coady signed. Citing Hooters v. Phillips, the court expressed when an employer has the ability “in whole or in part” to modify the arbitration provision without notice to its employees. California's Court of Appeal reached a similar conclusion in Peleg v. Neiman Marcus, in which a unilateral modification to an arbitration agreement invalidated the clause.\n\nAnother instance of modified arbitration clauses causing it to be overturned was found in a privacy-related dispute between Amazon and its drivers who work under the company's Amazon Flex service. Amazon Flex drivers, who filed a class action lawsuit claiming that the company spied on private Facebook conversations, alleged that the updated 2019 terms related to Amazon Flex were not delivered properly to them, and that the 2016 terms, which did not include an arbitration clause, should apply. Ultimately, the Ninth Circuit decided that since Amazon was the party compelling arbitration, the burden of proof was on Amazon to prove that its flex drivers received notice of the 2019 updated terms, and that arbitration should not be compelled.\n\nWaiving the right to arbitrate \nSome courts have found that parties can waive their right to compel arbitration through various forms of actions. In California, as demonstrated by Davis v. Shiekh Shoes and Espinoza v. Superior Court, a party wishing to compel arbitration though failing to pay arbitration fees in a timely manner waives their right to compel arbitration, and must resolve the dispute in court. More importantly, the Supreme Court found in Morgan v. Sundance that a party which does not compel arbitration when a valid clause exists waives its right to compel arbitration. Justice Elena Kagan, writing for the court's unanimous ruling in favor of hourly Taco Bell employee Robyn Morgan, found that the Eighth Circuit created \"special rules\" in which Morgan was compelled to arbitrate based on Sundance's prejudice (delay) of compelling arbitration.\n\nThe opinion on a party waiving its right to compel arbitration if it had litigated extensively prior to the motion has been further confirmed in light of Davis and Espinoza when one of Bronx County's justices ruled in Worbes Corp v. Sebrow. Justice Fidel Gomez states that if a party who intended to compel arbitration brought a \"substantive defense\" before the court, served a trial notice, moved to depose a witness, or \"interposed a counterclaim demanding money damages\", that party would have waived its right to compel arbitration. Justice Gomez, however, clarified that such right would not be waived by a party if a defendant \"had only defended its position and had not acted in a manner that waives the right to arbitrate\".\n\nUnbearable arbitration fees \nArbitration clauses can be void in instances where the costs of arbitration would be too high. In 1999's Shankle v. B-G Maintenance Management of Colorado, Inc, the 10th Circuit Court of Appeals refused to grant a motion to compel arbitration on the basis that the fees were too high for the plaintiff Matthew Shankle. The Texas Courts of Appeals found in 2022's Cont'l Homes of Texas v. Perez that due to unaffordable arbitration costs for the plaintiffs and the arbitration agreement not being an adequate remedy for litigation.\n\nSeverability-related challenges \nIn January 2023, a federal court in Delaware recommended that motions to compel arbitration which conflicted with the Employee Retirement Income Security Act of 1974 not be honored in Burnett et al. v. Prudent Financial Services LLC, et al. (C.A. No. 22-270-RGA-JLH). Presiding magistrate judge Jennifer Hall interpreted that based on recent action by the Supreme Court and other federal courts, not every provision within the arbitration agreement should be validated. Additionally, Judge Hall prospected that entire arbitration agreements could become invalid if a single provision is found to be unenforceable by a court.\n\nThe notion of a single unconscionable provision invalidating the arbitration agreement, even if such provision was outside of the arbitration-related clauses of a contract, was expanded the following June when a California court ruled in Alberto v. Cambrian Homecare that a confidentiality agreement which prohibited discussing compensation and salary information, and threatened litigation and the collection of attorneys fees, was unenforceable and also declared the arbitration agreement unenforceable.\n\nOther challenges \nIn 2014's Atalese v. U.S. Legal Services Group, L.P, the Supreme Court of New Jersey ruled that arbitration clauses must have a valid jury trial waiver, which the court saw as a constitutional right which must be explicitly waived in a contract, in order to be effective, a position reaffirmed by Pennsylvania's Superior Court in 2022's Chiluti v. Uber. \n\nA Pennsylvania appeals court in Philadelphia ruled in March 2023 that parents cannot bind their children to arbitration agreements over injuries, in a lawsuit between parents and a local trampoline park.\n\nTransportation workers exemption \nThe Federal Arbitration Act also explicitly provides that workers involved in transportation are exempt from arbitration agreements, which the Supreme Court unanimously reaffirmed in various cases, with one notable example being 2022's Southwest Airlines v. Saxon. This, however, does not apply to drivers working for Uber and other ridesharing services.\n\nActs of Congress\n\nEnding Forced Arbitration of Sexual Assault and Sexual Harassment Act \n\nIn 2022, Congress passed the Ending Forced Arbitration of Sexual Assault and Sexual Harassment Act (EFASASHA or EFAA), which excludes these types of complaints from arbitration clauses. Congress also included a ban on class action waivers for claims covered under the act. Under the law, claims which are filed after March 3, 2022 and fall under the scope of EFAA shall have agreements to submit disputes to binding arbitration and class action waivers within contracts signed deemed unenforceable for the entire case, though the law allows for claimants to have a case decided by binding arbitration if the plaintiff wishes upon filing. The law was championed by Gretchen Carlson, a former Fox News host sexually harassed for many years by then CEO Roger Ailes; she also opposed the use of non-disclosure agreements to shield perpetrators. \n\nThe law was introduced by Illinois House Democrat Cheri Bustos as HR 4445, and passed the House of Representatives by a 335-97 vote, with all no votes coming from Republicans. The EFAA passed the Senate with unanimous consent, and was signed into law by President Joe Biden on March 3, 2022. The law became effective immediately at signing.\n\nSome legal agencies raised concerns that the law could allow for claims attached to a sexual harassment or sexual assault dispute to bypass arbitration as well. These concerns were ultimately confirmed in February 2023, where New York federal judge Paul A. Engelmayer ruled in two lawsuits against the company Everyrealm that if at least one claim in a single case was an act of sexual assault or sexual harassment, the pre-dispute arbitration agreement was unenforceable and arbitration could not be compelled. Engelmayer's decision was rooted in the decision from Congress to directly amend the Federal Arbitration Act, and its actions to do so were indicative of its intention to prohibit the practice in entire cases which the EFAA covers; Engelmayer, however, clarified that the claim of sexual assault or harassment must be reasonable and that the EFAA does not enable implausible claims of sexual harassment to be used to \"dodge\" arbitration agreements. One month later, a California court ruling on a sexual harassment lawsuit filed against Tesla further confirmed the EFAA's ability to ban compelling arbitration in sexual harassment suits, and a second New York federal court earlier came to a similar conclusion in a case filed by an investment banker.\n\nForced Arbitration Injustice Repeal Act \n\nThe Forced Arbitration Injustice Repeal Act is a bill filed in every meeting of Congress since the 116th Congress which, if passed, contains provisions which ban arbitration agreements and class action waivers in cases between consumers and large companies, as well as employers and large companies. The bill is generally supported by the Democratic Party as well as Freedom Caucus member Matt Gaetz, though has usually been opposed by the Republican Party. In the 116th and 117th congresses, the bill passed the House but failed to pass the Senate; the bill has since been reintroduced in the 118th Congress by Democratic senators Sherrod Brown and Richard Blumenthal, and Democratic representative Hank Johnson.\n\nProtecting Older Americans Act \nThe Protecting Older Americans Act is pending legislation first filed in the 118th Congress by South Carolina Republicans Lindsey Graham in the Senate and Nancy Mace in the House. The law would ban and overturn arbitration agreements in cases involving discrimination based on age.\n\nRulings and actions by federal agencies\n\nFederal Student Loans \nIn November 2022, the Department of Education and the office on Federal Student Aid passed new rules which included reinstating a ban on institutions participating in its Direct Loan Program from utilizing pre-dispute mandatory arbitration agreements and class action waivers in cases relating to Borrower Defense to Repayment. The new rules also require institutions to disclose their uses of arbitration to the Department and to provide certain records connected with any borrower defense claim against the school to the Department. The Department of Education stated its reasoning for the ban is that class action waivers and arbitration agreements are too complex for much of the general public to comprehend and that arbitration \"rarely\" gives favorable decisions to consumers.The rules become effective on July 1, 2023.\n\nDepartment of Labor \nThe United States Department of Labor was noted in May 2023 by Bloomberg Law journalist Khorri Atkinson for its increased focus and hostility towards mandatory arbitration and its use by employers for violating Department of Labor rules. Solicitor of Labor Seema Nanda has stated that the Department will pursue more cases where employers are utilizing mandatory arbitration to commit violations of the Fair Labor Standards Act of 1938.\n\nProceedings\nVarious bodies of rules have been developed that can be used for arbitration proceedings. The rules to be followed by the arbitrator are specified by the agreement establishing the arbitration.\n\nEnforcement of award \n\nIn some cases, a party may comply with an award voluntarily. However, in other cases a party will have to petition to receive a court judgment for enforcement through various means such as a writ of execution, garnishment, or lien. If the property is in another state, then a sister-state judgment (relying on the Full Faith and Credit Clause) can be received by filing to enforce the judgment in the state where the property is located.\n\nVacatur\nUnder the Federal Arbitration Act, courts can only vacate awards for limited reasons set out in statute with similar language in the state model Uniform Arbitration Act.\n\nThe court will generally not change the arbitrator's findings of fact but will decide only whether the arbitrator was guilty of malfeasance, or whether the arbitrator exceeded the limits of his or her authority in the arbitral award or whether the award was made in manifest disregard of law or conflicts with well-established public policy.\n\nArbitration Fairness Act\n\nSee also\n Arbitration award\n Consumer arbitration\n Conciliation\n Dispute resolution\n Epic Systems Corp. v. Lewis\n Expert determination\n London Court of International Arbitration\n Mediation\n Negotiation\n Special referee\n Subrogation\n Tort reform\n UNCITRAL Model Law on International Commercial Arbitration\n National Arbitration Forum\n National Academy of Arbitrators\nFor the relevant conflict of laws elements, see contract, forum selection clause, choice of law clause, proper law, and lex loci arbitri\n\nReferences\n\nFurther reading\n Jerold S. Auerbach, Justice Without Law?: Non-Legal Dispute Settlement in American History (Oxford: Oxford University Press, 1983).\n Mark J. Astarita, Esq., Introduction to Securities Arbitration (SECLaw.com, 2000 - Securities Arbitration Overview-2023 Update)\n David Sherwyn, Bruce Tracey & Zev Eigen. \"In Defense of Mandatory Arbitration of Employment Disputes: Saving the Baby, Tossing out the Bath Water, and Constructing a New Sink in the Process,\" 2 U. Pa. J. Lab. & Emp. L. 73 (1999); n.b., abbreviated source in this legal citation format is the University of Pennsylvania Journal of Labor and Employment Law, Vol. 2, p. 73.\n Ed Brunet, J.D., Arbitration Law in America: A Critical Assessment, Cambridge University Press, 2006.\n Gary Born, International Civil Litigation in United States Courts (Aspen 4th ed. 2006) (with Bo Rutledge) (3rd ed. 1996) (2nd ed. 1992) (1st ed. 1989)\n\nExternal links\n\nRead actual arbitration awards and find arbitrator's resumes at GVSU \nAmerican Arbitration Association's Home Page\nAn Example of Labor Arbitration in the United States (Vulcan Iron Works and the Machinists' Union, 1981) .\n\nUnited States\nLaw of the United States"
}