{
  "title": "Arthur Zarden",
  "content": "Arthur Heinrich Ludwig Zarden (27 April 1885 in Hamburg – 18 January 1944 in Berlin) was a leading personality in German tax legislation and for a short time State Secretary in the Reich Finance Ministry.\n\nCareer \nNot much is known about Zarden's childhood or youth. In 1904, he left the Wilhelm-Gymnasium in Hamburg after his school-leaving examination and took up studies in law at the University of Lausanne, followed by semesters in Munich, Berlin and Kiel. His first State examination in law in 1908 in Kiel and his graduation to Doctor of Law in 1909 in Rostock were followed by his second State examination in law in Hamburg late in 1912. After being sworn in as an Assessor a few days later, he began his career, first in the Hamburg Inheritance Taxation Administration, the later Taxation Deputation. In 1914 came his appointment to Administration Assessor, in 1917, another to Government Adviser, and in 1919-20 a transfer to the Reich Finance Ministry. On 24 July 1920 he wed Edithe Orenstein, the industrialist Benno Orenstein's daughter. Further positions held by Zarden were Ministerial Adviser in 1920, Ministerial Manager in 1925, Ministerial Director and finally in 1932, State Secretary.\n\nTaxation Administration \nZarden came to the Reich Finance Ministry at a time of upheaval. The building of a centralistic finance administration, the burden of reparations from the war that Germany had lost, and lastly the struggle against inflation made the first years very hard. Owing to this, he concentrated himself on the consolidation of Reich finances through reconstruction and creation of capital gains, asset, and income taxes, along with compulsory loans. This was understood to mean a compulsory yielding of up to 10% of assets for each person and business. After economic stabilization, Zarden worked together with others on the Weimar Republic's second tax reform, which was aimed above all at simplifying and lowering taxes, as well as reorganizing finances between the Reich and the Länder (provinces or states). He authored countless articles in trade journals and union magazines.\n\nState Secretary \nAs leader of the taxation department in the Reich Finance Ministry, Zarden foresaw that he would become the old State Secretary Johannes Popitz's successor after the latter's \"provisional retirement\" in 1929 due to differences with the government. Instead, the new finance minister – who was at the same time also economy minister – Paul Moldenhauer, despite the Cabinet's intervention, appointed Hans Schäffer from the Reich Economy Ministry. In June 1932, Zarden's appointment as State Secretary finally came under the new minister Johann Ludwig Graf Schwerin von Krosigk\n\nZarden is reckoned to be the inventor of tax vouchers, which allowed discounts on taxes and through whose sale businesses could quickly obtain new liquidity.\n\nAfter the Hitler régime came to power, Zarden, who was an adherent of the Jewish faith, and married to a Jewish woman, stayed on as State Secretary at first, but through Adolf Hitler's intervention, he was thrown out of the government, and on 31 March 1933 put into \"provisional retirement\".\n\nOn 25 September, under the terms of the Law for the Restoration of the Professional Civil Service, section 6 (or §6), Zarden's retirement became permanent by year's end.\n\nCircumstances surrounding Zarden's death \nArthur Zarden got involved in the Solf Circle, led by former German Ambassador to Tokyo Dr. Wilhelm Heinrich Solf's widow, Johanna Solf. The circle, which was part of the resistance, brought together Foreign Ministry officials, intellectuals, writers, and others, along with Johanna Solf and her daughter, Lagi von Ballestrem. Sometime after Zarden's entry into the circle, the Gestapo managed to slip an informer, Paul Reckzeh, into the group, who in September 1943 reported them for a discussion that the group had had about the hopelessness of Germany's military situation, the subject matter alone being considered treasonous in Nazi Germany. This led to Zarden's arrest on 12 January 1944, whereupon he was taken to a Gestapo prison. It was clear to him that he would never leave the prison alive, and that he would be tortured. On 18 January, Zarden leapt through a window, falling to his death on the street below.\n\nLiterature \nAusstellungskatalog Bundesfinanzakademie/Bundesministerium der Finanzen, 1985\nIrmgard Ruppel-Zarden, Memories, 2001\n\nReferences \n\n1885 births\n1944 deaths\nPeople educated at the Wilhelm-Gymnasium (Hamburg)\nGerman People's Party politicians\nJews in the German resistance\nJewish resistance members during the Holocaust\nUniversity of Rostock alumni\nSuicides by jumping in Germany\n1944 suicides\nGerman Jews who died in the Holocaust\nSuicides by Jews during the Holocaust\nMembers of the Solf Circle\nGerman resistance members"
}