{
  "title": "Edward C. Lawson",
  "content": "Edward C. Lawson was an African American civil rights activist, who was the respondent in the case of Kolender v. Lawson, , in which the United States Supreme Court ruled that a California statute authorizing a police officer to arrest a person for refusing to present identification was unconstitutionally vague.\n\nPersonal life\n\nAside from his landmark supreme court case, very few biographical details are known about Lawson, a man described by the Los Angeles Times as \"mysterious, even secretive\".  Reportedly he was a vegetarian, and claimed that he was entirely sober, refusing all drugs and alcohol.  He avoided discussing \"exactly how he makes a living\".\n\nCivil rights case\n\nLawson is a protagonist in Kolender v. Lawson, 461 U.S. 352 (1983), a significant civil rights case.\n\nThis case is of historical importance not only because the California statute was voided, but also because it is one of the few examples of an ordinary citizen successfully representing himself all the way through a U.S. District Court. Lawson received political support at the time from prominent Black leaders including Jesse Jackson, activist/comedian Dick Gregory, U.S. Congresswoman Maxine Waters D-Los Angeles, U.S. Congressman John Conyers D-Detroit.\n\nIn 1983, Carl Stern, the CBS Evening News U.S. Supreme Court reporter commented that this case was the most reported U.S. Supreme Court case that year. Stern was referring to front-page newspaper articles in The New York Times, The Washington Post, Chicago Tribune, The Miami Herald, Los Angeles Times as well as articles in Newsweek, Time, Fortune, The Village Voice and other news publications. Additionally, Lawson made repeated appearances on The Oprah Winfrey Show, The Phil Donahue Show, Larry King Live, Crossfire, The Ricki Lake Show, The Today Show, and Good Morning America.\n\nHarvard University law professor Laurence Tribe commented during an appearance on The Oprah Winfrey Show that this case was the last time that the U.S. Supreme Court had decided in favor of a defendant in a civil rights case of this magnitude.\n\nCalifornia Penal Code § 647(e) was repealed by the California Legislature in 2008.\n\nSee also\n\n Hiibel v. Sixth Judicial District Court of Nevada\n Kolender v. Lawson\n Police misconduct\n Racial profiling\n Stop and identify statutes\n Contempt of cop\n Driving while black\n Henry Louis Gates arrest controversy\n\nNotes\n\nExternal links\n\nEdward C. Lawson—official website \nU.S. Supreme Court video story\nKolender v. Lawson, 461 U.S. 352 (1983)\nJon Shane, author\n1921 Tulsa Race Riot -- CNN\n1921 Tulsa Race Riot -- OSU Library\n2009-2011 Newark NJ\n\nActivists for African-American civil rights\nYear of birth missing (living people)\nHomelessness activists\nLiving people"
}