{
  "title": "Harry T. Burn",
  "content": "Harry Thomas Burn Sr. (November 12, 1895 – February 19, 1977) was a Republican member of the Tennessee General Assembly for McMinn County, Tennessee. Burn became the youngest member of the state legislature when he was elected at the age of twenty-two. He is best remembered for action taken to ratify the Nineteenth Amendment during his first term in the legislature.\n\nChildhood and education\nBorn in Mouse Creek (now Niota, Tennessee), Burn was the oldest of four children of James Lafayette Burn (1866–1916) and Febb Ensminger Burn (1873–1945). His father was the stationmaster at the Niota depot, and an entrepreneur in the community. His mother worked as a teacher after her graduation from U.S. Grant Memorial University (now Tennessee Wesleyan University). She later ran the family farm. Burn's siblings were James Lane \"Jack\" (1897–1955), Sara Margaret (1903–1914), and Otho Virginia (1906–1968). Burn graduated from Niota High School in 1911. He worked for the Southern Railway from 1913 to 1923.\n\n19th Amendment\nThe Nineteenth Amendment, regarding female suffrage, was proposed by Congress on June 4, 1919. The amendment could not become law without the ratification of a minimum thirty-six of the forty-eight states. By the summer of 1920, thirty-five of the forty-eight states had ratified the amendment, with a further four states called upon to hold legislative voting sessions on the issue. Three of those states refused to call special sessions, but Tennessee agreed to do so. This session was called to meet in August 1920. The effort to pass the legislation in the House was led by Joe Hanover. Banks Turner and Burn were two critical votes that ultimately tipped the balance to ratification.\n\nBurn had originally intended to vote for the amendment. After being pressured by party leaders and receiving misleading telegrams from his constituents telling him his district was overwhelmingly opposed to woman suffrage, he began to side with the Antisuffragists. However, a letter from his mother asking him to vote in favor of the amendment helped to change his mind: Febb Ensminger Burn of Niota had written a long letter to her son, which he held in his coat pocket during the voting session on August 18, 1920. The letter contained the following:\n\nAfter much debating and argument, the result of the vote was 48-48. After Burn voted twice to \"table\" the amendment, the house speaker called for a vote on the \"merits\". Burn followed his mother's advice and voted \"aye\". His vote broke the tie in favor of ratifying the amendment. He responded to attacks on his integrity and honor by inserting a personal statement into the House Journal, explaining his decision to cast the vote in part because \"I knew that a mother’s advice is always safest for a boy to follow, and my mother wanted me to vote for ratification.\"\n\nAs anti-suffragists had been fighting and preparing for this moment over the summer, they became very enraged when they discovered the news of Burn's decision. Contrary to popular belief, Burn was not chased out of the capitol by an angry mob of anti-suffragists. But the anti-suffrage forces accused him of bribery and a grand jury was called to investigate the accusations. Burn narrowly won reelection to a second term in the house after a grueling campaign back home in McMinn County.\n\nPublic career\nBurn held public office for much of his adult life, including positions in the State House of Representatives, 1918–1922; State Senate, 1948–1952; state planning commission, 1952–1970; and as delegate for Roane County to the Tennessee constitutional conventions of 1953, 1959, 1965, and 1971. Burn ran unsuccessfully for the Republican gubernatorial nomination in 1930.\n\nPersonal life\nIn 1923, Burn was admitted to the Tennessee Bar and practiced law in Rockwood and Sweetwater. In 1951, he became President of the First National Bank in Rockwood.\n\nBurn was a member of several civic and fraternal organizations, including the National Society Sons of the American Revolution, serving as President-General for the 1964–1965 term.\n\nHe was briefly married to Mildred Rebecca Tarwater from 1933 to 1935.\nHe married Ellen Folsom Cottrell (1908–1998) in 1937. The couple had one child, Harry T. Burn Jr. (1937–2016).\n\nBurn died at his home in Niota.\n\nIn popular culture\nBurn is portrayed by Peter Berinato in the 2004 film Iron Jawed Angels.\n\nWinter Wheat, a musical about the ratification of the 19th Amendment in Tennessee, premiered in 2016 after its original version had a limited run in 2014; Harry Burn, his mother Febb, and his younger brother Jack, are major characters. The play was performed again in 2020.\n\nBurn's great-grandnephew, Tyler L. Boyd, wrote a comprehensive biography of Burn, called Tennessee Statesman Harry T. Burn: Woman suffrage, free elections, and a life of service, and published in 2019.\n\nBurn is portrayed in the 2022 musical Suffs.\n\nReferences\n\nSources\n\nExternal links\n \n \n \n\n1895 births\n1977 deaths\nPeople from McMinn County, Tennessee\nBusinesspeople from Tennessee\nTennessee lawyers\nRepublican Party Tennessee state senators\nRepublican Party members of the Tennessee House of Representatives\n20th-century American politicians\n20th-century American businesspeople\n20th-century American lawyers"
}