{
  "title": "J. Steward Davis",
  "content": "James Steward Davis (born October 11, 1890 — disappeared on April 15, 1929) was an American lawyer and political activist in Baltimore, Maryland. During the 1920s, Davis worked as a highly respected trial lawyer as well as a campaign organizer for W. Ashbie Hawkins, Al Smith, Herbert O'Conor and the Democratic Party in Maryland. In 1929, Davis disappeared under suspicious circumstances.\n\nAncestry\nDavis was born in Harrisburg, Pennsylvania in 1890, the son of a barber. His grandmother, Matilda Stewart (Steward), is identified as living at 418 South Street, Harrisburg from 1900 until the family moved to 1511 Derry Street between 1910 and 1920. She was listed as a cook on the census records and is last reported in the household of his parents in 1920. His grandfather appears only on the 1870 census for Harrisburg as a carter born in Baltimore.\n\nEducation\nAfter his graduation from Harrisburg High School, Davis took a two-year course at Dickinson College. Then he studied law there, graduating first in his class in 1914. According to later newspaper accounts, he was the first person of color to be valedictorian at Dickinson School of Law.\n\nCareer\nDavis moved to Baltimore in 1915, and was admitted to the bar on June 19 of that year. He began practicing on his own, although he would later partner with such notable Baltimore attorneys as W. Norman Bishop, Warner T. McGuinn, and George W. Evans.\n\nSoon after beginning his law practice, Davis' career was interrupted by World War I, and he spent the next 18 months in the Army. He served in France as a sergeant. After being promoted to lieutenant, Davis became an instructor at Camp Zachary Taylor near Louisville, Kentucky.\n\nUpon returning from the war, Davis quickly built a thriving practice as a trial lawyer in Baltimore. At six feet tall, and with a polished air and winning smile, Davis had an impressive presence which sometimes drew crowds to the courtroom. In 1921, he appeared in 48 cases mentioned in The Afro-American newspaper, mostly divorces and criminal defense, including the highly publicized capital murder case of Henry Brown, an Annapolis sailor. Said Davis of his legal career, \"The law offers a most attractive (spot) for colored men. We get a fair show in the courts and the people appreciate our efforts\".\n\nThough his legal career put him in the limelight, Davis did not run for political office and instead worked behind the scenes as a campaign organizer. He was the chairman of the committee supporting W. Ashbie Hawkins's revolt against the established Republican Party in 1920. Like other independent Republicans, Davis later switched to the Democratic Party, and managed the Colored City Democratic campaign for Al Smith's 1928 bid against Herbert Hoover.\n\nDavis said of his political activism, \"It is time that we look after our own political affairs, and not entrust them to whites who are indifferent to our welfare\". Ironically, Davis supported Herbert O'Conor's (white) campaign for State's Attorney for Baltimore City in 1926. As Attorney General, O'Conor would argue against the admission of Donald Gaines Murray to the University of Maryland law school in 1935.\n\nDavis married Blanche Moore, a public school teacher, in 1920 and they had two children, Suzanne and Blanche. During the 1920s Davis was a well-respected lawyer in Baltimore who was embraced by the legal community and social circles. In April 1929, Davis vanished.\n\nDisappearance\nOn the morning of April 15, 1929, Davis left his home at 1202 Madison Avenue for his office at 217 St. Paul Place. He never arrived. His family initially concealed his absence, and The Afro American newspaper first mentioned his disappearance in mid-May. An investigation by the Monumental Bar Association found that Davis had bought a train ticket to New York City on April 15, stayed at New York's 135th St. Y.M.C.A. that night and then checked out the following morning. Nothing further was reported found.\n\nThere were many theories about his disappearance, but one persistent rumor was that Davis had misapplied money in an administration case, and fled to avoid sanction. In a September 19, 1931 story, The Afro-American reported that an executive meeting\nof the Monumental Bar Association settled the case and swore everyone to secrecy, hoping to allow Davis to return to his practice, but no corroboration surfaced for this story. There were also unsubstantiated claims of sightings in various cities in the\nUnited States or in France.\n\nSee also\nList of people who disappeared\n\nReferences\n\"Lawyer Who Vanished Years Ago Still Missing.\" Afro-American, 22 July 1935.\nMadden, Charles, J. Steward Davis: The Vanishing Star, Archives of Maryland (Biographical Series), retrieved 17 October 2010\n\"Where is J. Steward Davis, Ex-Harrisburg, Pa., Lawyer?\" Afro-American''',  19 September 1931.\n\nNotes\n This article incorporates text from \"J. Steward Davis: The Vanishing Star\" by Charles Madden, a publication released into the public domain.''\n\n1890 births\n1920s missing person cases\n20th-century African-American lawyers\nDickinson School of Law alumni\nMaryland lawyers\nMissing person cases in Maryland\nUnited States Army officers\nYear of death unknown"
}