{
  "title": "Ken Rothman",
  "content": "Kenneth Joel Rothman (October 11, 1935 – April 26, 2019) was an American lawyer and politician from Missouri. He served as the 41st Lieutenant Governor of Missouri from 1981 to 1985.\n\nBiography \nRothman was born and raised in St. Louis and attended public schools. He graduated from Washington University in St. Louis with a Bachelor of Arts in history and political science and also received his law degree from Washington University.\n\nRothman served in the Missouri Air National Guard from 1953 to 1962 and was called to active duty during the Berlin Crisis of 1961. He worked as a prosecutor for St. Louis County before entering private law practice. Rothman's political career began with his election to the Missouri House of Representatives in 1962 representing the Clayton area.  He was re-elected eight times. In 1973 he was chosen as Majority Leader and in 1976 he became Speaker of the House.\n\nIn 1980 Rothman was elected Lieutenant Governor, defeating Roy Blunt. In 1984, he was the Democratic nominee for Governor of Missouri but was defeated by Republican John Ashcroft.\n\nFrom 2001, he served of counsel to the law firm of Capes, Sokol, Goodman and Sarachan PC.\n\nRothman's ex-wife, Geri Rothman-Serot, was the Democratic nominee for the United States Senate against Kit Bond in 1992.  His son Daniel Rothman is an attorney in Des Moines Iowa.  Ken Rothman was the first Jew elected to statewide office in the history of Missouri.\n\nRothman died on April 26, 2019, in St. Louis, at the age of 83.  His ex-wife politician Geri Rothman-Serot, a three-time survivor of breast cancer, died a few months later in Florida on July 2, 2019, of a rare form of bone cancer.\n\nReferences\n\n \n\n1935 births\n2019 deaths\nJewish American people in Missouri politics\nPoliticians from St. Louis\nWashington University in St. Louis alumni\nLieutenant Governors of Missouri\nLawyers from St. Louis\nMissouri National Guard personnel\nSpeakers of the Missouri House of Representatives\nDemocratic Party members of the Missouri House of Representatives\nWashington University School of Law alumni\nCandidates in the 1984 United States elections"
}