{
  "title": "Legislative Council of Lower Canada",
  "content": "The Legislative Council of Lower Canada was the upper house of the bicameral structure of provincial government in Lower Canada until 1838. The upper house consisted of appointed councillors who voted on bills passed up by the Legislative Assembly of Lower Canada. The legislative council was created by the Constitutional Act. Many of the members first called in the Council in 1792 had served as councillors in the Council for the Affairs of the Province of Quebec.\n\nThe council came to be dominated by the Château Clique, members of the province's most powerful families who were generally interested in preserving the status quo. Both the upper and lower houses were dissolved on March 27, 1838 following the Lower Canada Rebellion and Lower Canada was administered by an appointed Special Council.\n\nFollowing the Act of Union in 1840, the Legislative Council of the Province of Canada was created in 1841.\n\nLegislative buildings\n Old Parliament Building (Quebec)\n\nList of Members of the Legislative Council\n\nSpeakers\n\nDuring much of the existence of the Legislative Council, the Chief Justice served as Speaker and others appointed to the role in absence of the Chief Justice.\n\n William Smith 1791-1793\n William Osgoode 1794-1797\n Thomas Dunn 1797-1801\n James Monk 1802\n John Elmsley 1803-1804\n Thomas Dunn 1805\n François Baby 1806\n Henry Allcock 1807-1808\n Thomas Dunn 1808\n Jonathan Sewell 1809-1810\n Thomas Dunn 1811-?\n James Monk 1815-1816\n Jonathan Sewell 1817\n John Hale 1818\n Jonathan Sewell 1819-1826\n James Kerr 1827-1828\n Jonathan Sewell 1829-1830\n John Hale 1831\n Sir John Caldwell 1831-?\n Jonathan Sewell 1833-1838\n\nAfter the Rebellion, the Speaker was a member of the Special Council of Lower Canada:\n\n James Cuthbert, Jr. 1838\n Sir James Stuart, 1st Baronet 1839-1841\n\nSee also\nExecutive Council of Lower Canada\nConstitutional history of Canada\nLegislative Council of Quebec\n\nNotes\nUnless otherwise noted, the member died in office.\n\nExternal links\n Aux fenêtres du Parlement de Québec : histoire, traditions, coutumes, usages, procédures, souvenirs, anecdotes, commissions et autres organismes, D. Potvin (1942)\n  Assemblée nationale du Québec (French)\n\nLower Canada\nDefunct upper houses in Canada\n\n1792 establishments in Lower Canada"
}