{
  "title": "Margaret B. Kelly",
  "content": "Margaret Blake Kelly (born September 17, 1935) is an American former politician and accountant from Missouri.\n\nKelly served as the State Auditor of Missouri from 1984 to 1999. She is the first woman to hold statewide office in Missouri. Kelly is a Republican.\n\nEarly life, education, and family\nKelly was born in Crystal City, Missouri to Emory and Florine Blake. She received her Bachelor of Science degree in business administration from the University of Missouri in 1957. Kelly also received a MBA from Missouri State University (then Southwest Missouri State University) in 1975 and earned her CPA certification in 1982. Kelly is married to William C. Kelly; the Kellys have three sons.\n\nCareer\nBefore entering public life, Kelly worked for various private sector accounting firms for 20 years.  \n\nA Republican, Kelly's first elected position was as Cole County auditor. She was elected to that position in 1982.  \n\nGovernor Kit Bond appointed Kelly to the position of state auditor, filling a vacancy created by the resignation of James F. Antonio. She was inaugurated on July 16, 1984. Kelly is the first woman to hold statewide elected office in Missouri. In November of that year, Harriett Woods was elected lieutenant governor, giving Woods the distinction of being the first woman elected to statewide office in Missouri.\n\nKelly was elected to a full term as state auditor in 1986 and was re-elected in 1990 and 1994. In 1992, Kelly was the Republican nominee for lieutenant governor, but was defeated by Democrat Roger B. Wilson. In 1996, she ran for governor against Democratic Gov. Mel Carnahan, but lost by a large margin.  \n\nKelly retired from public life after leaving office in January 1999.\n\nReferences\n\n|-\n\n1935 births\n21st-century American women\nLiving people\nMissouri Republicans\nMissouri State University alumni\nPeople from Crystal City, Missouri\nPeople from Cole County, Missouri\nState Auditors of Missouri\nUniversity of Missouri alumni\nWomen in Missouri politics"
}