{
  "title": "Politics of Chile",
  "content": "Chile's government is a representative democratic republic, whereby the President of Chile is both head of state and head of government, and of a formal multi-party system. Executive power is exercised by the president and by their cabinet. Legislative power is vested in both the government and the two chambers of the National Congress. The judiciary is independent of the executive and the legislature of Chile.\n\nThe Constitution of Chile was approved in a national plebiscite in September 1980, under the military dictatorship of Augusto Pinochet. It entered into force in March 1981. After Pinochet left power in 1990, saying this country was ready to keep going along with a plebiscite, the Constitution was amended to ease provisions for future amendments to the Constitution.\n\nIn September 2006, President Ricardo Lagos signed into law several constitutional amendments passed by Congress. These include eliminating the positions of appointed senators and senators for life, granting the President authority to remove the commanders-in-chief of the armed forces, and reducing the presidential term from six to four years while also disabling immediate re-election.\n\nStatistical analysis suggests Chilean politicians in Congress \"are not randomly drawn from the population, but over-represent high-income communities\". As such Chileans of Castilian-Basque, Palestinian and Jewish ancestry are overrepresented in it.\n\nHistory\n\nThe autocratic and conservative republic (1831-1861) was replaced by the liberal republic (1861-1891), during which some political conquests were made, such as proportional representation (1871) and the abolition of the condition of ownership to have the right to vote (1885).\n\nParliamentary Republic\n\nWhen the era of the parliamentary republic began in 1891, the struggle between liberals (pipiolos) and conservatives (pelucones) had already evolved due to the emergence of a multi-party system. In the 1880s, the Liberals split into two factions: the moderates, who did not want to impose secularism too quickly and were willing to compromise with the Conservatives, and the radical Liberals, who joined the Radical Party founded in 1863 or the new Democratic Party with more progressive, if not socialist, ideas.\n\nEuropean and particularly British companies having appropriated a large part of the country's economy (saltpeter, bank, railroad, trade), President José Balmaceda (1886-1891), leader of moderate liberals, decided to react by directing his policy in two directions: the nationalization of saltpeter mines and the intervention of the State in economic matters. Already facing the conservative aristocracy, he alienated the bankers. He was dismissed by a vote of Parliament and pressure from part of the army. He committed suicide by firearm at the end of the civil war that his supporters lost.\n\nWorkers' struggles and social reforms\nA new parliamentary regime emerged from the civil war; it was the government of Fronda aristocrática. From 1906 onwards, the Radical Party demanded social reforms and the establishment of a democratic regime. That same year, the leader of the Federation of Workers, Luis Emilio Recabarren, was elected to the House but his election was canceled by the House. In 1912 he founded the Socialist Workers Party.\n\nDespite the country's good economic performance, life remains particularly hard for a large part of the population (12 or 14-hour working days for workers, very low wages, illiteracy of more than 50% in the years 1900–1910, etc.). Trade unionism was organized and fought; strikes and workers' demonstrations multiplied, sometimes very harshly repressed: general strike in Santiago (1905), railroads and mines in Antofagasta (1906), a demonstration in Iquique (1907). From 1911 to 1920, there were 293 strikes. Some repressions kill hundreds of people. The workers' movement was organized in the 1910s with the creation of the Chilean Regional Workers' Federation in 1913 and the Chilean branch of the Industrial Workers of the World in 1919.\n\nIn 1920, the economic crisis worsened the standard of living of the middle classes, which were politically closer to the working classes. This new situation led to the election of Arturo Alessandri Palma. During his first term in office, he pursued a progressive policy: labor law, the establishment of the tax on property income, the establishment of the Central Bank, creation of social security funds, etc. However, it must constantly deal with the Senate, always under Conservative control, which systematically tries to block its reforms. Shortly before his withdrawal from power, he drew up a new Constitution that was considered to be the advent of true democracy in Chile. This Constitution enshrines the separation of Church and State and religious freedom, declares compulsory primary education, restores presidentialism by electing the president by universal suffrage, and above all proclaims that property must be regulated in such a way as to ensure its social function.\n\nLegislative branch\n\nThe bicameral National Congress (Congreso Nacional) consists of the Senate (Senado) and the Chamber of Deputies (). The Senate is made up of 50 members elected from regions or subregions. Senators serve approximately eight-year terms. The Chamber of Deputies has 155 members, who are elected by popular vote to serve four-year terms. The last congressional elections were held on November 21, 2021. \n\nFor parliamentary elections, between 1989 and 2013 the binominal system was used, which promoted the establishment of two majority political blocs -Concertación and Alliance- at the expense of the exclusion of non-majority political groups. The opponents of this system approved in 2015 a moderate proportional electoral system that has been in force since the 2017 parliamentary elections, allowing the entry of new parties and coalitions.\n\nElections are very labor-intensive but efficient, and vote counting normally takes place the evening of the election day. One voting table, with a ballot-box each, is set up for at-most 200 names in the voting registry. Each table is staffed by five people (vocales de mesa) from the same registry. Vocales have the duty to work as such during a cycle of elections, and can be penalized legally if they do not show up. A registered citizen can only vote after his identity has been verified at the table corresponding to his registry. Ballots are manually counted by the five vocales, after the table has closed, at least eight hours after opening, and the counting witnessed by representatives of all the parties who choose to have observers.\n\nThe main existing political coalitions in Chile are:\n\nGovernment:\n\n Apruebo Dignidad (Approve Dignity) is a left-wing coalition that has its origin in the 2021 Chilean Constitutional Convention election. After the success in that election, it held presidential primaries, in which Gabriel Boric (CS, FA) was the winner. It is formed by the coalition Frente Amplio (Broad Font) and the coalition Chile Digno (Worthy Chile) formed by the Communist Party of Chile  and others left-wing parties.\n\n Democratic Socialism is a center-left coalition, successor of the Constituent Unity, and this of the Concertation -which supported the \"NO\" option in the 1988 plebiscite and subsequently governed the country from 1990 to 2010-. This pact is formed by the parties Socialist, for Democracy, Radical, and Liberal.\n\nOpposition:\n\n Chile Vamos (Let's go Chile) is a center-right coalition with roots of liberal conservatism, formed by the parties Renovación Nacional (National Renewal), Unión Demócrata Independiente (Independent Democratic Union) and Evópoli. It has its origins in the Alliance coalition, formed by the main parties that supported the \"YES\" option in the 1988 plebiscite, although it has used different names since then. It was the ruling coalition during the first and second government of Sebastián Piñera, (2010-2014) and (2018-2022).\n\nIn the National Congress, Chile Vamos has 52 deputies and 24 senators, while the parliamentary group of Apruebo Dignidad is formed by 37 deputies and 6 senators. Democratic Socialism is the third political force with 30 deputies and 13 senators. The other groups with parliamentary representation are the Republican Party (15 deputies and 1 senator), the Christian Democratic Party (8 deputies and 5 senators), the Party of the People (8 deputies), and the independents outside of a coalition (5 deputies and 1 senator).\n\nSince 1987, the Congress operates in the port city of Valparaíso, about  northwest of the capital, Santiago. However some commissions are allowed to meet in other places, especially Santiago. Congressional members have repeatedly tried to relocate the Congress back to Santiago, where it operated until the 1973 Chilean coup d'état, but have not been successful. The last attempt was in 2000, when the project was rejected by the Constitutional Court, because it allocated funds from the national budget, which, under the Chilean Constitution, is a privilege of the President.\n\nLegal system\n\nChile's legal system is civil law based. It is primarily based on the Civil code of 1855, derived from Spanish law and subsequent codes influenced by European law of the last half of the 19th Century. It does not accept compulsory ICJ jurisdiction.\n\nFrom the year 2000 onwards, Chile completely overhauled its criminal justice system; a new, US-style adversarial system has been gradually implemented throughout the country with the final stage of implementation in the Santiago metropolitan region completed on June 9, 2001.\n\nPolitical parties and elections\n\nPressure groups\nPressure groups according to the CIA World Factbook:\n Student federations at all major universities\n Roman Catholic Church\n Workers' United Center of Chile trade unionists from Chile's five largest labor confederations.\n\nInternational organization participation\nChile or Chilean organizations participate in the following international organizations:\n\nSee also\n\nPresident of Chile\nList of presidents of Chile\nList of political parties in Chile\nForeign relations of Chile\nLaw of Chile\nHuman rights in Chile\nJudiciary of Chile\nChilean political scandals\nAugusto Pinochet\n\nReferences\n\nExternal links\n Presidency \n Judicial Branch \n National Congress \n Ministries \n Chile Atiende - Government Portal \n Global Integrity Report: Chile has reporting on anti-corruption in Chile\n Government of Chile - Not Official\n\n \nGovernment of Chile"
}