{
  "title": "Politics of Antigua and Barbuda",
  "content": "The politics of Antigua and Barbuda takes place in a framework of a unitary parliamentary representative democratic monarchy, wherein the sovereign of Antigua and Barbuda is the head of state, appointing a governor-general to act as vice-regal representative in the nation. A prime minister is appointed by the governor-general as the head of government, and of a multi-party system; the prime minister advises the governor-general on the appointment of a Council of Ministers. Executive power is exercised by the government. Legislative power is vested in both the government and the two chambers of the Parliament. The bicameral Parliament consists of the Senate (seventeen-member body appointed by the governor-general) and the House of Representatives (seventeen seats; members are elected by proportional representation to serve five-year terms).\n\nAntigua and Barbuda has a long history of free elections, three of which have resulted in peaceful changes of government. Since the 1951 general election, the party system has been dominated by the Antigua and Barbuda Labour Party (ABLP), for a long time was dominated by the Bird family, particularly Prime Ministers Vere and Lester Bird. The opposition claimed to be disadvantaged by the ABLP's longstanding monopoly on patronage and its control of the media, especially in the 1999 general election. The opposition United Progressive Party (UPP) won the 2004 election, and its leader Winston Baldwin Spencer was prime minister of Antigua and Barbuda from 2004 to 2014.\n\nThe elections to the House of Representatives were held on 12 June 2014. The Antigua and Barbuda Labour Party government was elected with fourteen seats. The United Progressive Party had three seats in the House of Representatives. ABLP won 15 of the 17 seats in the 2018 snap election under the leadership of incumbent Prime Minister Gaston Browne.\n\nConstitutional safeguards include freedom of speech, press, worship, movement, and association. Antigua and Barbuda is a member of the eastern Caribbean court system. The Judiciary is independent of the executive and the legislature. Jurisprudence is based on English common law.\n\nExecutive branch\n\nMinisters\n\nParliamentary secretaries\n\nPermanent secretaries\n\nExecutive branch leadership \nAs head of state, King Charles III is represented in Antigua and Barbuda by a governor-general who acts on the advice of the prime minister and the cabinet.\n\nLegislative branch\n\nAntigua and Barbuda elects on national level a legislature. Parliament has two chambers. The House of Representatives has 19 members: 17 members elected for a five-year term in single-seat constituencies, and 2 ex officio members (president and speaker). The Senate has 17 appointed members. The prime minister is the leader of the majority party in the House and conducts affairs of state with the cabinet. The prime minister and the cabinet are responsible to the Parliament. Elections must be held at least every five years but may be called by the prime minister at any time.\n\nThere are special legislative provisions to account for Barbuda's low population relative to that of Antigua. Barbuda is guaranteed one member of the House of Representatives and two members of the Senate. In addition, there is a Barbuda Council to govern the internal affairs of the island.\n\nPolitical parties and elections\n\nAdministrative divisions\n\nThe country is divided into six parishes, Saint George, John, Mary, Paul, Peter, and Phillip which are all on the island of Antigua. Additionally, the islands of Barbuda and Redonda are considered dependencies.\n\nJudicial branch\nAntigua and Barbuda is a member of the Eastern Caribbean Supreme Court. This court is headquartered in Saint Lucia, but at least one judge of the Supreme Court resides in Antigua and Barbuda, and presides over the High Court of Justice. The current High Court judges are Jennifer Remy and Keith Thom.\n\nAntigua is also a member of the Caribbean Court of Justice, although it has not yet acceded to Part III of the 2001 Agreement Establishing a Caribbean Court of Justice. Its supreme appellate court therefore remains the British Judicial Committee of the Privy Council. Indeed, of the signatories to the Agreement, as of December 2010, only Barbados has replaced appeals to Her Majesty in Council with the Caribbean Court of Justice.\n\nIn addition to the Eastern Caribbean Supreme Court, Antigua and Barbuda has a Magistrates' Court, which deals with lesser civil and criminal cases.\n\nMovements \n\n Republicanism in Antigua and Barbuda\n\nPolitical pressure groups and leaders\n\n Antigua Trades and Labour Union\n People's Democratic Movement\n\nInternational organisation participation\n\n Organisation of African, Caribbean and Pacific States\n ALBA\n Caribbean Community\n Caribbean Development Bank\n Community of Latin American and Caribbean States\n Commonwealth of Nations\n United Nations Economic Commission for Latin America and the Caribbean\n Food and Agriculture Organization\n Group of 77\n International Bank for Reconstruction and Development\n International Civil Aviation Organization\n International Criminal Court\n International Confederation of Free Trade Unions\n International Red Cross and Red Crescent Movement\n International Fund for Agricultural Development\n International Finance Corporation\n International Federation of Red Cross and Red Crescent Societies\n International Labour Organization\n International Monetary Fund\n International Maritime Organization\n Intelsat (nonsignatory user)\n Interpol\n International Olympic Committee\n International Telecommunication Union\n Non-Aligned Movement (observer)\n Organization of American States\n Organisation of Eastern Caribbean States\n OPANAL\n United Nations\n United Nations Conference on Trade and Development\n UNESCO\n Universal Postal Union\n World Confederation of Labour\n World Federation of Trade Unions\n World Health Organization\n World Meteorological Organization\n World Trade Organization\n\nReferences"
}