{
  "title": "Resisting arrest",
  "content": "Resisting arrest, or simply resisting, is an illegal act of a suspected criminal either fleeing, threatening, assaulting, or providing a fake ID to a police officer during arrest. In most cases, the person responsible for resisting arrest is criminally charged or taken to court. In fewer, they are killed.\n\nBrazil \nThe Brazilian penal code states resistance to arrest is \"opposition to the execution of a legal act, by means of violence or threat towards a competent official executing it, or to who is assisting them\". The penalty is from 1 to 3 years of imprisonment. Any damage caused by the violence used shall also be charged to the offender.\n\nCanada\nThe Criminal Code has two provisions covering resisting arrest. Section 129(a) makes it an offence for anyone who \"resists or wilfully obstructs a public officer or peace officer in the execution of their duty or any person lawfully acting in aid of such an officer\". Section 270(1) makes it an offence for anyone who \"(a) assaults a public officer or peace officer engaged in the execution of their duty or a person acting in aid of such an officer; (b) assaults a person with intent to resist or prevent the lawful arrest or detention of theirself  or another person\". Section 129 has a maximum jail term of two years, and Section 270 has a maximum term of five years.\n\nDenmark\nThe Danish penal code makes allowance for some forms of eluding and thus is very different from the penal code in the United States.\n\nNorway\nResisting arrest in Norway can be punished with up to three months in jail.\n\nTaiwan\nAny arrest not in accordance with the procedure prescribed by law may be constitutionally resisted. Conversely, knowingly and willfully resisting a lawful police arrest with threats or violence may indirectly constitute obstructing official duty.\n\nUnited Kingdom\n\nEngland and Wales\n\nSection 38 of the Offences against the Person Act 1861 states:\n\nAssault with intent to commit felony, or on peace officers, &c.\n\nWhosoever . . . shall assault any person with intent to resist or prevent the lawful apprehension or detainer of himself or of any other person for any offence, shall be guilty of a misdemeanor, and being convicted thereof shall be liable, at the discretion of the court, to be imprisoned for any term not exceeding two years, . . .\n\nSection 89 of the Police Act 1996 states:\n\n(2) Any person who resists or wilfully obstructs a constable in the execution of his duty, or a person assisting a constable in the execution of his duty, shall be guilty of an offence and liable on summary conviction to imprisonment for a term not exceeding one month or to a fine not exceeding level 3 on the standard scale, or to both.\n\nThere is a further offence provided by the Vagrancy Act 1824, concerning \"violently resisting\" a constable:\n\n\"...and every person apprehended as an idle and disorderly person, and violently resisting any constable, or other peace officer so apprehending them, and being subsequently convicted of the offence for which they shall have been so apprehended; shall be deemed a rogue and vagabond, within the true intent and meaning of this Act\"\n\nUnited States\nThe courts in the United States regard resisting arrest as a separate charge or crime in addition to other alleged crimes committed by the arrested person.  It is possible to be charged, tried and convicted on this charge alone, without any underlying cause for the original decision to arrest or even if the original arrest was clearly illegal. Accordingly, it is never advisable to resist even an unlawful arrest as it will likely result in the use of force by the arresting officer up to and including summary execution regardless of how minor the original offence (or lack thereof in the case of an illegal arrest) was. As well as the addition of the charge of resisting. In most states, see below, resisting arrest is a misdemeanor which can result in jail time.\n\nAlabama\nA person would commit the crime of resisting arrest if they were to intentionally prevent or attempt to prevent a peace officer from affecting a lawful arrest of their-self or of another person.\n(b) Resisting arrest is a Class B misdemeanor.\n(Acts 1977, No. 607, p. 812, §4625.)\n\nAlaska\nA person commits the crime of resisting or interfering with arrest if, knowing that a peace officer is making an arrest, with the intent of preventing the officer from making the arrest, the person resists personal arrest or interferes with the arrest of another by\n(1) force;\n(2) committing any degree of criminal mischief; or\n(3) any means that creates a substantial risk of physical injury to any person.\n(b) Resisting or interfering with arrest is a class A misdemeanor.\n\nArizona\nA person commits resisting arrest by intentionally preventing or attempting to prevent a person reasonably known to them to be a peace officer, acting under color of such peace officer's official authority, from effecting an arrest by: (1). Using or threatening to use physical force against the peace officer or another (2) Using any other means creating a substantial risk of causing physical injury to the peace officer or another (3) Engaging in passive resistance. B. Resisting arrest pursuant to subsection A, paragraph 1 or 2 of this section is a class 6 felony. Resisting arrest pursuant to subsection A, paragraph 3 of this section is a class 1 misdemeanor. C. For the purposes of this section, \"passive resistance\" means a nonviolent physical act or failure to act that is intended to impede, hinder or delay the effecting of an arrest.\n\nArkansas \nA person commits the offense of resisting arrest if they knowingly resists a person known by them  to be a law enforcement officer effecting an arrest. (2) As used in this subsection, \"resists\" means using or threatening to use physical force or any other means that creates a substantial risk of physical injury to any person. (3) It is no defense to a prosecution under this subsection that the law enforcement officer lacked legal authority to make the arrest if the law enforcement officer was acting under color of their official authority. (4) Resisting arrest is a Class A misdemeanor. (b)  (1) A person commits the offense of refusal to submit to arrest if they knowingly refuses to submit to arrest by a person known by them to be a law enforcement officer effecting an arrest. (2) As used in this subsection, \"refuses\" means active or passive refusal. (3) It is no defense to a prosecution under this subsection that the law enforcement officer lacked legal authority to make the arrest if the law enforcement officer was acting under colour of their official authority. (4) Refusal to submit to arrest is a Class B misdemeanor.\n\nCalifornia \nEvery person who willfully resists, delays, or obstructs any public officer, peace officer, or an emergency medical technician, as defined in Division 2.5 (commencing with Section 1797) of the Health and Safety Code, in the discharge or attempt to discharge any duty of their office or employment, when no other punishment is prescribed, shall be punished by a fine not exceeding one thousand dollars ($1,000), or by imprisonment in a county jail not to exceed one year, or by both that fine and imprisonment.\n\nColorado \nA person commits resisting arrest if they knowingly prevent or attempt to prevent a peace officer, acting under color of their official authority, from effecting an arrest of the actor or another, by: (a) Using or threatening to use physical force or violence against the peace officer or another; or (b) Using any other means which creates a substantial risk of causing bodily injury to the peace officer or another. It is no defense to a prosecution under this section that the peace officer was attempting to make an arrest which in fact was unlawful, if he was acting under color of his official authority, and in attempting to make the arrest he was not resorting to unreasonable or excessive force giving rise to the right of self-defense. A peace officer acts \"under color of his official authority\" when, in the regular course of assigned duties, he is called upon to make, and does make, a judgment in good faith based upon surrounding facts and circumstances that an arrest should be made by him. The term \"peace officer\" as used in this section and section 18-8-104 means a peace officer in uniform or, if out of uniform, one who has identified himself by exhibiting his credentials as such peace officer to the person whose arrest is attempted. Resisting arrest is a class 2 misdemeanor.\n\nConnecticut \nInterfering with an Officer:\n\nA person is guilty of interfering with an officer when such person obstructs, resists, hinders or endangers any (peace officer / special policeman / motor vehicle inspector / firefighter) in the performance of such (peace officer's / special policeman's / inspector's / firefighter's) duties.\n\nResisting Arrest With Force:\n\nThe effect of § 53a-23 is to require a person to submit to an arrest, even if he or she believes, and ultimately it is determined, that the arrest is illegal.  This provision must be charged in conjunction with the crimes of Interfering with an Officer (§ 53a-167a) or Assault on Public Safety or Emergency Medical Personnel (§ 53a-167c).  See Interfering with an Officer, Instruction 4.3-1, and Assault of Public Safety or Emergency Medical Personnel, Instruction 4.3-3.\n\nDelaware \nA person is guilty of resisting arrest with force or violence when: (1) The person intentionally prevents or attempts to prevent a police officer from effecting an arrest or detention of the person or another person by use of force or violence towards said police officer, or (2) Intentionally flees from a police officer who is effecting an arrest against them by use of force or violence towards said police officer, or (3) Injures or struggles with said police officer causing injury to the police officer. Resisting arrest with force or violence is a class G felony. (b) A person is guilty of resisting arrest when the person intentionally prevents or attempts to prevent a peace officer from effecting an arrest or detention of the person or another person or intentionally flees from a peace officer who is effecting an arrest. Resisting arrest is a class A misdemeanor.\n\nFlorida \nResisting officer without violence to his or her person.—Whoever shall resist, obstruct, or oppose any officer as defined in s. 943.10(1), (2), (3), (6), (7), (8), or (9); member of the Florida Commission on Offender Review or any administrative aide or supervisor employed by the commission; county probation officer; parole and probation supervisor; personnel or representative of the Department of Law Enforcement; or other person legally authorized to execute process in the execution of legal process or in the lawful execution of any legal duty, without offering or doing violence to the person of the officer, shall be guilty of a misdemeanor of the first degree, punishable as provided in s. 775.082 or s. 775.083.\n\nGeorgia \nObstructing or hindering law enforcement officers:\n\nExcept as otherwise provided in subsection (b) of this Code section, a person who knowingly and willfully obstructs or hinders any law enforcement officer in the lawful discharge of his official duties is guilty of a misdemeanor. (b) Whoever knowingly and willfully resists, obstructs, or opposes any law enforcement officer, prison guard, correctional officer, probation supervisor, parole supervisor, or conservation ranger in the lawful discharge of his official duties by offering or doing violence to the person of such officer or legally authorized person is guilty of a felony and shall, upon conviction thereof, be punished by imprisonment for not less than one nor more than five years.\n\nHawaii \nA person commits the offense of resisting arrest if the person intentionally prevents a law enforcement officer acting under color of the law enforcement officer's official authority from effecting an arrest by: (a) Using or threatening to use physical force against the law enforcement officer or another; or (b) Using any other means creating a substantial risk of causing bodily injury to the law enforcement officer or another. (2) Resisting arrest is a misdemeanor. [L 1972, c 9, pt of §1; gen ch 1993; am L 2001, c 91, §4]\n\nIdaho \nEvery person who willfully resists, delays or obstructs any public officer, in the discharge, or attempt to discharge, of any duty of his office or who knowingly gives a false report to any peace officer, when no other punishment is prescribed, is punishable by a fine not exceeding one thousand dollars ($1,000), and imprisonment in the county jail not exceeding one (1) year.\n\nIllinois \nA person who knowingly resists or obstructs the performance by one known to the person to be a peace officer, firefighter, or correctional institution employee of any authorized act within his or her official capacity commits a Class A misdemeanor.\n\nIndiana \nA person who knowingly or intentionally: (1) forcibly resists, obstructs, or interferes with a law enforcement officer or a person assisting the officer while the officer is lawfully engaged in the execution of the officer's duties; (2) forcibly resists, obstructs, or interferes with the authorized service or execution of a civil or criminal process or order of a court; or (3) flees from a law enforcement officer after the officer has, by visible or audible means, including operation of the law enforcement officer's siren or emergency lights, identified himself or herself and ordered the person to stop; commits resisting law enforcement, a Class A misdemeanor, except as provided in subsection (b)(b) The offense under subsection (a) is a: (1) Class D felony if: (A) the offense is described in subsection (a)(3) and the person uses a vehicle to commit the offense; or(B) while committing any offense described in subsection (a), the person draws or uses a deadly weapon, inflicts bodily injury on or otherwise causes bodily injury to another person, or operates a vehicle in a manner that creates a substantial risk of bodily injury to another person; (2) Class C felony if, while committing any offense described in subsection (a), the person operates a vehicle in a manner that causes serious bodily injury to another person; and (3) Class B felony if, while committing any offense described in subsection (a), the person operates a vehicle in a manner that causes the death of another person. (c) For purposes of this section, a law enforcement officer includes an enforcement officer of the alcohol and tobacco commission and a conservation officer of the department of natural resources. (d) If a person uses a vehicle to commit a felony offense under subsection (b)(1)(B), (b)(2), or (b)(3), as part of the criminal penalty imposed for the offense, the court shall impose a minimum executed sentence of at least: (1) thirty (30) days, if no prior unrelated conviction under this section exists; (2) one hundred eighty (180) days, if one (1) prior unrelated conviction; (3) one (1) year, if two (2) plus unrelated convictions. (e) Mandatory minimum may not be suspended, IC 35-50-2-2 and IC 35-50-3-1.\n\nIowa \nA person is not authorized to use force to resist an arrest, either of the person's self, or another which the person knows is being made either by a peace officer or by a private person summoned and directed by a peace officer to make the arrest, even if the  person believes that the arrest is unlawful or the arrest is in fact unlawful.\n\nKansas \nInterference with law enforcement: (1) Falsely reporting to a law enforcement officer or state investigative agency:(A) That a particular person has committed a crime, knowing that such information is false and intending that the officer or agency shall act in reliance upon such information; or (B) any information, knowing that such information is false and intending to influence, impede or obstruct such officer's or agency's duty (2) concealing, destroying or materially altering evidence with the intent to prevent or hinder the apprehension or prosecution of any person; or (3) knowingly obstructing, resisting or opposing any person authorized by law to serve process in the service or execution or in the attempt to serve or execute any writ, warrant, process or order of a court, or in the discharge of any official duty. (b) (1) Interference with law enforcement as defined in subsection (a)(1) or (a)(2) is a class A nonperson misdemeanor, except as provided in subsection (b)(2).\n\nKentucky \nA person is guilty of resisting arrest when he intentionally prevents or attempts to prevent a peace officer, recognized to be acting under color of his official authority, from effecting an arrest of the actor or another by: (a) Using or threatening to use physical force or violence against the peace officer or another; or (b) Using any other means creating a substantial risk of causing physical injury to the peace officer or another. (2) Resisting arrest is a Class A misdemeanor.\n\nLouisiana \nResisting an officer is the intentional interference with, opposition or resistance to, or obstruction of an individual acting in his official capacity and authorized by law to make a lawful arrest, lawful detention, or seizure of property or to serve any lawful process or court order when the offender knows or has reason to know that the person arresting, detaining, seizing property, or serving process is acting in his official capacity. B. (1) The phrase \"obstruction of\" as used herein shall, in addition to its common meaning, signification, and connotation mean the following: (a) Flight by one sought to be arrested before the arresting officer can restrain him and after notice is given that he is under arrest. (b) Any violence toward or any resistance or opposition to the arresting officer after the arrested party is actually placed under arrest and before he is incarcerated in jail. (c) Refusal by the arrested or detained party to give his name and make his identity known to the arresting or detaining officer or providing false information regarding the identity of such party to the officer. (d) Congregation with others on a public street and refusal to move on when ordered by the officer. (2) The word \"officer\" as used herein means any peace officer, as defined in R.S. 40:2402, and includes deputy sheriffs, municipal police officers, probation and parole officers, city marshals and deputies, and wildlife enforcement agents. C. Whoever commits the crime of resisting an officer shall be fined not more than five hundred dollars or be imprisoned for not more than six months, or both.\n\nMaine \nRefusing to submit to arrest or detention. A person is guilty of refusing to submit to an arrest or a detention if, with the intent to hinder, delay or prevent a law enforcement officer from effecting the arrest or detention, that person: A. Uses physical force against the law enforcement officer; or B. Creates a substantial risk of bodily injury to the law enforcement officer. 2. It is a defense to prosecution under this section that: A. The person knew that the law enforcement officer knew that the arrest or detention was illegal; or B. The person reasonably believed that the person attempting to effect the arrest or detention was not a law enforcement officer. 3. Refusing to submit to an arrest or a detention is a Class D crime.\n\nMaryland \n\"Police officer\" defined.- In this section, \"police officer\" means an individual who is authorized to make an arrest under Title 2 of the Criminal Procedure Article. (b) Prohibited.- A person may not intentionally: (1) resist a lawful arrest; or (2) interfere with an individual who the person has reason to know is a police officer who is making or attempting to make a lawful arrest or detention of another person. (c) Penalty.- A person who violates this section is guilty of a misdemeanor and is subject to imprisonment not exceeding 3 years or a fine not exceeding $5,000 or both. (d) Unit of prosecution.- The unit of prosecution for a violation of this section is based on the arrest or detention regardless of the number of police officers involved in the arrest or detention.\n\nMassachusetts \nRESISTING ARREST The defendant is charged with resisting arrest. Section 32B of chapter 268 of our General Laws provides as follows: “A person commits the crime of resisting arrest if he [she] knowingly prevents or attempts to prevent a police officer, acting under color of his [her] official authority, from effecting an arrest of [himself] or another [either] by using or threatening to use physical force or violence against the police officer or another; or [by] using any other means which creates a substantial risk of causing bodily injury to such police officer or another.” In order to prove the defendant guilty of this offense, the Commonwealth must prove four things beyond a reasonable doubt: First: That the defendant prevented or attempted to prevent a police officer from making an arrest (of the defendant) (or) (of another person); Second: That the officer was acting under color of his (her) official authority at the time; Third: That the defendant resisted: either by using, or threatening to use, physical force or violence against the police officer (or another person); or by using some other means which created a substantial risk of causing bodily injury to the police officer (or another person); and Fourth: That the defendant did so knowingly; that is to say, that the defendant knew at the time that he (she) was acting to prevent an arrest by a police officer acting under color of his (her) official authority. As I have indicated, the Commonwealth must prove that the police officer was acting “under color of official authority.” A police officer acts “under color of official authority” when, in the regular course of assigned duties, he (she) makes a judgment in good faith, based on the surrounding facts and circumstances, that he (she) should make an arrest.\n\nMichigan \nAssaulting, battering, resisting, obstructing, opposing person performing duty; felony; penalty; other violations; consecutive terms; definitions:\n\nExcept as provided in subsections (2), (3), and (4), an individual who assaults, batters, wounds, resists, obstructs, opposes, or endangers a person who the individual knows or has reason to know is performing his or her duties is guilty of a felony punishable by imprisonment for not more than 2 years or a fine of not more than $2,000.00, or both. (2) An individual who assaults, batters, wounds, resists, obstructs, opposes, or endangers a person who the individual knows or has reason to know is performing his or her duties causing a bodily injury requiring medical attention or medical care to that person is guilty of a felony punishable by imprisonment for not more than 4 years or a fine of not more than $5,000.00, or both. (3) An individual who assaults, batters, wounds, resists, obstructs, opposes, or endangers a person who the individual knows or has reason to know is performing his or her duties causing a serious impairment of a body function of that person is guilty of a felony punishable by imprisonment for not more than 15 years or a fine of not more than $10,000.00, or both. (4) An individual who assaults, batters, wounds, resists, obstructs, opposes, or endangers a person who the individual knows or has reason to know is performing his or her duties causing the death of that person is guilty of a felony punishable by imprisonment for not more than 20 years or a fine of not more than $20,000.00, or both. (5) This section does not prohibit an individual from being charged with, convicted of, or punished for any other violation of law that is committed by that individual while violating this section. (6) A term of imprisonment imposed for a violation of this section may run consecutively to any term of imprisonment imposed for another violation arising from the same transaction. (7) As used in this section: (a) \"Obstruct\" includes the use or threatened use of physical interference or force or a knowing failure to comply with a lawful command. (b) \"Person\" means any of the following: (i) A police officer of this state or of a political subdivision of this state including, but not limited to, a motor carrier officer or capitol security officer of the department of state police. (ii) A police officer of a junior college, college, or university who is authorized by the governing board of that junior college, college, or university to enforce state law and the rules and ordinances of that junior college, college, or university. (iii) A conservation officer of the department of natural resources or the department of environmental quality. (iv) A conservation officer of the United States department of the interior. (v) A sheriff or deputy sheriff. (vi) A constable. (vii) A peace officer of a duly authorized police agency of the United States, including, but not limited to, an agent of the secret service or department of justice. (viii) A firefighter. (ix) Any emergency medical service personnel described in section 20950 of the public health code, 1978 PA 368, MCL 333.20950. (x) An individual engaged in a search and rescue operation as that term is defined in section 50c.(c) \"Serious impairment of a body function\" means that term as defined in section 58c of the Michigan vehicle code, 1949 PA 300, MCL 257.58c.\n\nMinnesota \nObstructing Legal Process, Arrest, or Firefighting:\n\nobstructs, hinders, or prevents the lawful execution of any legal process, civil or criminal, or apprehension of another on a charge or conviction of a criminal offense; (2) obstructs, resists, or interferes with a peace officer while the officer is engaged in the performance of official duties; (3) interferes with or obstructs a firefighter while the firefighter is engaged in the performance of official duties; (4) interferes with or obstructs a member of an ambulance service personnel crew, as defined in section144E.001, subdivision 3a, who is providing, or attempting to provide, emergency care; or (5) by force or threat of force endeavors to obstruct any employee of the Department of Revenue while the employee is lawfully engaged in the performance of official duties for the purpose of deterring or interfering with the performance of those duties.\n\nMississippi \nIt shall be unlawful for any person to obstruct or resist by force, or violence, or threats, or in any other manner, his lawful arrest or the lawful arrest of another person by any state, local or federal law enforcement officer, and any person or persons so doing shall be guilty of a misdemeanor, and upon conviction thereof, shall be punished by a fine of not more than Five Hundred Dollars ($500.00), or by imprisonment in the county jail not more than six (6) months, or both.\n\nMissouri \nA person commits the offense of resisting or interfering with arrest, detention, or stop if he or she knows or reasonably should know that a law enforcement officer is making an arrest or attempting to lawfully detain or stop an individual or vehicle, and for the purpose of preventing the officer from effecting the arrest, stop or detention, he or she: (1) Resists the arrest, stop or detention of such person by using or threatening the use of violence or physical force or by fleeing from such officer; or (2) Interferes with the arrest, stop or detention of another person by using or threatening the use of violence, physical force or physical interference. 2. This section applies to: (1) Arrests, stops, or detentions, with or without warrants; (2) Arrests, stops, or detentions, for any offense, infraction, or ordinance violation; and (3) Arrests for warrants issued by a court or a probation and parole officer. 3. A person is presumed to be fleeing a vehicle stop if he or she continues to operate a motor vehicle after he or she has seen or should have seen clearly visible emergency lights or has heard or should have heard an audible signal emanating from the law enforcement vehicle pursuing him or her. 4. It is no defense to a prosecution pursuant to subsection 1 of this section that the law enforcement officer was acting unlawfully in making the arrest. However, nothing in this section shall be construed to bar civil suits for unlawful arrest. 5. The offense of resisting or interfering with an arrest is a class E felony for an arrest for a: (1) Felony; (2) Warrant issued for failure to appear on a felony case; or (3) Warrant issued for a probation violation on a felony case. The offense of resisting an arrest, detention or stop in violation of subdivision (1) or (2) of subsection 1 of this section is a class A misdemeanor, unless the person fleeing creates a substantial risk of serious physical injury or death to any person, in which case it is a class E felony.\n\nMontana \nObstructing a Peace Officer or Public Servant:\n\nA person commits the offense of obstructing a peace officer or public servant if the person knowingly obstructs, impairs, or hinders the enforcement of the criminal law, the preservation of the peace, or the performance of a governmental function, including service of process. (2) It is no defense to a prosecution under this section that the peace officer was acting in an illegal manner, provided that the peace officer was acting under the peace officer's official authority. (3) A person convicted of the offense of obstructing a peace officer or other public servant, including a person serving process, shall be fined not to exceed $500 or be imprisoned in the county jail for a term not to exceed 6 months, or both.\n\nNebraska \nA person commits the offense of resisting arrest if, while intentionally preventing or attempting to prevent a peace officer, acting under color of his or her official authority, from effecting an arrest of the actor or another, he or she: (a) Uses or threatens to use physical force or violence against the peace officer or another; or (b) Uses any other means which creates a substantial risk of causing physical injury to the peace officer or another; or (c) Employs means requiring substantial force to overcome resistance to effecting the arrest. (2) It is an affirmative defense to prosecution under this section if the peace officer involved was out of uniform and did not identify himself or herself as a peace officer by showing his or her credentials to the person whose arrest is attempted. (3) Resisting arrest is (a) a Class I misdemeanor for the first such offense and (b) a Class IIIA felony for any second or subsequent such offense. (4) Resisting arrest through the use of a deadly or dangerous weapon is a Class IIIA felony.\n\nNevada \nResisting public officer. \n\nA person who, in any case or under any circumstances not otherwise specially provided for, willfully resists, delays or obstructs a public officer in discharging or attempting to discharge any legal duty of his or her office shall be punished: 1. Where a firearm is used in the course of such resistance, obstruction or delay, or the person intentionally removes, takes or attempts to remove or take a firearm from the person of, or the immediate presence of, the public officer in the course of such resistance, obstruction or delay, for a category C felony as provided in NRS 193.130.2. Where a dangerous weapon, other than a firearm, is used in the course of such resistance, obstruction or delay, or the person intentionally removes, takes or attempts to remove or take a weapon, other than a firearm, from the person of, or the immediate presence of, the public officer in the course of such resistance, obstruction or delay, for a category D felony as provided in NRS 193.130.3. Where no dangerous weapon is used in the course of such resistance, obstruction or delay, for a misdemeanor.\n\nNew Hampshire \nA person is guilty of a misdemeanor when the person knowingly or purposely physically interferes with a person recognized to be a law enforcement official, including a probation or parole officer, seeking to effect an arrest or detention of the person or another regardless of whether there is a legal basis for the arrest. A person is guilty of a class B felony if the act of resisting arrest or detention causes serious bodily injury, as defined in RSA 625:11, VI, to another person. Verbal protestations alone shall not constitute resisting arrest or detention.\n\nNew Jersey \nExcept as provided in paragraph (3), a person is guilty of a disorderly persons offense if he purposely prevents or attempts to prevent a law enforcement officer from effecting an arrest. (2) Except as provided in paragraph (3), a person is guilty of a crime of the fourth degree if he, by flight, purposely prevents or attempts to prevent a law enforcement officer from effecting an arrest. (3) An offense under paragraph (1) or (2) of subsection a. is a crime of the third degree if the person: (a) Uses or threatens to use physical force or violence against the law enforcement officer or another; or (b) Uses any other means to create a substantial risk of causing physical injury to the public servant or another. It is not a defense to a prosecution under this subsection that the law enforcement officer was acting unlawfully in making the arrest, provided he was acting under color of his official authority and provided the law enforcement officer announces his intention to arrest prior to the resistance.\n\nNew Mexico \nknowingly obstructing, resisting or opposing any officer of this state or any other duly authorized person serving or attempting to serve or execute any process or any rule or order of any of the courts of this state or any other judicial writ or process; B. intentionally fleeing, attempting to evade or evading an officer of this state when the person committing the act of fleeing, attempting to evade or evasion has knowledge that the officer is attempting to apprehend or arrest him; C. willfully refusing to bring a vehicle to a stop when given a visual or audible signal to stop, whether by hand, voice, emergency light, flashing light, siren or other signal, by a uniformed officer in an appropriately marked police vehicle; D. resisting or abusing any judge, magistrate or peace officer in the lawful discharge of his duties. Whoever commits resisting, evading or obstructing an officer is guilty of a misdemeanor.\n\nNew York \nA person is guilty of resisting arrest when he intentionally prevents or attempts to prevent a police officer or peace officer from effecting an authorized arrest of himself or another person. Resisting arrest is a class A misdemeanor.\n\nNorth Carolina \nResisting officers. If any person shall willfully and unlawfully resist, delay or obstruct a public officer in discharging or attempting to discharge a duty of his office, he shall be guilty of a Class 2 misdemeanor.\n\nNorth Dakota \nA person is guilty of a class A misdemeanor if, with intent to prevent a public servant\nfrom effecting an arrest of himself or another for a misdemeanor or infraction, or from\ndischarging any other official duty, he creates a substantial risk of bodily injury to the\npublic servant or to anyone except himself, or employs means justifying or requiring\nsubstantial force to overcome resistance to effecting the arrest or the discharge of the\nduty. A person is guilty of a class C felony if, with intent to prevent a public servant\nfrom effecting an arrest of himself or another for a class A, B, or C felony, he creates a\nsubstantial risk of bodily injury to the public servant or to anyone except himself, or\nemploys means justifying or requiring substantial force to overcome resistance to\neffecting such an arrest.\n2. It is a defense to a prosecution under this section that the public servant was not\nacting lawfully, but it is no defense that the defendant mistakenly believed that the\npublic servant was not acting lawfully. A public servant executing a warrant or other\nprocess in good faith and under color of law shall be deemed to be acting lawfully.\n\nOhio \nNo person, recklessly or by force, shall resist or interfere with a lawful arrest of the person or another. (B) No person, recklessly or by force, shall resist or interfere with a lawful arrest of the person or another person and, during the course of or as a result of the resistance or interference, cause physical harm to a law enforcement officer. (C) No person, recklessly or by force, shall resist or interfere with a lawful arrest of the person or another person if either of the following applies: (1) The offender, during the course of or as a result of the resistance or interference, recklessly causes physical harm to a law enforcement officer by means of a deadly weapon; (2) The offender, during the course of the resistance or interference, brandishes a deadly weapon. (D) Whoever violates this section is guilty of resisting arrest. A violation of division (A) of this section is a misdemeanor of the second degree. A violation of division (B) of this section is a misdemeanor of the first degree. A violation of division (C) of this section is a felony of the fourth degree.(E) As used in this section, \"deadly weapon\" has the same meaning as in section 2923.11 of the Revised Code.\n\nOklahoma \nNo person may be convicted of resisting a/an peace/executive officer unless the State has proved beyond a reasonable doubt each element of the crime. These elements are: First, knowingly. Second, by the use of force/violence. Third, resisting. Fourth, a/an peace/executive officer. Fifth, in the performance of his/her official duties.\n\nOregon \nA person commits the crime of resisting arrest if the person intentionally resists a person known by the person to be a peace officer or parole and probation officer in making an arrest.(2)As used in this section: (a) Arrest has the meaning given that term in ORS 133.005(Definitions for ORS 133.005 to 133.400 and 133.410 to 133.450) and includes, but is not limited to, the booking process. (b) Parole and probation officer has the meaning given that term in ORS 181.610 (Definitions for ORS 181.610 to 181.712). (c) Resists means the use or threatened use of violence, physical force or any other means that creates a substantial risk of physical injury to any person and includes, but is not limited to, behavior clearly intended to prevent being taken into custody by overcoming the actions of the arresting officer. The behavior does not have to result in actual physical injury to an officer. Passive resistance does not constitute behavior intended to prevent being taken into custody. (3) It is no defense to a prosecution under this section that the peace officer or parole and probation officer lacked legal authority to make the arrest or book the person, provided the officer was acting under color of official authority. (4) Resisting arrest is a Class A misdemeanor. [1971 c.743 §206; 1989 c.877 §1; 1997 c.749 §3;\n\nPennsylvania \nA person commits a misdemeanor of the second degree if, with the intent of preventing a public servant from effecting a lawful arrest or discharging any other duty, the person creates a substantial risk of bodily injury to the public servant or anyone else, or employs means justifying or requiring substantial force to overcome the resistance.\n\nRhode Island \n(a) It shall be unlawful for any person to use force or any weapon in resisting a legal or an illegal arrest by a peace officer, if the person has reasonable ground to believe that he or she is being arrested and that the arrest is being made by a peace officer. (b) Any person violating the provisions of this section shall be punished by a fine of not more than five hundred dollars ($500) or by imprisonment for not more than one year, or by both fine and imprisonment.\n\nSouth Carolina \nIt is unlawful for a person knowingly and willfully to interfere or resist a law enforcement officer or other authorized person in serving, executing, or attempting to serve or execute a legal, criminal, or civil writ or process or to resist an arrest being made by one whom the person knows or reasonably should know is a law enforcement officer or other authorized person, whether under process or not. A person who violates the provisions of this subsection is guilty of a misdemeanor and, upon conviction, for a: (1) first offense, must be fined not less than five hundred dollars nor more than one thousand dollars or imprisoned not more than one year, or both; (2) second offense, must be fined not less than one thousand dollars nor more than two thousand dollars or imprisoned not more than two years, or both; and (3) third or subsequent offense, must be fined not less than three thousand dollars nor more than five thousand dollars or imprisoned not less than two years, or both.\n\nSouth Dakota \nAny person who intentionally prevents or attempts to prevent a law enforcement officer, acting under color of authority, from effecting an arrest of the actor or another, by: (1) Using or threatening to use physical force or violence against the law enforcement officer or any other person; or (2) Using any other means which creates a substantial risk of causing physical injury to the law enforcement officer or any other person;is guilty of resisting arrest. Resisting arrest is a Class 1 misdemeanor.\n\nTennessee \nIt is an offense for a person to intentionally prevent or obstruct anyone known to the person to be a law enforcement officer, or anyone acting in a law enforcement officer's presence and at the officer's direction, from effecting a stop, frisk, halt, arrest or search of any person, including the defendant, by using force against the law enforcement officer or another. (b) Except as provided in § 39-11-611, it is no defense to prosecution under this section that the stop, frisk, halt, arrest or search was unlawful. (c) It is an offense for a person to intentionally prevent or obstruct an officer of the state or any other person known to be a civil process server in serving, or attempting to serve or execute, any legal writ or process. (d) A violation of this section is a Class B misdemeanor unless the defendant uses a deadly weapon to resist the stop, frisk, halt, arrest, search or process server, in which event the violation is a Class A misdemeanor.\n\nTexas \nTexas Penal Code. (a) A person commits an offense if he intentionally prevents or obstructs a person he knows is a peace officer or a person acting in a peace officer's presence and at his direction from effecting an arrest, search, or transportation of the actor or another by using force against the peace officer or another. (b) It is no defense to prosecution under this section that the arrest or search was unlawful. (c) Except as provided in Subsection (d), an offense under this section is a Class A misdemeanor. (d) An offense under this section is a felony of the third degree if the actor uses a deadly weapon to resist the arrest or search.\n\nThe crime of \"evading arrest or detention\" is distinct from the crime of \"resisting arrest, search, or transportation.\" A person commits the offense of evading arrest if \"he intentionally flees from a person he knows is a peace officer or federal special investigator attempting lawfully to arrest or detain him.\" Evading arrest is a misdemeanor when committed without aggravating factors, but is a felony if the actor has a previous conviction for it, the actor uses a vehicle while in flight, or \"another suffers serious bodily injury as a direct result of an attempt by the officer or investigator from whom the actor is fleeing to apprehend the actor while the actor is in flight.\"\n\nUtah \nInterference with arresting officer.\n\nA person is guilty of a class B misdemeanor if he has knowledge, or by the exercise of reasonable care should have knowledge, that a peace officer is seeking to effect a lawful arrest or detention of that person or another and interferes with the arrest or detention by: (1) use of force or any weapon; (2) the arrested person's refusal to perform any act required by lawful order: (a) necessary to effect the arrest or detention; and (b) made by a peace officer involved in the arrest or detention; or (3) the arrested person's or another person's refusal to refrain from performing any act that would impede the arrest or detention.\n\nVermont \nA person who intentionally attempts to prevent a lawful arrest on himself or herself, which is being effected or attempted by a law enforcement officer, when it would reasonably appear that the latter is a law enforcement officer, shall: (1) for the first offense, be imprisoned not more than one year or fined not more than $500.00, or both; (2) for the second offense and subsequent offenses, be imprisoned not more than two years or fined not more than $1,000.00, or both. (b) A defendant's mistaken belief in the unlawfulness of the arrest shall not be a defense to a prosecution under this section. (c) A person may not be convicted of both an escape from lawful custody, as defined in subdivision 1501(a)(2) of this title, and a violation of this section.\n\nVirginia \nAny person who intentionally prevents or attempts to prevent a law-enforcement officer from lawfully arresting him, with or without a warrant, is guilty of a Class 1 misdemeanor. For purposes of this section, intentionally preventing or attempting to prevent a lawful arrest means fleeing from a law-enforcement officer when (i) the officer applies physical force to the person, or (ii) the officer communicates to the person that he is under arrest and (a) the officer has the legal authority and the immediate physical ability to place the person under arrest, and (b) a reasonable person who receives such communication knows or should know that he is not free to leave.\n\nWashington \nA person is guilty of resisting arrest if he or she intentionally prevents or attempts to prevent a peace officer from lawfully arresting him or her. (2) Resisting arrest is a misdemeanor.\n\nWest Virginia \nA person who by threats, menaces, acts or otherwise forcibly or illegally hinders or obstructs or attempts to hinder or obstruct a law-enforcement officer, probation officer or parole officer acting in his or her official capacity is guilty of a misdemeanor and, upon conviction thereof, shall be fined not less than $50 nor more than $500 or confined in jail not more than one year, or both fined and confined. (b) A person who intentionally disarms or attempts to disarm a law-enforcement officer, correctional officer, probation officer or parole officer, acting in his or her official capacity, is guilty of a felony and, upon conviction thereof, shall be imprisoned in a state correctional facility not less than one nor more than five years. (c) A person who, with intent to impede or obstruct a law-enforcement officer in the conduct of an investigation of a felony offense, knowingly and willfully makes a materially false statement is guilty of a misdemeanor and, upon conviction thereof, shall be fined not less than $25 nor more than $200, or confined in jail for five days, or both fined and confined. The provisions of this section do not apply to statements made by a spouse, parent, stepparent, grandparent, sibling, half sibling, child, stepchild or grandchild, whether related by blood or marriage, of the person under investigation. Statements made by the person under investigation may not be used as the basis for prosecution under this subsection. For purposes of this subsection, \"law-enforcement officer\" does not include a watchman, a member of the West Virginia State Police or college security personnel who is not a certified law-enforcement officer. (d) A person who intentionally flees or attempts to flee by any means other than the use of a vehicle from a law-enforcement officer, probation officer or parole officer acting in his or her official capacity who is attempting to make a lawful arrest of the person, and who knows or reasonably believes that the officer is attempting to arrest him or her, is guilty of a misdemeanor and, upon conviction thereof, shall be fined not less than $50 nor more than $500 or confined in jail not more than one year, or both fined and confined. (e) A person who intentionally flees or attempts to flee in a vehicle from a law-enforcement officer, probation officer or parole officer acting in his or her official capacity after the officer has given a clear visual or audible signal directing the person to stop is guilty of a misdemeanor and, upon conviction thereof, shall be fined not less than $500 nor more than $1,000 and shall be confined in l jail not more than one year. (f) A person who intentionally flees or attempts to flee in a vehicle from a law-enforcement officer, probation officer or parole officer acting in his or her official capacity after the officer has given a clear visual or audible signal directing the person to stop, and who operates the vehicle in a manner showing a reckless indifference to the safety of others, is guilty of a felony and, upon conviction thereof, shall be fined not less than $1,000 nor more than $2,000 and shall be imprisoned in a state correctional facility not less than one nor more than five years. (g) A person who intentionally flees or attempts to flee in a vehicle from a law-enforcement officer, probation officer or parole officer acting in his or her official capacity after the officer has given a clear visual or audible signal directing the person to stop, and who causes damage to the real or personal property of a person during or resulting from his or her flight, is guilty of a misdemeanor and, upon conviction thereof, shall be fined not less than $1,000 nor more than $3,000 and shall be confined in jail for not less than six months nor more than one year. (h) A person who intentionally flees or attempts to flee in a vehicle from a law-enforcement officer, probation officer or parole officer acting in his or her official capacity after the officer has given a clear visual or audible signal directing the person to stop, and who causes bodily injury to a person during or resulting from his or her flight, is guilty of a felony and, upon conviction thereof, shall be imprisoned in a state correctional facility not less than three nor more than ten years. (i) A person who intentionally flees or attempts to flee in a vehicle from a law-enforcement officer, probation officer or parole officer acting in his or her official capacity after the officer has given a clear visual or audible signal directing the person to stop, and who causes death to a person during or resulting from his or her flight, is guilty of a felony and, upon conviction thereof, shall be imprisoned in a state correctional facility for not less than five nor more than fifteen years. A person imprisoned pursuant to this subsection is not eligible for parole prior to having served a minimum of three years of his or her sentence or the minimum period required by section thirteen, article twelve, chapter sixty-two of this code, whichever is greater. (j) A person who intentionally flees or attempts to flee in a vehicle from a law-enforcement officer, probation officer or parole officer acting in his or her official capacity after the officer has given a clear visual or audible signal directing the person to stop, and who is under the influence of alcohol, controlled substances or drugs, is guilty of a felony and, upon conviction thereof, shall be imprisoned in a state correctional facility not less than three nor more than ten years. (k) For purposes of this section, the term \"vehicle\" includes any motor vehicle, motorcycle, motorboat, all-terrain vehicle or snowmobile as those terms are defined in section one, article one, chapter seventeen-a of this code, whether or not it is being operated on a public highway at the time and whether or not it is licensed by the state. (l) For purposes of this section, the terms \"flee\", \"fleeing\" and \"flight\" do not include a person's reasonable attempt to travel to a safe place, allowing the pursuing law-enforcement officer to maintain appropriate surveillance, for the purpose of complying with the officer's direction to stop.(m) The revisions to subsections (e), (f), (g) and (h) of this section enacted during the regular session of the 2010 regular legislative session shall be known as the Jerry Alan Jones Act.\n\nWisconsin \nFailure to comply with officer's attempt to take person into custody:\n\nIn this section, \"officer\" has the meaning given in s. 946.41 (2) (b).(2) Whoever intentionally does all of the following is guilty of a Class I felony: (a) Refuses to comply with an officer's lawful attempt to take him or her into custody. (b) Retreats or remains in a building or place and, through action or threat, attempts to prevent the officer from taking him or her into custody. (c) While acting under pars. (a) and (b), remains or becomes armed with a dangerous weapon or threatens to use a dangerous weapon regardless of whether he or she has a dangerous weapon.This section delineates one crime: a suspect's armed, physical refusal to be taken into custody. It can be committed by action or threat, which are alternative ways of threatening an officer to avoid being taken into custody. A jury instruction requiring unanimity on which occurred is not required.\n\nWyoming \nNo person shall willfully resist the chief of police or any other member of the police department, or other member of any law enforcement department, in the discharge of his duties, if known to be or identified as a police officer.B.No person shall, in any manner, wilfully assist any person in the custody of the chief of police or other police officer, or any other law enforcement officer, to escape, or rescue or attempt to rescue any other person so in custody.C.No person shall wilfully, in any way, interfere, hinder or prevent the chief of police or any other member of the police department, or any other law enforcement officer, from discharging his lawful duties.D.Any person convicted of violating any provision of this section is guilty of a misdemeanor and shall be punished as provided by Chapter 1.28 of this code.\n\nSee also\n All-points bulletin\n Contempt of cop\n Crime scene getaway\n Fugitive\n Obstructing government administration\n Plummer v. State\n Probable cause\n\nReferences\nExample code  from New Jersey\n\nCriminal law\nLaw enforcement terminology"
}