{
  "title": "Robert Rantoul Jr.",
  "content": "Robert Rantoul Jr. (August 13, 1805August 7, 1852) was an American lawyer and politician from Massachusetts.\n\nRantoul was a member of the Massachusetts House of Representatives (1835–1839), the commission to revise the laws of Massachusetts, and the Massachusetts Board of Education (1837–1842). He was the United States Attorney for the District of Massachusetts (1846–1849). He was elected in 1850 to the United States House of Representatives for the 32nd Congress. Before his term there began, he was named as a Democrat to the United States Senate to fill the vacancy caused by the resignation of Robert Charles Winthrop, who had been appointed after the resignation of Daniel Webster and resigned when he failed to win election to a full term. Rantoul served in the Senate from February 1 to March 3, 1851, and then in the House from March 4, 1851, until his death. He was buried in Central Cemetery, Beverly, Massachusetts. Rantoul had a wife, Jane Elizabeth Woodbury, and two children, Robert S. Rantoul and Charles W. Rantoul.\n\nEarly life\nRantoul was born on August 13, 1805, in Beverly, Massachusetts. He was the eldest son of Robert and Joanna Lovett Rantoul. He attended the common schools and Phillips Andover Academy and graduated from Harvard University in 1826.\n\nFrom his early years, Rantoul exhibited a precociousness, maturity, and love for learning that made an indelible impression on those around him.  As a child, Rantoul was known for his \"ingeniousness, veracity, modesty, docility, and tender conscientiousness.\" An extract taken from his childhood journal, written at age 8, reads: \"Jan. 4, 1814. Gained the following idea, namely, that I had better sometimes be imposed upon, than never to trust.\"\n\nAt age 14, Rantoul enrolled at Phillips Andover Academy, where he would study under the tutelage of the famous educator John Adams. Recalling Rantoul, one Andover classmate stated: \"The trait which impressed me the most, was his unquestionable thirst for knowledge, which he sought for gratification in every field of human inquiry. Whatever arrested his attention, whether it were a paper in the Spectator, a speech in Congress, a new poem in Lord Byron's, or recent invention in the arts, it absorbed all his faculties, and was thoroughly mastered and digested before he left it.\"\n\nIn 1822, Rantoul entered the freshman class at Harvard College. At Harvard, Rantoul was described as \"indefatigably industrious.\" By some accounts, Rantoul spent 14 hours a day studying, though he preferred to study subjects according to his own intellectual interests, rather than follow the prescribed college course.\n\nProfessional life\nAfter graduating from Harvard in 1826, Rantoul began studying law in Salem, Massachusetts, under the tutelage of John Pickering and later under the Hon. Leverett Saltonstall. In 1829, Rantoul was admitted to the Massachusetts state bar. In 1830, Rantoul took his first case: the defense of one Knapps for the murder of one Mr. White, a wealthy and well-liked man from Salem. Rantoul's decision to defend Knapps was unpopular amongst the citizens of Salem, and Rantoul knew it. Public feelings toward the accused in Salem at that time were particularly negative and hostile. This unhappy state of affairs, made Rantoul all the more resolute in his decision to provide counsel to Knapps; Rantoul \"felt in every way the unjust and sickening effects of this excited state of feeling in the public; an excitement which he regarded not only as hostile to the accused, but to the calmness and the fairness of judicial proceedings, in a case of life and death.\" Rantoul's decision to defend Knapps under these circumstances was in many ways symbolic of the type of dedication to fairness and justice that would characterize the remainder of Rantoul's career. Unfortunately, the decision also came at a cost: for his role in the defense of Knapps, Rantoul lost many friends, earned widespread public ire, and was ultimately forced to leave Salem.\n\nUpon leaving Salem, Rantoul moved to South Reading, Massachusetts, in 1830. In 1832, Rantoul move to Gloucester, Massachusetts, where in four successive years he was voted to the Massachusetts state legislature.\n\nIn 1838, Rantoul moved to Boston, Massachusetts. In Boston, Rantoul would come across many of the same challenges that he faced as a young lawyer in Salem, namely opposition from the wealthy and elite whose political views differed so starkly from his own. As a liberal fighting on behalf of the common man in a city so dominated by a wealthy and conservative few, Rantoul earned himself a reputation as \"a bold champion of political justice; an inflexible and eloquent advocate of the rights of man, as above those of property, whether held by individuals, or corporations. He had a sincere and just respect for mental power, exerted in any useful direction, and, especially, for that intelligence, which, triumphing over adverse circumstances, is able to secure success to enterprise and reward to industry. But he had a higher respect for integrity, justice, and truth; a higher respect for the rights of the poor, the weak, and defenceless. He acknowledged no authority in an oligarchy of wealth; no other nobility than that conferred by beneficence to mankind, by services actually rendered to his fellow-creatures.  What he regarded as the humanity and justice of his political opinions, were treated, by the selfish and the arrogant, as treasonable to wealth.  And hence the fact that neither the extent, nor the emoluments of his professional practice, indicated his merit as a lawyer, or its just reward.  In short, he was a democratic lawyer in the city of Boston.\"\n\nWhile in Boston, Rantoul took on a number of landmark cases, always in pursuit of what he believed to be right and just.\n\nCommonwealth v. Hunt\nThe first such case was Commonwealth v. Hunt, known at the time as the Journeymen Boot-Makers' Case, in which Rantoul argued on behalf of an organized labor movement in Massachusetts. The case involved the yet unsettled question of whether labor unions were legal in the United States. After an unfavorable decision at trial, Rantoul appealed the case to the Supreme Judicial Court of Massachusetts where Justice Lemuel Shaw eventually determined that labor organizations were lawful provided they were organized for legal purposes and used legal means to achieve their goals. With this victory, Rantoul \"succeeded in obtaining one of the completest triumphs that it ever fell to the lot of an American lawyer to achieve.\"\n\nRhode Island trials\nIn 1842, Rantoul came to the defense of several individuals charged by the government with attempts \"of a revolutionary character\" for their efforts to extend suffrage to African-Americans in Massachusetts. The defendants were arrested, imprisoned, and tried not in the same county in which they allegedly committed the acts, but in counties where partisan judges and packed juries, \"resembling those of the worst periods of English history were selected as the triers.\" In order \"[t]o unloose this unjust grasp of power, and to save some of the best citizens of Rhode Island from these anti-American and tyrannical modes of proceeding, Mr. Rantoul was employed as leading counsel; and he brought to bear, on the merits of the question, a force of reason, and an extent of learning, which startled and electrified the court, and a convincing eloquence, which drew involuntary outbursts of applause from a numerous and enlightened assembly . . . Even Webster, the opposing counsel, clapped his hands with applause. The rights of the person, and the rights of the state, their relations to each other, and their just limitations, were never perhaps more ably reviewed, or justly defined in a forensic address.\"\n\nThe next day, The Providence Express published the following account of Rantoul's argument in the case: \"The able and conclusive argument of this distinguished gentlemen occupied two hours and a half in the delivery. It was, throughout, the most learned address to which we have ever listened . . . In the hands of some men this subject would have been dull and without interest. Mr. Rantoul made it far otherwise to the crowded audience who listened to him . . . Can a man be tried in one county, for an act charged in the indictment in another county? He argued that he could not be . . . He showed this by examining the object of the institution of jury trials, the sources, and the original form of this institution, the meaning of the terms in Magna Carta, by which trial by his peers is secured to every freeman, the course of the common law in England, since the Great Charter, the statutes in England, in derogation from this common law of England on this point, and the breaking out of the American Revolution . . . Mr. Rantoul set forth the substantial benefits of this right, the growth of which he traced from the times of Alfred and Charlemagne, and conjured the court not to throw away a guarantee which had ripened under the varied experience of a thousand years, for a forced and unnatural construction of a statute, which was itself, at least, of very doubtful constitutionality.\"\n\nSims Case\nIn 1851, Rantoul became involved in one of the most infamous cases in Massachusetts history. On the morning of April 4, 1851, Thomas Sims, an escaped slave arrested in Boston under the Fugitive Slave Act, was being held by guards outside the state courthouse in Boston. On his way to his office, Rantoul noticed the crowd and stopped to ask what was going on, to which someone in the crowd replied: \"They have caught a negro.\" At the request of fellow attorney C.G. Loring, Rantoul made his way into the courthouse. When a friend of Rantoul's went to the court house in search of Rantoul later that morning, he found Rantoul already engaged in the service of counsel for the alleged fugitive without having had a moment's preparation.\n\nAlthough the case was ultimately lost and Sims was returned to servitude, Rantoul is remembered for his willingness to defend Thomas Sims on a moment's notice, his able defense of Sims during trial, and his portentous objection to the constitutionality of the law at issue: the Fugitive Slave Act.\n\nViews\nWhile Rantoul was undoubtedly among the ablest lawyers of his time, and committed to furthering just ends in all manners of cases, many of his strongest efforts to promote social justice came outside of the courtroom. There were certain causes of social reform and progress to which Rantoul was so committed, and to which he would devote so much time and effort, that it was said one could have been in Rantoul's company for weeks at a time without ever being reminded that he was a lawyer or politician. Among these causes were the codification of the common law, the promotion of public education through lyceums, and the abolishment of capital punishment in the United States.\n\nCodification of the law\nThroughout his life, Rantoul was a fierce advocate for the codification of the common law. He believed that judge-made rules were tantamount to judicial legislation, and he argued that freemen should be amenable to no law but the written law as sanctioned by representatives of the people. In 1836, as a member of the Massachusetts House of Representatives, Rantoul delivered a speech summarizing his views on the common law, which read: \"Judge-made law is ex-post facto law, and therefore unjust. An act is not forbidden by statute, but it becomes void by judicial construction. The legislature could not effect this, for the Constitution forbids it . . . . No man can tell what the common law is; therefore it is not law: for the law is a rule of action; but a rule which is unknown can govern no man's conduct. Not withstanding this, [the common law] has been called the perfection of human reason. The Common Law is the perfection of human reason,--just as alcohol is the perfection of sugar. The subtle spirit of the Common Law is reason double distilled, till what was wholesome and nutritive becomes rank poison . . . . The judge makes law, by extorting from precedents something which they do not contain. He extends his precedents, which were themselves the extension of others, till, by this accommodating principle, a whole system of law is built up without the authority or interference of the legislator.\"\n\nThe Massachusetts Legislature eventually established a committee, chaired by Justice Joseph Story, to consider the expediency of codifying the common law of Massachusetts. Although the legal profession of the time continued the historical preference for the common law, one sees echoes of Rantoul's sentiments even today through efforts like the Restatements (summations of common law standards widely adopted by state legislatures as statute) and the judicial trend toward textualist interpretations.\n\nLyceums\nRantoul was also deeply committed to public education. In the winter of 1828–1829, Rantoul established the first Lyceum in New England. These Lyceums served as a center for debate and the exchange of ideas, with the goal of educating the public on matters of wide public significance. At these Lyceums, Rantoul displayed \"that remarkable aptitude for debate, that keen logical acuteness in argument, and those ready and ample resources of wit and learning which afterwards so distinguished him in the courts of law and the halls of legislation.\" Rantoul's ultimate ambition in these Lyceums, however, was not to dazzle crowds with oration for oration's sake, but to begin a discourse on important matters and convince the public of what he believed to be right and true.  In 1833, Rantoul published An Address to the Workingmen of the United States of America as one of the first numbers of a series of tracts published by the Committee of the Middlesex County Lyceum.\n\nCapital punishment\nOwing to the influence of his father, who was himself strongly against the death penalty, Rantoul was from his earliest days a strong advocate for the abolishment of capital punishment. In 1835, Rantoul formed a committee in the Massachusetts State Legislature to propose the repeal of all capital punishment laws in the state. On March 31, 1835, Rantoul delivered a speech in support of the proposed repeal of the death penalty, leading all but 13 members of the house to vote in favor of the proposal. His floor speeches on the subject of capital punishment were printed, and eventually became so widely distributed that they became regarded as authoritative in France, Belgium, Germany, and Italy. Years later, upon learning of Rantoul's death, U.S. Senator Charles Sumner stated in Congress: \"Some of [Rantoul's] most devoted labors, commencing in the legislature of Massachusetts, were for the abolition of capital punishment.  Perhaps no person since the consummate jurist, Edward Livingston, has done so much by reports, articles, letters, and speeches, to commend this reform to the country. With its final triumph, in the progress of civilization, his name will be indissolubly connected.\"\n\nDeath\nOn August 7, 1852, Rantoul died unexpectedly due to complications with erysipelas. a few days before his 47th birthday  In announcing his death, the Taunton Democrat printed, \"Mr. Rantoul stood in the front rank of the legal profession. As a forensic speaker, he had few equals, and scarcely a superior. . . . He was equally in his element, whether at the bar or in the forum,--before the people or in the halls of legislation. . . .  His was one of the progressive minds of the age. To the cause of free education, he gave his earliest influence and support; to temperance, his voice and his example. Of the abolition of the death penalty, it may be said that he was its ablest advocate, and that he died, like John Quincy Adams, clothed in the armor of compromising hostility to what he deemed the encroachments of the institution of southern slavery. . . . His death is no common loss; to his family, a loss we cannot realize; to his constituents, which none can supply; and to his party and country, a deprivation like the deaths of Silas Wright and Levi Woodbury, tenfold more afflicting for the suddenness of its occurrence.\"\n\nTributes\nRantoul was the subject of a bust by the self-taught Massachusetts sculptor Joanna Quiner, cast in plaster and presented to the Boston Athenaeum in 1842; it was the first sculpture by a woman to be shown there when it was exhibited in 1846, and remains in the collection.\n\nSee also\n\nList of United States Congress members who died in office (1790–1899)\n Rantoul, Kansas\n\nReferences\n\nExternal links\n\n1805 births\n1852 deaths\nHarvard University alumni\nDemocratic Party members of the Massachusetts House of Representatives\nUnited States Attorneys for the District of Massachusetts\nPeople from Beverly, Massachusetts\nDemocratic Party United States senators from Massachusetts\nDemocratic Party members of the United States House of Representatives from Massachusetts\n19th-century American legislators"
}