{
  "title": "Temurah (Talmud)",
  "content": "Tractate Temurah (, literally: \"exchange\") is a tractate of the Mishnah, Tosefta, and Babylonian Talmud, which is part of the Order of Kodashim. Its main subject is the Biblical prohibition (Leviticus 27:10) against attempting to switch the sanctity of an animal that has been sanctified for the Temple in Jerusalem with another non-sanctified animal. If this is attempted, both animals become sanctified, and the person who attempted the transfer is punished with lashes.\n\nLike many tractates in the order of Kodshim, Temurah was not often learned by many Talmud scholars.  Its reopening was included in the general Kodshim Renaissance brought about by the Brisk yeshivas.\n\nMishnah\nThe Mishnah's seven chapters cover the following topics:\n Regarding those who are allowed to make an exchange; things that may be exchanged, and things that may not be exchanged (§§ 3-6). Regulations concerning drawn water which is unfit for the mikveh; concerning water for sprinkling, and a field in which there is a grave that can not be found (§§ 4-5).\n In what ways the sacrifices of the congregation are different from the sacrifices of individuals (§§ 1-2). Difficulties connected with consecrated objects in general which do not affect objects consecrated through temurah and vice versa (§ 3).\n Sacrifices in which the young of the sacrificial animal is equivalent to the sacrificial animal itself; sacrifices in which this is not the case (§§ 1-2). What must be done when some one consecrates a female animal for a sacrifice for which only a male animal is appropriate (§§ 3-4). In what ways the first-born and the tenth are different from other sacrificial animals (§ 5).\n The young of a sin-offering; temurah in connection with a sin-offering; other regulations concerning sin-offerings. Cases in which the bringer of the sin-offering dies before the sacrifice is made; in which the sin-offering has been lost and found again; in which a sin-offering with a blemish is consecrated.\n How, an animal being pregnant, its young may be consecrated while still unborn (§§ 1-3). The form of words with which a temurah is made.\n Things that may not be placed on the altar (§§ 1-4). The young of animals which may not be placed on the altar may be sacrificed; sacrificial animals which have become unfit (terefah) through sickness may not be redeemed (§ 5).\n In what ways things which have been consecrated for the altar are different from things which are dedicated only for the maintenance of the Temple, and in what ways they are similar (§§ 1-3). What sacrificial objects must be burned and what buried; in this connection are enumerated other unconsecrated things which must be partly burned and partly buried (§§ 4-6).\n\nCommandments\nThis prohibition of exchange was counted by Maimonides as comprising 3 of the 613 commandments.  The three commandments are:\n Not to substitute another beast for one set apart for sacrifice\n The new animal, in addition to the substituted one, retains consecration\n Not to change consecrated animals from one type of offering to another\n\nSee also\n Temurah (Kabbalah), a method used by Kabbalists to rearrange words and sentences in the Bible\n Midrash Temurah (Hebrew: מדרש תמורה), one of the smaller midrashim, consisting of three chapters\n\nExternal links\n Text of the Mishnah for tractate Temurah (Hebrew)\n\nReferences\n\nTalmud\nJewish sacrificial law"
}