{
  "title": "Thomas H. Moodie",
  "content": "Thomas Hilliard Moodie (May 26, 1878 – March 3, 1948) was an American politician who was born in Winona, Minnesota. After he was inaugurated Governor of North Dakota in January 1935, it was revealed that he had not officially been a resident of the state for the mandatory five years, and he was removed from office in February 1935 having served less than a month.\n\nBiography\nA native of Winona, Minnesota, Thomas H. Moodie left school at the age of sixteen. He moved to Wadena, Minnesota, and began his career as a newspaperman in the printing department of the Wadena Pioneer. He married Julia Edith McMurray. He also worked as a brakeman for the Northern Pacific Railroad.\n\nCareer\nHe moved to North Dakota and was a cub reporter for the Bismarck Tribune. He became a journeyman printer, reporter, and editor of newspapers throughout the state, and also served as an editorial writer for the Minneapolis Tribune.\n\nIn 1933 President Franklin D. Roosevelt appointed him to a committee on federal grants to public buildings. In 1934 Moodie received the Democratic nomination for governor, and beat his Republican opponent, Lydia Langer (wife of William Langer).\n\nAs soon as the election was over, there was talk of impeachment. After Moodie's inauguration on January 7, 1935, it was revealed that he had voted in a 1932 municipal election in Minnesota. In order to be eligible for governor, an individual has to have lived in the state for five consecutive years before the election. The State Supreme Court determined that Governor Moodie was ineligible to serve, and he was removed from office on February 16, 1935.  He was succeeded by Lieutenant Governor Walter Welford. \n\nPrior to his removal he had been impeached by the North Dakota House of Representatives, however the impeachment halted after the North Dakota Supreme Court took up a challenge to his qualification to office and ultimately removed him from office. The impeachment, which took place twelve days after Moodie's inauguration, had officially been for unspecified \"crime, corrupt conduct, malfeasance and misdemeanors in office\", but was known to be centered upon his eligibility for office. The attorney general of the state considered the House impeachment an \"incomplete\" action, since the House did not submit impeachment managers or present the articles of impeachment to the Senate.\n\nAfter his five-week stint as governor, Moodie became an administrator for the North Dakota Federal Housing Administration.  Moodie was also an administrator for the WPA from 1935 to 1943. He also served as deputy administrator for the State War Finance Committee in Montana.\n\nFinally he served as financial editor and confidential agent for the publisher of the Spokane Chronicle.\n\nDeath\nMoodie died in Spokane, Washington, on March 3, 1948, at the age of 69. He is buried in Woodlawn Cemetery in Winona, Minnesota.\n\nReferences\n\nExternal links\nNational Governors Association\n\n|-\n\n1878 births\n1948 deaths\n20th-century American politicians\nDemocratic Party governors of North Dakota\nPeople from Winona, Minnesota\nPoliticians from Spokane, Washington\nImpeached state and territorial governors of the United States"
}