{
  "title": "Abd al-Latif al-Baghdadi",
  "content": "ʿAbd al-Laṭīf al-Baghdādī (, 1162 Baghdad–1231 Baghdad), short for Muwaffaq al-Dīn Muḥammad ʿAbd al-Laṭīf ibn Yūsuf al-Baghdādī (), was a physician, philosopher, historian, Arabic grammarian and traveller, and one of the most voluminous writers of his time.\n\nBiography\nMany details of ʿAbd al-Laṭīf al-Baghdādī's life are known from his autobiography as presented in Ibn Abī Uṣaybiʿah's literary history of medicine. As a young man, he studied grammar, law, tradition, medicine, alchemy and philosophy. He focused his studies on ancient authors, in particular Aristotle, after first adopting Avicenna (Ibn Sīnā) as his philosophical mentor at the suggestion of a wandering scholar from the Maghreb. He travelled extensively and resided in Mosul (in 1189) where he studied the works of al-Suhrawardi before travelling on to Damascus (1190) and the camp of Saladin outside Acre (1191). It was at this last location that he met Baha al-Din ibn Shaddad and Imad al-Din al-Isfahani and acquired the Qadi al-Fadil's patronage. He went on to Cairo, where he met Abu'l-Qasim al-Shari'i, who introduced him to the works of al-Farabi, Alexander of Aphrodisias, and Themistius and (according to al-Latif) turned him away from Avicenna and alchemy.\n\nIn 1192 he met Saladin in Jerusalem and enjoyed his patronage, then went to Damascus again before returning to Cairo. He journeyed to Jerusalem and to Damascus in 1207-8, and eventually made his way via Aleppo to Erzindjan, where he remained at the court of the Mengujekid Ala’-al-Din Da’ud (Dāwūd Shāh) until the city was conquered by the Rūm Seljuk ruler Kayqubād II (Kayqubād Ibn Kaykhusraw). ‘Abd al-Latif returned to Baghdad in 1229, travelling back via Erzerum, Kamakh, Divriği and Malatya. He died in Baghdad two years later.\n\nAccount of Egypt\nʿAbd al-Laṭīf was a man of great knowledge and of an inquisitive and penetrating mind. Of the numerous works (mostly on medicine) which Ibn Abī Uṣaybiʿah ascribes to him, one only, his graphic and detailed Account of Egypt (in two parts), appeared to be known in Europe.\n\nArcheology\nʿAbd-al-Laṭīf was well aware of the value of ancient monuments. He praised some Muslim rulers for preserving and protecting pre-Islamic artefacts and monuments, but he also criticized others for failing to do so. He noted that the preservation of antiquities presented a number of benefits for Muslims:\n \"monuments are useful historical evidence for chronologies\";\n \"they furnish evidence for Holy Scriptures, since the Qur'an mentions them and their people\";\n \"they are reminders of human endurance and fate\";\n \"they show, to a degree, the politics and history of ancestors, the richness of their sciences, and the genius of their thought\".\n\nWhile discussing the profession of treasure hunting, he notes that poorer treasure hunters were often sponsored by rich businessmen to go on archeological expeditions. In some cases, an expedition could turn out to be fraudulent, with the treasure hunter disappearing with large amounts of money extracted from sponsors.\n\nEgyptology\nHis manuscript was one of the earliest works on Egyptology. It contains a vivid description of a famine caused by the Nile failing to overflow its banks (which occurred during the author's residence in Egypt). He also wrote detailed descriptions on ancient Egyptian monuments.\n\nAutopsy\nAl-Baghdādī wrote that during the famine in Egypt in 597 AH (1200 AD), he had the opportunity to observe and examine a large number of skeletons, through which he came to the view that Galen was incorrect regarding the formation of the bones of the lower jaw [mandible], coccyx and sacrum.\n\nTranslation\nAl-Baghdādī's Arabic manuscript was discovered in 1665 by the English orientalist Edward Pococke and is preserved in the Bodleian Library. Pococke published the Arabic manuscript in the 1680s. His son, Edward Pococke the Younger, translated the work into Latin, although he was only able to publish less than half of his work. Thomas Hunt attempted to publish Pococke's complete translation in 1746, although his attempt was unsuccessful. Pococke's complete Latin translation was eventually published by Joseph White of Oxford in 1800. The work was then translated into French, with valuable notes, by Silvestre de Sacy in 1810.\n\nPhilosophy\n\nAs far as philosophy is concerned, one may adduce that ʿAbd al-Laṭīf al-Baghdādī regarded philosophers as paragons of real virtue and therefore he refused to accept as a true philosopher one lacking not only true insight, but also a truly moral personality as true philosophy was in the service of religion, verifying both belief and action. Apart from this he regarded the philosophers’ ambitions as vain (Endress, in Martini Bonadeo, Philosophical journey, xi). ʿAbd al-Laṭīf composed several philosophical works, among which is an important and original commentary on Aristotle's Metaphysics (Kitāb fī ʿilm mā baʿd al-ṭabīʿa). This is a critical work in the process of the Arabic assimilation of Greek thought, demonstrating its author's acquaintance with the most important Greek metaphysical doctrines, as set out in the writings of al-Kindī (d. circa 185-252/801-66) and al-Fārābī (d. 339/950). The philosophical section of his Book of the Two Pieces of Advice (Kitāb al-Naṣīḥatayn) contains an interesting and challenging defence of philosophy and illustrates the vibrancy of philosophical debate in the Islamic colleges. It moreover emphasises the idea that Islamic philosophy did not decline after the twelfth century CE (Martini Bonadeo, Philosophical journey; Gutas). ʿAbd al-Laṭīf al-Baghdādī may therefore well be an exponent of what Gutas calls the “golden age of Arabic philosophy” (Gutas, 20).\n\nAlchemy\n\nʿAbd al-Laṭīf also penned two passionate and somewhat grotesque pamphlets against the art of alchemy in all its facets. Although he engaged in alchemy for a short while, he later abandoned the art completely by rejecting not only its practice, but also its theory. In ʿAbd al-Laṭīf's view alchemy could not be placed in the system of the sciences, and its false presumptions and pretensions must be distinguished from true scientific knowledge, which can be given a rational basis (Joosse, Rebellious intellectual, 29–62; Joosse, Unmasking the craft, 301–17; Martini Bonadeo, Philosophical journey, 5-6 and 203–5; Stern, 66–7; Allemann).\n\nSpiritualism\n\nDuring the years following the First World War, ʿAbd al-Laṭīf al-Baghdādī's name reappeared within the spiritualistic movement in the United Kingdom. He was introduced to the public by the Irish medium Eileen J. Garrett, the author Sir Arthur Conan Doyle and the spiritualist R.H. Saunders and became known by the name Abduhl Latif, the great Arab physician. He is said to have acted as a control of mediums until the mid 1960s (Joosse, Geest, 221–9). The Bodleian Library (MS Pococke 230) and the interpretation of the Videans (Zand-Videan, 8–9) may also have prompted the whimsical short-story ‘Ghost Writer’, as told to Tim Mackintosh-Smith, in which ʿAbd al-Laṭīf al-Baghdādī speaks in the first person.\n\nReferences\n\nBibliography\nAllemann, Franz, ʿAbdallaṭīf al-Baġdādī: Risālah fī Mudjādalat al-ḥakīmain al-kīmiyāʾī wan-naẓarī (“Das Streitgespräch zwischen dem Alchemisten und dem theoretischen Philosophen” or The Argument Between the Alchemist and the Theoretical Philosopher). Eine textkritische Bearbeitung der Handschrift: Bursa, Hüseyin Çelebi 823, fol. 100-123 mit Übersetzung und Kommentar, PhD dissertation Bern 1988.\n\n Degen, Rainer, Zum Diabetestraktat des ʿAbd al-Laṭīf al-Baġdādī, Annali Istituto Universitario Orientale di Napoli, 37 (N.S. 27) (1977), 455–62.\n Dietrich, Albert, Ein Arzneimittelverzeichnis des Abdallaṭīf Ibn Yūsuf al-Baġdādī, in: Wilhelm Hoenerbach, Der Orient in der Forschung. Festschrift für Otto Spies zum 5. April 1966 (Wiesbaden 1967), 42–60.\n Gannagé, Emma, “Médecine et philosophie à Damas à l’aube du XIIIème siècle: un tournant post-avicennien?”, Oriens, 39 (2011), 227–256.\n Gutas, Dimitri, 'Philosophy in the Twelfth Century: One View from Bagdad, or the Reputation of al-Ghazālī, in: Peter Adamson, In the Age of Averroes: Arabic Philosophy in the Sixth/Twelfth Century, London/Torino: Nino Aragno Editore, 2011, 9-26.\n Ibn Abī Uṣaybiʿa, ʿUyūn al-anbāʾ fī ṭabaqāt al-atibbāʾ, ed. Imruʾulqais ibn aṭ-Ṭaḥḥān (August Müller), 2 vols. (Cairo-Königsberg 1299/1882), 2: 201-13 [Reprint by Fuat Sezgin et al.: Islamic Medicine 1–2, 2 vols., Frankfurt am Main 1995]. The entry on ALB has been translated, annotated, and edited by N. Peter Joosse and Geert Jan van Gelder, in: A Literary History of medicine: The ʿUyūn al-anbāʾ fī ṭabaqāt al-aṭibbāʾ of Ibn Abī Uṣaybiʿah, HdO 134, volume 3-1 [ed.]: 1295–1323; 3-2 [trl.]: 1470-1506 (Brill: Leiden/Boston, 2019). Joosse, N. Peter, art. \"ʿAbd al-Laṭīf al-Baghdādī\" in: Encyclopaedia of Islam Three.\n Joosse, N. Peter, The Physician as a Rebellious Intellectual. The Book of the Two Pieces of Advice or Kitāb al-Naṣīḥatayn by ʿAbd al-Laṭīf al-Baghdādī (1162-1231): Introduction, Edition and Translation of the Medical Section (Frankfurt am Main and Bern: Peter Lang Edition 2014). [Beihefte zur Mediaevistik, Band 18].\n Joosse, N. Peter, ʿAbd al-Laṭīf al-Baghdādī as a philosopher and a physician. Myth or reality, topos or truth?, in Peter Adamson, In the age of Averroes. Arabic philosophy in the sixth/twelfth century (Nino Aragno Editore: London/Torino 2011), 27-43.\n Joosse, N. Peter, ‘Pride and prejudice, praise and blame’. ʿAbd al-Laṭīf al-Baghdādī’s views on good and bad medical practitioners, in Arnoud Vrolijk and Jan P. Hogendijk, O ye gentlemen. Arabic studies on science and literary culture in honour of Remke Kruk (Brill: Leiden/Boston 2007), 129–41.\n Joosse, N. Peter, 'ʿUnmasking the Craftʾ. ʿAbd al-Laṭīf al-Baghdādī's Views on Alchemy and Alchemists: in: Anna A. Akasoy and Wim Raven, Islamic Thought in the Middle Ages. Studies in Text, Transmission and Translation in Honour of Hans Daiber (Brill: Leiden/Boston, 2008), 301–17.\n Joosse, N. Peter, ‘De geest is uit de fles’. De middeleeuwse Arabische arts ʿAbd al-Laṭīf ibn Yūsuf al-Baghdādī: zijn medische werk en zijn bizarre affiliatie met het twintigste-eeuwse spiritisme, Gewina 30/4 (2007), 211–29.\n Joosse, N. Peter and Peter E. Pormann, 'Decline and Decadence in Iraq and Syria after the Age of Avicenna?: ʿAbd al-Laṭīf al-Baghdādī (1162-1231) between Myth and History, in: Bulletin of the History of Medicine 84 (2010), 1-29.\n Joosse, N. Peter and Peter E. Pormann, ʿAbd al-Laṭīf al-Baġdādī's commentary on Hippocrates’ ‘Prognostic’. A preliminary exploration, in Peter E. Pormann (ed.), >Epidemics< in context. Greek commentaries on Hippocrates in the Arabic tradition (De Gruyter: Berlin and Boston 2012), 251–83.\n Joosse, N. Peter and Peter E. Pormann, Archery, mathematics, and conceptualising inaccuracies in medicine in 13th century Iraq and Syria,  Journal of the Royal Society of Medicine 101 (2008), 425–7.\n\n Karimullah, Kamran I., « Assessing Avicenna's (d. 428/1037) Medical Influence in Prolegomena to Post-Classical (1100‒1900 CE) Medical Commentaries », MIDÉO, 32 ( 2017), 93-134 (especially section I on ʿAbd al-Laṭīf al-Baghdādī).\n Kruk, Remke, ʿAbd al-Laṭīf al-Baghdādī's Kitāb al-Ḥayawān: A chimaera?, in: Anna A. Akasoy and Wim Raven, Islamic thought in the middle ages. Studies in text, transmission and translation, in honour of Hans Daiber (Leiden and Boston 2008), 345–62.\n Mackintosh-Smith, Tim, ‘Ghost Writer’, as told to Tim Mackintosh-Smith, (Slightly foxed Ltd: London, 2005).\n Martini Bonadeo, Cecilia, art. \"‘Abd al-Latif al-Baghdadi\", in The Stanford Encyclopedia of Philosophy (Fall 2015 Edition), in Edward N. Zalta (ed.), URL = <http://plato.stanford.edu/archives/fall2015/entries/al-baghdadi/>.\n \n \n Pormann, Peter E. and N. Peter Joosse, Commentaries on the Hippocratic Aphorisms in the Arabic tradition: The example of melancholy, in Peter E. Pormann (ed.), >Epidemics< in context. Greek commentaries on Hippocrates in the Arabic tradition (De Gruyter: Berlin and Boston 2012), 211–49.\n Pormann, Peter E. and Emilie Savage-Smith, Medieval Islamic medicine (Edinburgh University Press: Edinburgh 2007), 60, 73–4.\n \n\n Stern, Samuel Miklos, A collection of treatises by ʿAbd al-Laṭīf al-Baghdādī, Islamic Studies 1 (1962), 53–70. [Reprint, in Fritz W. Zimmermann (ed.), S.M. Stern, Medieval Arabic and Hebrew thought (London 1983), No. XVIII].\n Thies, Hans-Jürgen, Der Diabetestraktat ʿAbd al-Laṭīf al-Baġdādī's. Untersuchungen zur Geschichte des Krankheitbildes in der arabischen Medizin, Diss. Bonn, Selbstverlag Uni Bonn, 1971.\n \n Toorawa, Shawkat M., A portrait of ʿAbd al-Laṭīf al-Baghdādī's education and instruction, in Joseph E. Lowry, Devin J. Stewart and Shawkat M. Toorawa, Law and education in medieval Islam. Studies in memory of professor George Makdisi (Oxford 2004), 91-109.\n Ullmann, Manfred, Die Medizin im Islam (Brill: Leiden/Köln 1970), 170–2.\n Ullmann, Manfred, review of Hans-Jürgen Thies, Der Diabetestraktat ʿAbd al-Laṭīf al-Baġdādī's. Untersuchungen zur Geschichte des Krankheitsbildes in der arabischen Medizin, (Selbstverlag Uni Bonn: Bonn 1971), Der Islam 48 (1972), 339–40.\n Zand, K.H. and J.A. and I.E. Videan, Kitāb al-Ifāda wa l-iʿtibār fī l-umūr al-mushāhada wa l-ḥawādith al-muʿāyana bi-arḍ miṣr''. Facsimile edition of the autograph manuscript at the Bodleian Library, Oxford and English translation by Kamal Hafuth Zand and John A. and Ivy E. Videan under the name The Eastern Key (London and Cairo 1204/1964).\n\nExternal links\n\n1162 births\n1231 deaths\nWriters from Baghdad\n12th-century people from the Abbasid Caliphate\nPhysicians from the Abbasid Caliphate\nEgyptologists\n13th-century physicians\nTravel writers of the medieval Islamic world\n13th-century people from the Abbasid Caliphate\n12th-century jurists\n13th-century jurists\n12th-century Arab people\n13th-century Arab people"
}