{
  "title": "Anxiolytic",
  "content": "An anxiolytic (; also antipanic or anti-anxiety agent) is a medication or other intervention that reduces anxiety. This effect is in contrast to anxiogenic agents which increase anxiety. Anxiolytic medications are used for the treatment of anxiety disorders and their related psychological and physical symptoms.\n\nNature of anxiety\nAnxiety is a naturally-occurring emotion and response. When anxiety levels exceed the tolerability of a person, anxiety disorders may occur. People with anxiety disorders can exhibit fear responses, such as defensive behaviors, high levels of alertness, and negative emotions. Those with anxiety disorders may have concurrent psychological disorders, such as depression. Anxiety disorders are classified using six possible clinical assessments:\n\nDifferent types of anxiety disorders will share some general symptoms while having their own distinctive symptoms. This explains why people with different types of anxiety disorders will respond differently to different classes of anti-anxiety medications.\n\nEtiology \nThe etiology of anxiety disorder remains unknown. There are several contributing factors that are still yet to be proved to cause anxiety disorders. These factors include childhood anxiety, drug induction by central stimulant drugs, metabolic diseases or having depressive disorder.\n\nMedications\nAnti-anxiety medication is any drug that can be taken or prescribed for the treatment of anxiety disorders, which may be mediated by neurotransmitters like norepinephrine, serotonin, dopamine, and gamma-aminobutyric acid (GABA) in the central nervous system. Anti-anxiety medication can be classified into six types according to their different mechanisms: antidepressants, benzodiazepines, azapirones, antiepileptics, antipsychotics, and beta blockers.\n\nAntidepressants include selective serotonin reuptake inhibitors (SSRIs), serotonin–norepinephrine reuptake inhibitors (SNRIs), tricyclic antidepressants (TCA), monoamine oxidase inhibitor (MAOI). SSRIs are used in all types of anxiety disorders while SNRIs are used for generalized anxiety disorder (GAD). Both of them are considered as first-line anti-anxiety medications. TCAs are second-line treatment as they cause more significant adverse effects when compared to the first-line treatment. Benzodiazepines are effective in emergent and short-term treatment of anxiety disorders due to their fast onset but carry the risk of dependence. Buspirone is indicated for GAD, which has much slower onset but with the advantage of less sedating and withdrawal effects.\n\nHistory \nThe first monoamine oxidase inhibitor (MAOI), iproniazid, was discovered accidentally when developing the new antitubercular drug isoniazid. The drug was found to induce euphoria and improve the patient's appetite and sleep quality.\n\nThe first tricyclic antidepressant, imipramine, was originally developed and studied to be an antihistamine alongside other first-generation antihistamines of the time, such as promethazine. TCAs can increase the level of norepinephrine and serotonin by inhibiting their reuptake transport proteins. The majority of TCAs exert greater effect on norepinephrine, which leads to side effects like drowsiness and memory loss.\n\nIn order to be more effective on serotonin agonism and avoid anticholinergic and antihistaminergic side effects, selective serotonin reuptake inhibitors (SSRI) were researched and introduced to treat anxiety disorders. The first SSRI, fluoxetine (Prozac), was discovered in 1974 and approved by FDA in 1987. After that, other SSRIs like sertraline (Zoloft), paroxetine (Paxil), and escitalopram (Lexapro) have entered the market.\n\nThe first serotonin norepinephrine reuptake inhibitor (SNRI), venlafaxine (Effexor), entered the market in 1993. SNRIs can target serotonin and norepinephrine transporters while avoiding imposing significant effects on other adrenergic (α1, α2, and β), histamine (H1), muscarinic, dopamine, or postsynaptic serotonin receptors.\n\nClassifications \nThere are six groups of anti-anxiety medications available that have been proven to be clinically significant in treatment of anxiety disorders.  The groups of medications are as follows.\n\nAntidepressants \nMedications that are indicated for both anxiety disorders and depression. Selective serotonin reuptake inhibitors (SSRIs) and serotonin–norepinephrine reuptake inhibitors (SNRIs) are new generations of antidepressants. They have a much lower adverse effect profile than older antidepressants like monoamine oxidase inhibitors (MAOIs) and tricyclic antidepressant (TCAs). Therefore, SSRIs and SNRIs are now the first-line agent in treating long term anxiety disorders, given their applications and significance in all six types of disorders.\n\nBenzodiazepines \nBenzodiazepines are used for acute anxiety and could be added along with current use of SSRIs to stabilize a treatment. Long-term use in treatment plans is not recommended. Different kinds of benzodiazepine will vary in its pharmacological profile, including its strength of effect and time taken for metabolism. The choice of the benzodiazepine will depend on the corresponding profiles.\n\nBenzodiazepines are used for emergent or short-term management. They are not recommended as the first-line anti-anxiety drugs, but they can be used in combination with SSRIs/SNRIs during the initial treatment stage. Indications include panic disorder, sleep disorders, seizures, acute behavioral disturbance, muscle spasm and premedication and sedation for procedures.\n\nAzapirones \nBuspirone can be useful in GAD but not particularly effective in treating phobias, panic disorder or social anxiety disorders. It is a safer option for long-term use as it does not cause dependence like benzodiazepines.\n\nAntiepileptics \n\nAntiepileptics are rarely prescribed as an off-label treatment for anxiety disorders and post-traumatic stress disorders. There have been some suggestions that they may help with GAD, panic disorder and phobic symptoms but there is currently not enough research or conclusive data suggesting they are more effective than a placebo.\n\nAntipsychotics \nOlanzapine and risperidone are atypical antipsychotics which are also effective in GAD and PTSD treatment. However, there is a higher chance of experiencing adverse effects than the other anti-anxiety medications.\n\nBeta-adrenoceptor antagonists \nPropranolol is originally used for high blood pressure and heart diseases. It can also be used to treat anxiety with symptoms like tremor or increased heart rate. They work on the nervous system and alleviate the symptoms as a relief. Propranolol is also commonly used for public speaking when one is nervous.\n\nMechanism of action\n\nSelective serotonin reuptake inhibitors (SSRI) and serotonin and norepinephrine reuptake inhibitors (SNRI) \nBoth SSRIs and SNRIs are reuptake inhibitors of a class of nerve signal transduction chemical called neurotransmitters. Serotonin and norepinephrine are neurotransmitters that are related to nervous control in mood regulation. The level of neurotransmitters are regulated by the nerve through reuptake to avoid accumulation of the neurotransmitter at the endings of nerve fiber. By reuptaking the produced neurotransmitter, the level will go back down and ready to go back up upon excitation from a new nerve signal. However the level of patients with anxiety disorders are usually low or their nerve fibers are insensitive to the neurotransmitters. SSRIs and SNRIs will then block the channel of reuptake and increase the level of the neurotransmitter. The nerve fibers will originally inhibit further production of neurotransmitters upon the increase. However the prolonged increase will eventually desensitize the nerve about the change in level. Therefore, the action of both SSRIs and SNRIs will take 4–6 weeks to exert their full effect.\n\nBenzodiazepine \nBenzodiazepines bind selectively to the GABA receptor, which is the receptor protein found in the nervous system and is in control of the nervous response. Benzodiazepine will increase the entry of chloride ions into the cells by improving the binding between GABA and GABA receptors and then the better opening of the channel for chloride ion passage. The high level of chloride ion inside the nerve cells makes the nerve more difficult to depolarize and inhibit further nerve signal transduction. The excitability of the nerves then reduces and the nervous system slows down. Therefore, the drug can alleviate symptoms of anxiety disorder and make the person less nervous.\n\nClinical use\n\nSelective serotonin reuptake inhibitors \nSelective serotonin reuptake inhibitors (SSRIs) are a class of medications used in the treatment of depression, anxiety disorders, OCD and some personality disorders. SSRIs are the first-line anti-anxiety medications. Serotonin is one of the crucial neurotransmitters in mood enhancement, and increasing serotonin level produces an anti-anxiety effect. SSRIs increase the serotonin level in the brain by inhibiting serotonin uptake pumps on serotonergic systems, without interactions with other receptors and ion channels. SSRIs are beneficial in both acute response and long-term maintenance treatment for both depression and anxiety disorder.\n\nSSRIs can increase anxiety initially due to negative feedback through the serotonergic autoreceptors; for this reason a concurrent benzodiazepine can be used until the anxiolytic effect of the SSRI occurs.\n\nThe SSRIs paroxetine and escitalopram are USFDA approved to treat generalized anxiety disorder.\n\nTherapeutic use\n\nAdverse effect \nThe common early side effects of SSRIs include nausea and loose stool, which can be solved by discontinuing the treatment. Headache, dizziness, insomnia are the common early side effects as well.\n\nSexual dysfunction, anorgasmia, erectile dysfunction, and reduced libido are common adverse side effects of SSRIs. Sometimes they may persist after the cessation of treatment.\n\nWithdrawal symptoms like dizziness, headache and flu-like symptoms (fatigue/myalgia/loose stool) may occur if SSRI is stopped suddenly. The brain is incapable of upregulating the receptors to sufficient levels especially after discontinuation of the drugs with short half life like paroxetine. Both fluoxetine and its active metabolite have a long half life therefore it causes the least withdrawal symptoms.\n\nSerotonin–norepinephrine reuptake inhibitors \nSerotonin–norepinephrine reuptake inhibitor (SNRIs) include venlafaxine and duloxetine drugs. Venlafaxine, in extended release form, and duloxetine, are indicated for the treatment of GAD. SNRIs are as effective as SSRIs in the treatment of anxiety disorders.\n\nTricyclic antidepressants \nTricyclic antidepressants (TCAs) have anxiolytic effects; however, side effects are often more troubling or severe and overdose is dangerous. They are considered effective, but have generally been replaced by antidepressants that cause different adverse effects. Examples include imipramine, doxepin, amitriptyline, nortriptyline and desipramine.\n\nTherapeutic use\n\nContraindication \nTCAs may cause drug poisoning in patients with hypotension, cardiovascular diseases and arrhythmias.\n\nTetracyclic antidepressants \n\nMirtazapine has demonstrated anxiolytic effect comparable to SSRIs while rarely causing or exacerbating anxiety. Mirtazapine's anxiety reduction tends to occur significantly faster than SSRIs.\n\nMonoamine oxidase inhibitors \nMonoamine oxidase inhibitors (MAOIs) are first-generation antidepressants effective for anxiety treatment but their dietary restrictions, adverse effect profile and availability of newer medications have limited their use. MAOIs include phenelzine, isocarboxazid and tranylcypromine. Pirlindole is a reversible MAOI that lacks dietary restriction.\n\nBarbiturates\nBarbiturates are powerful anxiolytics but the risk of abuse and addiction is high. Many experts consider these drugs obsolete for treating anxiety but valuable for the short-term treatment of severe insomnia, though only after benzodiazepines or non-benzodiazepines have failed.\n\nBenzodiazepines\nBenzodiazepines are prescribed to quell panic attacks. Benzodiazepines are also prescribed in tandem with an antidepressant for the latent period of efficacy associated with many ADs for anxiety disorder. There is risk of benzodiazepine withdrawal and rebound syndrome if BZDs are rapidly discontinued. Tolerance and dependence may occur. The risk of abuse in this class of medication is smaller than in that of barbiturates. Cognitive and behavioral adverse effects are possible.\n\nBenzodiazepines include:\nalprazolam (Xanax), bromazepam,\nchlordiazepoxide (Librium),\nclonazepam (Klonopin),\ndiazepam (Valium),\nlorazepam (Ativan),\noxazepam,\ntemazepam, and Triazolam.\n\nTherapeutic use\n\nAdverse effect \nBenzodiazepines lead to central nervous system depression, resulting in common adverse effects like drowsiness, oversedation, light-headedness. Memory impairment can be a common adverse effect especially in elderly, hypersalivation, ataxia, slurred speech, psychomotor effects.\n\nSympatholytics\nSympatholytics are a group of anti-hypertensives which inhibit activity of the sympathetic nervous system. Beta blockers reduce anxiety by decreasing heart rate and preventing shaking. Beta blockers include propranolol, oxprenolol, and metoprolol. The alpha-1 agonist prazosin could be effective for PTSD. The alpha-2 agonists clonidine and guanfacine have demonstrated both anxiolytic and anxiogenic effects.\n\nMiscellaneous\n\nBuspirone\nBuspirone (Buspar) is a 5-HT1A receptor agonist used to treated generalized anxiety disorder. If an individual has taken a benzodiazepine, buspirone will be less effective.\n\nPregabalin\nPregabalin (Lyrica) produces anxiolytic effect after one week of use comparable to lorazepam, alprazolam, and venlafaxine with more consistent psychic and somatic anxiety reduction. Unlike BZDs, it does not disrupt sleep architecture nor does it cause\ncognitive or psychomotor impairment.\n\nHydroxyzine\nHydroxyzine (Atarax) is an antihistamine originally approved for clinical use by the FDA in 1956. Hydroxyzine has a calming effect which helps ameliorate anxiety. Hydroxyzine efficacy is comparable to benzodiazepines in the treatment of generalized anxiety disorder.\n\nPhenibut\nPhenibut (Anvifen, Fenibut, Noofen) is an anxiolytic used in Russia. Phenibut is a GABAB receptor agonist, as well as an antagonist at α2δ subunit-containing voltage-dependent calcium channels (VDCCs), similarly to gabapentinoids like gabapentin and pregabalin. The medication is not approved by the FDA for use in the United States, but is sold online as a supplement.\n\nTemgicoluril\nTemgicoluril (Mebicar) is an anxiolytic produced in Latvia and used in Eastern Europe. Temgicoluril has an effect on the structure of limbic-reticular activity, particularly on the hypothalamus, as well as on all four basic neuromediator systems – γ aminobutyric acid (GABA), choline, serotonin and adrenergic activity. Temgicoluril decreases noradrenaline, increases serotonin, and exerts no effect on dopamine.\n\nFabomotizole\nFabomotizole (Afobazole) is an anxiolytic drug launched in Russia in the early 2000s. Its mechanism of action is poorly-defined, with GABAergic, NGF and BDNF release promoting, MT1 receptor agonism, MT3 receptor antagonism, and sigma receptor agonism thought to have some involvement.\n\nBromantane\nBromantane is a stimulant drug with anxiolytic properties developed in Russia during the late 1980s. Bromantane acts mainly by facilitating the biosynthesis of dopamine, through indirect genomic upregulation of relevant enzymes (tyrosine hydroxylase (TH) and aromatic L-amino acid decarboxylase (AAAD)).\n\nEmoxypine\nEmoxypine is an antioxidant that is also a purported anxiolytic. Its chemical structure resembles that of pyridoxine, a form of vitamin B6.\n\nMenthyl isovalerate\nMenthyl isovalerate is a flavoring food additive marketed as a sedative and anxiolytic drug in Russia under the name Validol.\n\nRacetams\nSome racetam based drugs such as aniracetam can have an antianxiety effect.\n\nAlpidem\nAlpidem is a nonbenzodiazepine anxiolytic with similar anxiolytic effectiveness as benzodiazepines but reduced sedation and cognitive, memory, and motor impairment. It was marketed briefly in France but was withdrawn from the market due to liver toxicity.\n\nEtifoxine\nEtifoxine has similar anxiolytic effects as benzodiazepine drugs, but does not produce the same levels of sedation and ataxia. Further, etifoxine does not affect memory and vigilance, and does not induce rebound anxiety, drug dependence, or withdrawal symptoms.\n\nAlcohol\nAlcohol is sometimes used as an anxiolytic by self-medication. fMRI can measure the anxiolytic effects of alcohol in the human brain.\n\nAlternatives to medication \nCognitive behavioral therapy (CBT) is an effective treatment for panic disorder, social anxiety disorder, generalized anxiety disorder, and obsessive–compulsive disorder, while exposure therapy is the recommended treatment for anxiety related phobias. Healthcare providers can guide those with anxiety disorder by referring them to self-help resources. Sometimes medication is combined with psychotherapy but research has not found a benefit of combined pharmacotherapy and psychotherapy versus monotherapy.\n\nIf CBT is found ineffective, both the Canadian and American medical associations then suggest the use of medication.\n\nSee also\n\nCategories\n\nReferences\n\nExternal links\n\n \nAnxiety disorder treatment\nDrug classes defined by psychological effects"
}