{
  "title": "Aspartame",
  "content": "Aspartame is an artificial non-saccharide sweetener 200 times sweeter than sucrose and is commonly used as a sugar substitute in foods and beverages. It is a methyl ester of the aspartic acid/phenylalanine dipeptide with brand names NutraSweet, Equal, and Canderel. Aspartame was approved by the US Food and Drug Administration (FDA) in 1974, and then again in 1981, after approval was revoked in 1980.\n\nAspartame is one of the most studied food additives in the human food supply. Reviews by over 100 governmental regulatory bodies found the ingredient safe for consumption at the normal acceptable daily intake (ADI) limit.\n\nUses\n\nAspartame is around 180 to 200 times sweeter than sucrose (table sugar). Due to this property, even though aspartame produces  of energy per gram when metabolized, about the same as sucrose, the quantity of aspartame needed to produce a sweet taste is so small that its caloric contribution is negligible. The sweetness of aspartame lasts longer than that of sucrose, so it is often blended with other artificial sweeteners such as acesulfame potassium to produce an overall taste more like that of sugar.\n\nLike many other peptides, aspartame may hydrolyze (break down) into its constituent amino acids under conditions of elevated temperature or high pH. This makes aspartame undesirable as a baking sweetener and prone to degradation in products hosting a high pH, as required for a long shelf life. The stability of aspartame under heating can be improved to some extent by encasing it in fats or in maltodextrin. The stability when dissolved in water depends markedly on pH. At room temperature, it is most stable at pH 4.3, where its half-life is nearly 300 days. At pH 7, however, its half-life is only a few days. Most soft-drinks have a pH between 3 and 5, where aspartame is reasonably stable. In products that may require a longer shelf life, such as syrups for fountain beverages, aspartame is sometimes blended with a more stable sweetener, such as saccharin.\n\nDescriptive analyses of solutions containing aspartame report a sweet aftertaste as well as bitter and off-flavor aftertastes.\n\nAcceptable levels of consumption\n\nThe acceptable daily intake (ADI) value for food additives, including aspartame, is defined as the \"amount of a food additive, expressed on a body weight basis, that can be ingested daily over a lifetime without appreciable health risk\". The Joint FAO/WHO Expert Committee on Food Additives (JECFA) and the European Commission's Scientific Committee on Food (later becoming EFSA) have determined this value is 40 mg/kg of body weight per day for aspartame, while the FDA has set its ADI for aspartame at 50 mg/kg per day  an amount equated to consuming 75 packets of commercial aspartame sweetener per day to be within a safe upper limit.\n\nThe primary source for exposure to aspartame in the US is diet soft drinks, though it can be consumed in other products, such as pharmaceutical preparations, fruit drinks, and chewing gum among others in smaller quantities. A  can of diet soda contains  of aspartame, and, for a  adult, it takes approximately 21 cans of diet soda daily to consume the  of aspartame that would surpass the FDA's 50 mg/kg of body weight ADI of aspartame from diet soda alone.\n\nReviews have analyzed studies which have looked at the consumption of aspartame in countries worldwide, including the US, countries in Europe, and Australia, among others. These reviews have found that even the high levels of intake of aspartame, studied across multiple countries and different methods of measuring aspartame consumption, are well below the ADI for safe consumption of aspartame. Reviews have also found that populations that are believed to be especially high consumers of aspartame, such as children and diabetics, are below the ADI for safe consumption, even considering extreme worst-case scenario calculations of consumption.\n\nIn a report released on 10 December 2013, the EFSA said that, after an extensive examination of evidence, it ruled out the \"potential risk of aspartame causing damage to genes and inducing cancer\" and deemed the amount found in diet sodas safe to consume.\n\nSafety and health effects \n\nThe safety of aspartame has been studied since its discovery, and it is a rigorously tested food ingredient. Aspartame has been deemed safe for human consumption by over 100 regulatory agencies in their respective countries, including the US Food and Drug Administration (FDA), UK Food Standards Agency, the European Food Safety Authority (EFSA), Health Canada, and Food Standards Australia New Zealand.\n\nMetabolism and body weight\n reviews of clinical trials showed that using aspartame (or other non-nutritive sweeteners) in place of sugar reduces calorie intake and body weight in adults and children. A 2017 review of metabolic effects by consuming aspartame found that it did not affect blood glucose, insulin, total cholesterol, triglycerides, calorie intake, or body weight. While high-density lipoprotein levels were higher compared to control, they were lower compared to sucrose.\n\nIn 2023, the World Health Organization recommended against the use of common non-saccharide sweeteners (NSS), including aspartame, to control body weight or lower the risk of non-communicable diseases, stating: \"The recommendation is based on the findings of a systematic review of the available evidence which suggests that use of NSS does not confer any long-term benefit in reducing body fat in adults or children. Results of the review also suggest that there may be potential undesirable effects from long-term use of NSS, such as an increased risk of type 2 diabetes, cardiovascular diseases, and mortality in adults.\"\n\nPhenylalanine\n\nHigh levels of the naturally occurring essential amino acid phenylalanine are a health hazard to those born with phenylketonuria (PKU), a rare inherited disease that prevents phenylalanine from being properly metabolized. Because aspartame contains a small amount of phenylalanine, foods containing aspartame sold in the US must state: \"Phenylketonurics: Contains Phenylalanine\" on product labels.\n\nIn the UK, foods that contain aspartame are required by the Food Standards Agency to list the substance as an ingredient, with the warning \"Contains a source of phenylalanine\". Manufacturers are also required to print \"with sweetener(s)\" on the label close to the main product name on foods that contain \"sweeteners such as aspartame\" or \"with sugar and sweetener(s)\" on \"foods that contain both sugar and sweetener\".\n\nIn Canada, foods that contain aspartame are required to list aspartame among the ingredients, include the amount of aspartame per serving, and state that the product contains phenylalanine.\n\nPhenylalanine is one of the essential amino acids and is required for normal growth and maintenance of life. Concerns about the safety of phenylalanine from aspartame for those without phenylketonuria center largely on hypothetical changes in neurotransmitter levels as well as ratios of neurotransmitters to each other in the blood and brain that could lead to neurological symptoms. Reviews of the literature have found no consistent findings to support such concerns, and, while high doses of aspartame consumption may have some biochemical effects, these effects are not seen in toxicity studies to suggest aspartame can adversely affect neuronal function. As with methanol and aspartic acid, common foods in the typical diet, such as milk, meat, and fruits, will lead to ingestion of significantly higher amounts of phenylalanine than would be expected from aspartame consumption.\n\nCancer\n, regulatory agencies, including the FDA and EFSA, and the US National Cancer Institute, have concluded that consuming aspartame is safe in amounts within acceptable daily intake levels and does not cause cancer. These conclusions are based on various sources of evidence, such as reviews and epidemiological studies finding no association between aspartame and cancer.\n\nIn July 2023, scientists for the International Agency for Research on Cancer (IARC) concluded that there was \"limited evidence\" for aspartame causing cancer in humans, classifying the sweetener as Group 2B (possibly carcinogenic). The lead investigator of the IARC report stated that the classification \"shouldn't really be taken as a direct statement that indicates that there is a known cancer hazard from consuming aspartame. This is really more of a call to the research community to try to better clarify and understand the carcinogenic hazard that may or may not be posed by aspartame consumption.\"\n\nThe Joint FAO/WHO Expert Committee on Food Additives (JECFA)  added that the limited cancer assessment indicated no reason to change the recommended acceptable daily intake level of 40 mg per kg of body weight per day, reaffirming the safety of consuming aspartame within this limit.\n\nThe FDA responded to the report by stating:\n\nNeurotoxicity symptoms \nReviews found no evidence that low doses of aspartame would plausibly lead to neurotoxic effects. A review of studies on children did not show any significant findings for safety concerns with regard to neuropsychiatric conditions such as panic attacks, mood changes, hallucinations, attention deficit hyperactivity disorder (ADHD), or seizures by consuming aspartame.\n\nHeadaches\nReviews have found little evidence to indicate that aspartame induces headaches, although certain subsets of consumers may be sensitive to it.\n\nWater quality\nAspartame passes through wastewater treatment plants mainly unchanged.\n\nMechanism of action\n\nThe perceived sweetness of aspartame (and other sweet substances like acesulfame potassium) in humans is due to its binding of the heterodimer G protein-coupled receptor formed by the proteins TAS1R2 and TAS1R3. Aspartame is not recognized by rodents due to differences in the taste receptors.\n\nMetabolites \n\nAspartame is rapidly hydrolyzed in the small intestine by digestive enzymes which break aspartame down into methanol, phenylalanine, aspartic acid, and further metabolites, such as formaldehyde and formic acid. Due to its rapid and complete metabolism, aspartame is not found in circulating blood, even following ingestion of high doses over 200 mg/kg.\n\nAspartic acid\n\nAspartic acid (aspartate) is one of the most common amino acids in the typical diet. As with methanol and phenylalanine, intake of aspartic acid from aspartame is less than would be expected from other dietary sources. At the 90th percentile of intake, aspartame provides only between 1% and 2% of the daily intake of aspartic acid.\n\nMethanol\n\nThe methanol produced by aspartame metabolism is unlikely to be a safety concern for several reasons. The amount of methanol produced from aspartame-sweetened foods and beverages is likely to be less than that from food sources already in diets. With regard to formaldehyde, it is rapidly converted in the body, and the amounts of formaldehyde from the metabolism of aspartame are trivial when compared to the amounts produced routinely by the human body and from other foods and drugs. At the highest expected human doses of consumption of aspartame, there are no increased blood levels of methanol or formic acid, and ingesting aspartame at the 90th percentile of intake would produce 25 times less methanol than what would be considered toxic.\n\nChemistry\n\nAspartame is a methyl ester of the dipeptide of the natural amino acids L-aspartic acid and L-phenylalanine. Under strongly acidic or alkaline conditions, aspartame may generate methanol by hydrolysis. Under more severe conditions, the peptide bonds are also hydrolyzed, resulting in free amino acids.\n\nTwo approaches to synthesis are used commercially. In the chemical synthesis, the two carboxyl groups of aspartic acid are joined into an anhydride, and the amino group is protected with a formyl group as the formamide, by treatment of aspartic acid with a mixture of formic acid and acetic anhydride. Phenylalanine is converted to its methyl ester and combined with the N-formyl aspartic anhydride; then the protecting group is removed from aspartic nitrogen by acid hydrolysis. The drawback of this technique is that a byproduct, the bitter-tasting β-form, is produced when the wrong carboxyl group from aspartic acid anhydride links to phenylalanine, with desired and undesired isomer forming in a 4:1 ratio. A process using an enzyme from Bacillus thermoproteolyticus to catalyze the condensation of the chemically altered amino acids will produce high yields without the β-form byproduct. A variant of this method, which has not been used commercially, uses unmodified aspartic acid but produces low yields. Methods for directly producing aspartyl-phenylalanine by enzymatic means, followed by chemical methylation, have also been tried but not scaled for industrial production.\n\nHistory\n\nAspartame was discovered in 1965 by James M. Schlatter, a chemist working for G.D. Searle & Company. Schlatter had synthesized aspartame as an intermediate step in generating a tetrapeptide of the hormone gastrin, for use in assessing an anti-ulcer drug candidate. He discovered its sweet taste when he licked his finger, which had become contaminated with aspartame, to lift up a piece of paper. Torunn Atteraas Garin participated in the development of aspartame as an artificial sweetener.\n\nIn 1975, prompted by issues regarding Flagyl and Aldactone, an FDA task force team reviewed 25 studies submitted by the manufacturer, including 11 on aspartame. The team reported \"serious deficiencies in Searle's operations and practices\". The FDA sought to authenticate 15 of the submitted studies against the supporting data. In 1979, the Center for Food Safety and Applied Nutrition (CFSAN) concluded, since many problems with the aspartame studies were minor and did not affect the conclusions, the studies could be used to assess aspartame's safety.\n\nIn 1980, the FDA convened a Public Board of Inquiry (PBOI) consisting of independent advisors charged with examining the purported relationship between aspartame and brain cancer. The PBOI concluded aspartame does not cause brain damage, but it recommended against approving aspartame at that time, citing unanswered questions about cancer in laboratory rats.\n\nIn 1983, the FDA approved aspartame for use in carbonated beverages and for use in other beverages, baked goods, and confections in 1993. In 1996, the FDA removed all restrictions from aspartame, allowing it to be used in all foods. As of May 2023, the FDA stated that it regards aspartame as a safe food ingredient when consumed within the acceptable daily intake level of 50 mg per kg of body weight per day.\n\nSeveral European Union countries approved aspartame in the 1980s, with EU-wide approval in 1994. The Scientific Committee on Food (SCF) reviewed subsequent safety studies and reaffirmed the approval in 2002. The European Food Safety Authority (EFSA) reported in 2006 that the previously established Acceptable daily intake (ADI) was appropriate, after reviewing yet another set of studies.\n\nCompendial status\n British Pharmacopoeia\n United States Pharmacopeia\n\nCommercial uses\n\nUnder the brand names Equal, NutraSweet, and Canderel, aspartame is an ingredient in approximately 6,000 consumer foods and beverages sold worldwide, including (but not limited to) diet sodas and other soft drinks, instant breakfasts, breath mints, cereals, sugar-free chewing gum, cocoa mixes, frozen desserts, gelatin desserts, juices, laxatives, chewable vitamin supplements, milk drinks, pharmaceutical drugs and supplements, shake mixes, tabletop sweeteners, teas, instant coffees, topping mixes, wine coolers, and yogurt. It is provided as a table condiment in some countries. Aspartame is less suitable for baking than other sweeteners because it breaks down when heated and loses much of its sweetness.\n\nNutraSweet Company\n\nIn 1985, Monsanto bought G.D.Searle, and the aspartame business became a separate Monsanto subsidiary, NutraSweet. In March 2000, Monsanto sold it to J.W. Childs Associates Equity Partners II L.P. European use patents on aspartame expired starting in 1987, and the US patent expired in 1992.\n\nAjinomoto\n\nMany aspects of industrial synthesis of aspartame were established by Ajinomoto. In 2004, the market for aspartame, in which Ajinomoto, the world's largest aspartame manufacturer, had a 40% share, was  a year, and consumption of the product was rising by 2% a year. Ajinomoto acquired its aspartame business in 2000 from Monsanto for $67 million (equivalent to $ in ).\n\nIn 2007, Asda was the first British supermarket chain to remove all artificial flavourings and colours in its store brand foods. In 2008, Ajinomoto sued Asda, part of Walmart, for a malicious falsehood action concerning its aspartame product when the substance was listed as excluded from the chain's product line, along with other \"nasties\". In July 2009, a British court ruled in favor of Asda. In June 2010, an appeals court reversed the decision, allowing Ajinomoto to pursue a case against Asda to protect aspartame's reputation. Asda said that it would continue to use the term \"no nasties\" on its own-label products, but the suit was settled in 2011 with Asda choosing to remove references to aspartame from its packaging.\n\nIn November 2009, Ajinomoto announced a new brand name for its aspartame sweetener—AminoSweet.\n\nHolland Sweetener Company\n\nA joint venture of DSM and Tosoh, the Holland Sweetener Company manufactured aspartame using the enzymatic process developed by Toyo Soda (Tosoh) and sold as the brand Sanecta. Additionally, they developed a combination aspartame-acesulfame salt under the brand name Twinsweet. They left the sweetener industry in 2006, because \"global aspartame markets are facing structural oversupply, which has caused worldwide strong price erosion over the last five years\", making the business \"persistently unprofitable\".\n\nCompeting products\n\nBecause sucralose, unlike aspartame, retains its sweetness after being heated, and has at least twice the shelf life of aspartame, it has become more popular as an ingredient. This, along with differences in marketing and changing consumer preferences, caused aspartame to lose market share to sucralose. In 2004, aspartame traded at about  and sucralose, which is roughly three times sweeter by weight, at around .\n\nSee also \n\n Alitame\n Aspartame controversy\n Neotame\n Phenylalanine ammonia lyase\n Stevia\n\nReferences\n\nExternal links \n \n\nAmino acid derivatives\nAromatic compounds\nBeta-Amino acids\nButyramides\nDipeptides\nCarboxylate esters\nSugar substitutes\nMethyl esters\nE-number additives"
}