{
  "title": "Blood alcohol content",
  "content": "Blood alcohol content (BAC), also called blood alcohol concentration or blood alcohol level, is a measurement of alcohol intoxication used for legal or medical purposes; it is expressed as mass of alcohol per volume of blood. For example, a BAC of 0.10 (0.10% or one tenth of one percent) means that there is 0.10 g of alcohol for every 100  of blood, which is the same as 21.7 . A BAC of 0.0 is sober; in different countries the maximum permitted BAC when driving ranges from about 0.02% to 0.08%; BAC levels over 0.08% are considered impaired; above 0.40% is potentially fatal.\n\nEffects by alcohol level \n\nAs BAC increases, the short-term effects of alcohol become more perceptible. At low levels of impairment (BAC 0.01–0.05%), people may experience mild relaxation and reduced social inhibition, along with impaired judgment and coordination. At moderate levels of impairment (BAC 0.06–0.20%), effects can include emotional swings, impaired vision, hearing, speech, and motor skills. Beginning at a BAC greater than 0.2%, people may experience urinary incontinence, vomiting, and symptoms of alcohol intoxication. At a BAC greater than 0.3%, people may experience total loss of consciousness and show signs of severe alcohol intoxication. A BAC of 0.4% or higher is potentially fatal and can result in a coma or respiratory failure.\n\nEstimation\n\nDirect measurement \nBlood samples for BAC analysis are typically obtained by taking a venous blood sample from the arm. A variety of methods exist for determining blood-alcohol concentration in a blood sample. Forensic laboratories typically use headspace-gas chromatography combined with mass spectrometry or flame ionization detection, as this method is accurate and efficient. Hospitals typically use enzyme multiplied immunoassay, which measures the co-enzyme NADH. This method is more subject to error but may be performed rapidly in parallel with other blood sample measurements.\n\nBy breathalyzer \n\nThe amount of alcohol on the breath can be measured, without requiring drawing blood, by blowing into a breathalyzer, resulting in a breath alcohol content (BrAC). The BrAC specifically correlates with the concentration of alcohol in arterial blood, satisfying the equation . Its correlation with the standard BAC found by drawing venous blood is less strong. Jurisdictions vary in the statutory conversion factor from BrAC to BAC, from 2000 to 2400. Many factors may affect the accuracy of a breathalyzer test, but they are the most common method for measuring alcohol concentrations in most jurisdictions.\n\nBy intake \n\nBlood alcohol content can be estimated by a model developed by Swedish professor  in the 1920s. The model corresponds to a pharmacokinetic single-compartment model with instantaneous absorption and zero-order kinetics for elimination. The model is most accurate when used to estimate BAC a few hours after drinking a single dose of alcohol in a fasted state, and can be within 20% CV of the true value. It is less accurate for BAC levels below 0.2 g/L (alcohol is not eliminated as quickly as predicted) and consumption with food (overestimating the peak BAC and time to return to zero). The equation varies depending on the units and approximations used, but in its simplest form is given by:\n\nwhere:\n is the estimated blood alcohol concentration (in g/L)\n is the mass of alcohol consumed (g).\n is the amount time during which alcohol was present in the blood (usually time since consumption began), in hours.\n is the rate at which alcohol is eliminated (g/L/hr); typically 0.15\n is the volume of distribution (L); typically body weight (kg) multiplied by 0.71 L/kg for men and 0.58 L/kg for women\n\nExamples:\n A 80 kg man drinks 2 US standard drinks (3 oz) of 40% ABV vodka, containing 14 grams of ethanol each (28 g total). After two hours:\n\n A 70 kg woman drinks 63 g of 40% ABV vodka, containing 21 grams of ethanol. After two hours:\n\nThe volume of distribution  contributes about 15% of the uncertainty to Widmark's equation and has been the subject of much research. It corresponds to the volume of the blood in the body. In his research, Widmark used units of mass (g/kg) for EBAC, thus he calculated the apparent  of distribution  or mass of blood in kilograms. He fitted an equation  of the body weight  in kg, finding an average rho-factor of 0.68 for men and 0.55 for women. This  has units of dose per body weight (g/kg) divided by concentration (g/kg) and is therefore dimensionless. However, modern calculations use weight/volume concentrations (g/L) for EBAC, so Widmark's rho-factors must be adjusted for the density of blood, 1.055 g/mL. This  has units of dose per body weight (g/kg) divided by concentration (g/L blood) - calculation gives values of 0.64 L/kg for men and 0.52 L/kg for women, lower than the original. Newer studies have updated these values to population-average  of 0.71 L/kg for men and 0.58 L/kg for women. But individual  values may vary significantly - the 95% range for  is 0.58-0.83 L/kg for males and 0.43-­0.73 L/kg for females. A more accurate method for calculating  is to use total body water (TBW) - experiments have confirmed that alcohol distributes almost exactly in proportion to TBW. TBW may be calculated using body composition analysis or estimated using anthropometric formulas based on age, height, and weight.  is then given by , where  is the water content of blood, approximately 0.825 w/v for men and 0.838 w/v for women.\n\nThe elimination rate from the blood, , is perhaps the more important parameter, contributing 60% of the uncertainty to Widmark's equation. Similarly to , its value depends on the units used for blood.  varies 58% by occasion and 42% between subjects; it is thus difficult determine  precisely, and more practical to use a mean and a range of values. The mean values for 164 men and 156 women were 0.148 g/L/h and 0.156 g/L/h respectively. Although statistically significant, the difference between sexes is small compared to the overall uncertainty, so Jones recommends using the value 0.15 for the mean and the range 0.10 - 0.25 g/L/h for forensic purposes, for all subjects. Explanations for the gender difference are quite varied and include liver size, secondary effects of the volume of distribution, and sex-specific hormones. Elaborating on the secondary effects, zero-order kinetics are not an adequate model for ethanol elimination; the elimination rate is better described by Michaelis–Menten kinetics. M-M kinetics are approximately zero-order above a BAC of 0.15-0.20 g/L, but below this value alcohol is eliminated more slowly and the elimination rate more closely follows first-order kinetics. This change in behavior was not noticed by Widmark because he could not analyze low BAC levels. A 2023 study using a more complex two-compartment model with M-M elimination kinetics, with data from 60 men and 12 women, found statistically small effects of gender on maximal elimination rate and excluded them from the final model. Eating food in proximity to drinking increases elimination rate significantly.\n\nIn terms of fluid ounces of alcohol consumed and weight in pounds, Widmark's formula can be simply approximated as\n\nfor a man or\n\nfor a woman, where EBAC and  factors are given as g/dL (% BAC), such as a  factor of 0.0015% BAC per hour.\n\nBy standard drinks\n\nThe examples above define a standard drink as 0.6 fluid ounces (14 g or 17.7 mL) of ethanol, whereas other definitions exist, for example 10 grams of ethanol.\n\nBy training\nIf individuals are asked to estimate their BAC, then given accurate feedback via a breathalyzer, and this procedure is repeated a number of times during a drinking session, studies show that these individuals can learn to discriminate their BAC, to within a mean error of 9 mg/100 mL (0.009% BAC). The ability is robust to different types of alcohol, different drink quantities, and drinks with unknown levels of alcohol. Trained individuals can even drink alcoholic drinks so as to adjust or maintain their BAC at a desired level. Training the ability does not appear to require any information or procedure besides breathalyzer feedback, although most studies have provided information such as intoxication symptoms at different BAC levels. Subjects continue to retain the ability one month after training.\n\nOther methods\nVitreous (eye) fluid provides an accurate account of blood alcohol concentration in cadavers.\n\nBinge drinking \n\nThe National Institute on Alcohol Abuse and Alcoholism (NIAAA) define the term \"binge drinking\" as a pattern of drinking that brings a person's blood alcohol concentration (BAC) to 0.08 grams percent or above.  This typically happens when men consume five or more drinks, and when women consume four or more drinks, in about two hours.\n\nUnits of measurement \n\nBAC is generally defined as a fraction of weight of alcohol per volume of blood. All countries are based on units of grams per liter, but differ in how this number is expressed as a decimal or percentage. The usual units are listed below. For example, the U.S. uses a concentration unit of 1% w/v (percent mass/volume, equivalent to 10 g/L or 1 g per 100 mL).\n\nIt is also possible to use other definitions, such as grams of alcohol per 100 grams of blood, or grams of alcohol per kilogram of body weight, but these have become uncommon. 1 mL of blood has a mass of approximately 1.06 grams.\n\nLegal limits \n\nFor purposes of law enforcement, blood alcohol content is used to define intoxication and provides a rough measure of impairment. Although the degree of impairment may vary among individuals with the same blood alcohol content, it can be measured objectively and is therefore legally useful and difficult to contest in court. Most countries forbid operation of motor vehicles and heavy machinery above prescribed levels of blood alcohol content. Operation of boats and aircraft is also regulated. Some jurisdictions also regulate bicycling under the influence. The alcohol level at which a person is considered legally impaired to drive varies by country.\n\nTest assumptions \n\nAfter fatal accidents, it is common to check the blood alcohol levels of involved persons. However, soon after death, the body begins to putrefy, a biological process which produces ethanol. This can make it difficult to conclusively determine the blood alcohol content in autopsies, particularly in bodies recovered from water. For instance, following the Moorgate tube crash, the driver had a blood alcohol concentration of 80 mg/100 mL, but it could not be established how much of this could be attributed to natural decomposition.\n\nExtrapolation\nRetrograde extrapolation is the mathematical process by which someone's blood alcohol concentration at the time of driving is estimated by projecting backwards from a later chemical test. This involves estimating the absorption and elimination of alcohol in the interim between driving and testing. The rate of elimination in the average person is commonly estimated at 0.015 to 0.020 grams per deciliter per hour (g/dL/h), although again this can vary from person to person and in a given person from one moment to another. Metabolism can be affected by numerous factors, including such things as body temperature, the type of alcoholic beverage consumed, and the amount and type of food consumed.\n\nIn an increasing number of states, laws have been enacted to facilitate this speculative task: the blood alcohol content at the time of driving is legally presumed to be the same as when later tested.  There are usually time limits put on this presumption, commonly two or three hours, and the defendant is permitted to offer evidence to rebut this presumption.\n\nForward extrapolation can also be attempted. If the amount of alcohol consumed is known, along with such variables as the weight and sex of the subject and period and rate of consumption, the blood alcohol level can be estimated by extrapolating forward. Although subject to the same infirmities as retrograde extrapolation—guessing based upon averages and unknown variables—this can be relevant in estimating BAC when driving and/or corroborating or contradicting the results of a later chemical test.\n\nMetabolism\nAlcohol is absorbed throughout the gastrointestinal tract, but more slowly in the stomach than in the small or large intestine. For this reason, alcohol consumed with food is absorbed more slowly, because it spends a longer time in the stomach. Furthermore, alcohol dehydrogenase is present in the stomach lining. After absorption, the alcohol passes to the liver through the hepatic portal vein, where it undergoes a first pass of metabolism before entering the general bloodstream.\n\nAlcohol is removed from the bloodstream by a combination of metabolism, excretion, and evaporation. Alcohol is metabolized mainly by the group of six enzymes collectively called alcohol dehydrogenase. These convert the ethanol into acetaldehyde (an intermediate more toxic than ethanol). The enzyme acetaldehyde dehydrogenase then converts the acetaldehyde into non-toxic acetic acid.\n\nMany physiologically active materials are removed from the bloodstream (whether by metabolism or excretion) at a rate proportional to the current concentration, so that they exhibit exponential decay with a characteristic half-life (see pharmacokinetics). This is not true for alcohol, however. Typical doses of alcohol actually saturate the enzymes' capacity, so that alcohol is removed from the bloodstream at an approximately constant rate. This rate varies considerably between individuals. Another sex-based difference is in the elimination of alcohol. People under 25, women, or people with liver disease may process alcohol more slowly. Falsely high BAC readings may be seen in patients with kidney or liver disease or failure.\n\nSuch persons also have impaired acetaldehyde dehydrogenase, which causes acetaldehyde levels to peak higher, producing more severe hangovers and other effects such as flushing and tachycardia.  Conversely, members of certain ethnicities that traditionally did not use alcoholic beverages have lower levels of alcohol dehydrogenases and thus \"sober up\" very slowly but reach lower aldehyde concentrations and have milder hangovers.  The rate of detoxification of alcohol can also be slowed by certain drugs which interfere with the action of alcohol dehydrogenases, notably aspirin, furfural (which may be found in fusel alcohol), fumes of certain solvents, many heavy metals, and some pyrazole compounds. Also suspected of having this effect are cimetidine, ranitidine, and acetaminophen (paracetamol).\n\nCurrently, the only known substance that can increase the rate of alcohol metabolism is fructose. The effect can vary significantly from person to person, but a 100 g dose of fructose has been shown to increase alcohol metabolism by an average of 80%. Fructose also increases false positives of high BAC readings in anyone with proteinuria and hematuria, due to kidney-liver metabolism.\n\nThe peak of blood alcohol level (or concentration of alcohol) is reduced after a large meal.\n\nHighest levels \n\nThere have been reported cases of blood alcohol content higher than 1%:\n\n In 1982, a 24-year-old woman was admitted to the UCLA emergency room with a serum alcohol content of 1.51%, corresponding to a blood alcohol content of 1.33%. She was alert and oriented to person and place and survived. Serum alcohol concentration is not equal to nor calculated in the same way as blood alcohol content.\n In 1984, a 30-year-old man survived a blood alcohol concentration of 1.5% after vigorous medical intervention that included dialysis and intravenous therapy with fructose.\n In 1995, a man from Wrocław, Poland, caused a car accident near his hometown. He had a blood alcohol content of 1.48%; he was tested five times, with each test returning the same reading. He died a few days later of injuries from the accident.\n In 2004, an unidentified Taiwanese woman died of alcohol intoxication after immersion for twelve hours in a bathtub filled with 40% ethanol. Her blood alcohol content was 1.35%. It was believed that she had immersed herself as a response to the SARS epidemic.\n In South Africa, a man driving a Mercedes-Benz Vito light van containing 15 sheep allegedly stolen from nearby farms was arrested on December 22, 2010, near Queenstown in Eastern Cape. His blood had an alcohol content of 1.6%. Also in the vehicle were five boys and a woman, who were also arrested.\n On 26 October 2012, a man from Gmina Olszewo-Borki, Poland, who died in a car accident, recorded a blood alcohol content of 2.23%; however, the blood sample was collected from a wound and thus possibly contaminated.\n On 26 July 2013 a 40-year-old man from Alfredówka, Poland, was found by Municipal Police Patrol from Nowa Dęba lying in the ditch along the road in Tarnowska Wola. At the hospital, it was recorded that the man had a blood alcohol content of 1.374%. The man survived.\n\nReferences\n\nCitations\n\nGeneral and cited references \n Carnegie Library of Pittsburgh. Science and Technology Department. The Handy Science Answer Book. Pittsburgh: The Carnegie Library, 1997. .\n \n Taylor, L., and S. Oberman. Drunk Driving Defense, 6th edition. New York: Aspen Law and Business, 2006. .\n\nExternal links \n\n Estimated alcohol\n\nAlcohol law\nAlcohol policy\nConcentration indicators\nDriving under the influence\nMetabolism"
}