{
  "title": "Crodowaldo Pavan",
  "content": "Crodowaldo Pavan (; December 1, 1919 – April 3, 2009) was a Brazilian biologist and geneticist, and a scientific leader in Brazil.\n\nEarly life\nPavan was born to a family of second-generation immigrants from Italy in 1919, in the city of Campinas, São Paulo state, Brazil. His great-grandfather was an expert in textile paints and a militant anarchist, who was frequently persecuted and imprisoned in Italy as well as in Brazil for his political activism. As a boy, influenced by his father's porcelain manufacturing plant at Mogi das Cruzes, he wished to follow a career in engineering, but changed radically when he had the opportunity in high school to attend a lecture by noted French physician and professor André Dreyfus and a screening of the film \"The Story of Louis Pasteur\", starring Oscar-winning actor Paul Muni in the title role.\n\nStudies\nFollowing Dreyfus' advice, in 1938 he enrolled in a course of natural history at the University of São Paulo, continuing to work in biological research under his mentor. His doctoral thesis on the subject of the blind cave fish Pimelodella kronei (syn. Typhlobagrus kronci) was completed in the same institution. In 1942, he accepted a position as assistant professor at the University of São Paulo, and quickly became a full professor, a position he held until his retirement in 1978.\n\nIn 1942, Pavan became involved in a pioneering research project on the genetics, taxonomy and ecology of Drosophila fruit flies, financed by the Rockefeller Foundation under the direction of the noted Russian-American biologist Theodosius Dobzhansky. This subject became Pavan's lifelong research interest and the source of his international recognition. In particular, Dr. Pavan introduced into biology the cytogenetical study of Rhynchosciara angelae, a fly which is noted for its giant chromosomes, thus facilitating the determination of the loci of genes. He and his collaborators were among the first to prove that the structure of genes and chromosomes was not fixed and could be changed by infections.\n\nIn 1966, Pavan accepted an invitation from the Oak Ridge National Laboratory in Tennessee to establish a laboratory for further investigation on cellular genetics. In 1968, he accepted an invitation to become a tenured full professor at the University of Texas at Austin, in Austin, Texas. He returned to Brazil in 1975, and, after officially retiring from his post at the University of São Paulo, he accepted the position of full professor at the recently founded State University of Campinas, working as departmental chairman and dean of the Instituto de Biologia da Universidade Estadual de Campinas (Institute of Biology) until a second retirement. He is currently an emeritus professor at both universities.\n\nInfluence\nAs a scientific leader, Pavan was very influential and became involved in the main development of science and technology in Brazil in the second half of the 20th century. He was president of the National Research Council (CNPq) from 1986 to 1990, and president of the Brazilian Society for the Advancement of Science from 1980 to 1986, a critical period for the redemocratization of the country, when the Society played a leading role in civil resistance to the military government.\n\nPavan was a member of several international scientific societies, such as the Third World Academy of Sciences, the Academy of Sciences of Lisbon, the Physiographic Academy of Lund, and the Academy of Sciences of Chile, and received decorations, medals, and awards from several countries. He was one of the few Brazilians who was a member of the Pontifical Academy of Sciences. He was also a member of the Brazilian Academy of Sciences, and one of the founders of the Academy of Sciences of São Paulo, the Academy of Medicine of São Paulo, the Academy of Letters of São Paulo, the Academy of Education of São Paulo, and the Brazilian Society of Genetics as well as one of its presidents.\n\nDuring the final part of his life Pavan lived in São Paulo and was involved in several activities related to the public understanding of science. He was one of the founders and directors of the Associação Brasileira de Divulgação Científica, and was still active in research on the biological control of agricultural plagues.\n\nDeath\nPavan died on April 3, 2009, at the University Hospital of the University of São Paulo, of multiple organ failure resultant of complications after a cancer surgery.\n\nDecorations\nComendador da Ordem do Rio Branco - Ministério das Relações Exteriores - 1986\nOficial da Ordem do Mérito - Forças Armadas do Brasil - 1986\nOrdem da Inconfidência - Governo do Estado de Minas Gerais - 1987\nGrande Oficial da Ordem do Mérito - Governo da Republica Portuguesa - 1987\nGrã-Cruz da Ordem Nacional do Mérito Científico - Presidency of the Republic of Brazil - 1994\n\nMedals\nMedalha \"Anchieta\" - Câmara de Vereadores da cidade de São Paulo - 1988\nMedalha CAPES 50 Anos - CAPES/MEC - Jul/2001\n\nAwards\nPrêmio Nacional de Genética - 1963\nPrêmio Moinho Santista (Biologia) - Fundação Moinho Santista - 1980\nPrêmio \"Alfred Jurzykowski\" - Academia Nacional de Medicina - 1986\n\nSelected publications\n PAVAN, C. and BREUER, M. E. 1952. Polytene chromosomes in different tissues of Rhynchosciara. Journal of Heredity. vol. 63, p. 151-157.\n PAVAN, C. 1967. Chromosomal changes induced by infective agents Triangle. Sandoz J. Med. Sci. vol. 8, p. 42-48.\n PAVAN, C., BIESELE, J., RIESS, R. W. and WERTZ, A. V. 1971. XIII. Changes in the ultrastructure of Rhynchosciara cells infected by Microsporidia. Studies in Genetics. vol. VI, p. 7103.\n PAVAN, C., DA CUNHA, A. B. and MORSOLETTO, C. 1971. Virus-chromosome relationships in cells of Rhynchosciara (Diptera, Sciaridae). Caryologia. vol. 24, p. 371-389.\n PAVAN, C. and SANDERS, P. F. 1972. Heterochromatin in development of normal and infected cells. In Cell Differentiation. Munrsgaard- Copenhagen:.\n PAVAN, C. 1983. Karyotypes and possible regions of origin of three species of Calliphoridae (Diptera) recently introduced in Brazil. Revista Brasileira de Genética. vol. 6, p. 619-638.\n\nExternal links\n Biography. Brazilian Academy of Sciences.\n Crodowaldo Pavan's obituary \n\n1919 births\n2009 deaths\nMembers of the Pontifical Academy of Sciences\nBrazilian scientists\nBrazilian geneticists\nMembers of the Brazilian Academy of Sciences\nRecipients of the National Order of Scientific Merit (Brazil)\nBrazilian people of Italian descent\nPeople from Campinas\nBrazilian science writers\nBrazilian educators\nUniversity of São Paulo alumni\nAcademic staff of the State University of Campinas"
}