{
  "title": "Lymphangiectasia",
  "content": "Lymphangiectasia, also known as \"lymphangiectasis\", is a pathologic dilation of lymph vessels. When it occurs in the intestines of dogs, and more rarely humans, it causes a disease known as \"intestinal lymphangiectasia\". This disease is characterized by lymphatic vessel dilation, chronic diarrhea and loss of proteins such as serum albumin and globulin.  It is considered to be a chronic form of protein-losing enteropathy.\n\nSigns and symptoms\nChronic diarrhea is almost always seen with lymphangiectasia, but most other signs are linked to low blood protein levels (hypoproteinemia), which causes low oncotic pressure.  These signs include ascites, pleural effusion, and edema of the limbs and trunk.  Weight loss is seen with long-term disease.\n\nCause\nBiopsy of the small intestine shows dilation of the lacteals of the villi and distension of the lymphatic vessels.  Reduced lymph flow leads to a malabsorption syndrome of the small intestine, especially of fat and fat-soluble vitamins.  Rupture of the lymphatics causes protein loss into the intestines.\n\nThe most common cause of lymphangiectasia was congenital malformation of the lymphatics.  Secondary lymphangiectasia may be caused by granulomas or cancer causing lymphatic obstruction, or increased central venous pressure (CVP) causing abnormal lymph drainage.  Increased CVP can be caused by pericarditis or right-sided heart failure.  Inflammatory bowel disease can also lead to inflammation of the lymphatics and lymphangiectasia through migration of inflammatory cells through the lymphatics.\n\nDiagnosis\nDiagnosis is through biopsy.  The presence of hypoproteinemia, decreased blood lymphocytes, and decreased cholesterol support the diagnosis.  Hypocalcemia (low calcium) is also seen due to poor absorption of vitamin D and calcium, and secondary to low protein binding of calcium.  Medical ultrasonography may show striations in the intestinal mucosa indicating dilated lacteals. Computerized tomography (CT) can show low attenuation material within the bowel walls which corresponds to lipid-containing chylous fluid within the dilated lymphatic vessels.\n\nTreatment\nTreatment is multifactorial.  A diet very low in fat and high in high quality protein is essential. By limiting a dog's fat intake, the amount of intestinal lymph that is formed is reduced which also reduces pressure within these faulty ducts. Less pressure means less lymph leakage and a reduction of symptoms. Diets for dogs with lymphangiectasia should not have more than 20% of their calories coming from fat. Treatment of humans can also involve the use of MCT (medium-chain triglycerides) oil and/or the drug octreotide. In dogs, fat soluble vitamins (A, D, E, and K) should be supplemented.  Corticosteroid treatment may be required for life.  Antibiotics can be used to treat bacterial overgrowth.  With a very low serum albumin, transfusion with blood plasma or an infusion of hetastarch may be necessary to treat the signs until the diet can take effect.  Lymphangiectasia is rarely cured but can remain in remission for a long time.  It can be fatal when unresponsive to treatment.\n\nIn animals\nDog breeds commonly affected by lymphangiectasia and/or protein-losing enteropathy include the Soft-Coated Wheaten Terrier, Norwegian Lundehund, Basenji, and Yorkshire Terrier.\n\nReferences\n\nExternal links \n\nDermal and subcutaneous growths\nDog diseases\nLymphatic vessel diseases"
}