{
  "title": "Monoamine oxidase A",
  "content": "Monoamine oxidase A, also known as MAO-A, is an enzyme (E.C. 1.4.3.4) that in humans is encoded by the MAOA gene. This gene is one of two neighboring gene family members that encode mitochondrial enzymes which catalyze the oxidative deamination of amines, such as dopamine, norepinephrine, and serotonin. A mutation of this gene results in Brunner syndrome. This gene has also been associated with a variety of other psychiatric disorders, including antisocial behavior. Alternatively spliced transcript variants encoding multiple isoforms have been observed.\n\nStructures\n\nGene \nMonoamine oxidase A, also known as MAO-A, is an enzyme that in humans is encoded by the MAOA gene. \nThe promoter of MAOA contains conserved binding sites for Sp1, GATA2, and TBP. This gene is adjacent to a related gene (MAOB) on the opposite strand of the X chromosome.\n\nIn humans, there is a 30-base repeat sequence repeated several different numbers of times in the promoter region of MAO-A. There are 2R (two repeats), 3R, 3.5R, 4R, and 5R variants of the repeat sequence, with the 3R and 4R variants most common in all populations. The variants of the promoter have been found to appear at different frequencies in different ethnic groups in an American sample cohort.\n\nThe epigenetic modification of MAOA gene expression through methylation likely plays an important role in women. A study from 2010 found epigenetic methylation of MAOA in men to be very low and with little variability compared to women, while having higher heritability in men than women.\n\nProtein \n\nMAO-A shares 70% amino acid sequence identity with its homologue MAO-B. Accordingly, both proteins have similar structures.  Both MAO-A and MAO-B exhibit an N-terminal domain that binds flavin adenine dinucleotide (FAD), a central domain that binds the amine substrate, and a C-terminal α-helix that is inserted in the outer mitochondrial membrane.  MAO-A has a slightly larger substrate-binding cavity than MAO-B, which may be the cause of slight differences in catalytic activity between the two enzymes, as shown in quantitative structure-activity relationship experiments. Both enzymes are relatively large, about 60 kilodaltons in size, and are believed to function as dimers in living cells.\n\nFunction \n\nMonoamine oxidase A catalyzes O2-dependent oxidation of primary arylalkyl amines, most importantly neurotransmitters such as dopamine and serotonin.  This is the initial step in the breakdown of these molecules.  The products are the corresponding aldehyde, hydrogen peroxide, and ammonia:\n\nR-Amine +  +  → R-Aldehyde +  + \n\nThis reaction is believed to occur in three steps, using FAD as an electron-transferring cofactor.  First, the amine is oxidized to the corresponding imine, with reduction of FAD to FADH2.  Second, O2 accepts two electrons and two protons from FADH2, forming  and regenerating FAD.  Third, the imine is hydrolyzed by water, forming ammonia and the aldehyde.\n\nCompared to MAO-B, MAO-A has a higher specificity for serotonin and norepinephrine, while the two enzymes have similar affinity for dopamine and tyramine.\n\nMAO-A is a key regulator for normal brain function. In the brain, the highest levels of transcription occur in the brain stem, hypothalamus, amygdala, habenula, and nucleus accumbens, and the lowest in the thalamus, spinal cord, pituitary gland, and cerebellum. Its expression is regulated by the transcription factors SP1, GATA2, and TBP via cAMP-dependent regulation.  MAO-A is also expressed in cardiomyocytes, where it is induced in response to stress such as ischemia and inflammation.\n\nClinical significance\n\nCancer \n\nMAO-A produces an amine oxidase, which is a class of enzyme known to affect carcinogenesis.  Clorgyline, an MAO-A enzyme inhibitor, prevents apoptosis in melanoma cells, in vitro.  Cholangiocarcinoma suppresses MAO-A expression, and those patients with higher MAO-A expression had less adjacent organ invasion and better prognosis and survival.\n\nCardiovascular disease \n\nMAOA activity is linked to apoptosis and cardiac damage during cardiac injury following ischemic-reperfusion.\n\nBehavioral and neurological disorders \nThere is some association between low activity forms of the MAOA gene and autism. Mutations in the MAOA gene results in monoamine oxidase deficiency, or Brunner syndrome. Other disorders associated with MAO-A include Alzheimer's disease, aggression, panic disorder, bipolar disorder, major depressive disorder, and attention deficit hyperactivity disorder. Effects of parenting on self-regulation in adolescents appear to be moderated by 'plasticity alleles', of which the 2R and 3R alleles of MAOA are two, with \"the more plasticity alleles males (but not females) carried, the more and less self-regulation they manifested under, respectively, supportive and unsupportive parenting conditions.\"\n\nDepression \nMAO-A levels in the brain as measured using positron emission tomography are elevated by an average of 34% in patients with major depressive disorder. Genetic association studies examining the relationship between high-activity MAOA variants and depression have produced mixed results, with some studies linking the high-activity variants to major depression in females, depressed suicide in males, major depression and sleep disturbance in males and major depressive disorder in both males and females.\n\nOther studies failed to find a significant relationship between high-activity variants of the MAOA gene and major depressive disorder. In patients with major depressive disorder, those with MAOA G/T polymorphisms (rs6323) coding for the highest-activity form of the enzyme have a significantly lower magnitude of placebo response than those with other genotypes.\n\nAntisocial behavior \nIn humans, an association between the 2R allele of the VNTR region of the gene and an increase in the likelihood of committing serious crime or violence has been found. The VNTR 2R allele of MAOA has been found to be a risk factor for violent delinquency, when present in association with stresses, i.e. family issues, low popularity or failing school.\n\nA connection between the MAO-A gene 3R version and several types of anti-social behaviour has been found: Maltreated children with genes causing high levels of MAO-A were less likely to develop antisocial behavior.  Low MAO-A activity alleles which are overwhelmingly the 3R allele in combination with abuse experienced during childhood resulted in an increased risk of aggressive behaviour as an adult, and men with the low activity MAOA allele were more genetically vulnerable even to punitive discipline as a predictor of antisocial behaviour. High testosterone, maternal tobacco smoking during pregnancy, poor material living standards, dropping out of school, and low IQ predicted violent behavior are associated with men with the low-activity alleles. According to a large meta-analysis in 2014, the 3R allele had a small, nonsignificant effect on aggression and antisocial behavior, in the absence of other interaction factors. Owing to methodological concerns, the authors do not view this as evidence in favor of an effect.\n\nThe MAO-A gene was the first candidate gene for antisocial behavior and was identified during a \"molecular genetic analysis of a large, multigenerational, and notoriously violent, Dutch kindred\". A study of Finnish prisoners revealed that a MAOA-L (low-activity) genotype, which contributes to low dopamine turnover rate, was associated with extremely violent behavior. For the purpose of the study, \"extremely violent behavior\" was defined as at least ten committed homicides, attempted homicides or batteries.\n\nHowever, a large genome-wide association study has failed to find any large or statistically significant effects of the MAOA gene on aggression. A separate GWAS on antisocial personality disorder likewise did not report a significant effect of MAOA. Another study, while finding effects from a candidate gene search, failed to find any evidence in a large GWAS. A separate analysis of human and rat genome wide association studies, Mandelian randomization studies, and causal pathway analyses likewise failed to reveal robust evidence of MAOA in aggression. This lack of replication is predicted from the known issues of candidate gene research, which can produce many substantial false positives.\n\nAggression and the \"Warrior gene\" \n\nLow-activity variants of the VNTR promoter region of the MAO-A gene have been referred to as the warrior gene.  When faced with social exclusion or ostracism, individuals with the low activity MAO-A variants showed higher levels of aggression than individuals with the high activity MAO-A gene.  Low activity MAO-A could significantly predict aggressive behaviour in a high provocation situation: Individuals with the low activity variant of the MAO-A gene were more likely (75% as opposed to 62%, out of a sample size of 70) to retaliate, and with greater force, as compared to those with a normal MAO-A variant if the perceived loss was large.\n\nThe effects of MAOA genes on aggression have also been criticized for being heavily overstated. Indeed, the MAOA gene, even in conjunction with childhood adversity, is known to have a very small effect. The vast majority of people with the associated alleles have not committed any violent acts.\n\nLegal implications \nIn a 2009 criminal trial in the United States, an argument based on a combination of \"warrior gene\" and history of child abuse was successfully used to avoid a conviction of first-degree murder and the death penalty; however, the convicted murderer was sentenced to 32 years in prison. In a second case, an individual was convicted of second-degree murder, rather than first-degree murder, based on a genetic test that revealed he had the low-activity MAOA variant. Judges in Germany are more likely to sentence offenders to involuntary psychiatric hospitalization on hearing an accused's MAOA-L genotype.\n\nEpigenetics \nStudies have linked methylation of the MAOA gene with nicotine and alcohol dependence in women.  A second MAOA VNTR promoter, P2, influences epigenetic methylation and interacts with having experienced child abuse to influence antisocial personality disorder symptoms, only in women. A study of 34 non-smoking men found that methylation of the gene may alter its expression in the brain.\n\nAnimal studies \n\nA dysfunctional MAOA gene has been correlated with increased aggression levels in mice, and has been correlated with heightened levels of aggression in humans. In mice, a dysfunctional MAOA gene is created through insertional mutagenesis (called 'Tg8'). Tg8 is a transgenic mouse strain that lacks functional MAO-A enzymatic activity. Mice that lacked a functional MAOA gene exhibited increased aggression towards intruder mice.\n\nSome types of aggression exhibited by these mice were territorial aggression, predatory aggression, and isolation-induced aggression. The MAO-A deficient mice that exhibited increased isolation-induced aggression reveals that an MAO-A deficiency may also contribute to a disruption in social interactions. There is research in both humans and mice to support that a nonsense point mutation in the eighth exon of the MAOA gene is responsible for impulsive aggressiveness due to a complete MAO-A deficiency.\n\nInteractions\n\nTranscription factors \n\nA number of transcription factors bind to the promoter region of MAO-A and upregulate its expression. These include:Sp1 transcription factor, GATA2, TBP.\n\nInducers \n\nSynthetic compounds that up-regulate the expression of MAO-A include Valproic acid (Depakote)\n\nInhibitors \n\nSubstances that inhibit the enzymatic activity of MAO-A include:\n\nSynthetic compounds\n Befloxatone (MD370503)\n Brofaromine (Consonar)\n Cimoxatone\n Clorgyline (irreversible)\n Methylene Blue\n Minaprine (Cantor)\n Moclobemide (Aurorix, Manerix)\n Phenelzine (Nardil)\n Pirlindole (Pirazidol)\n Toloxatone (Humoryl)\n Tyrima (CX 157)\n Tranylcypromine (nonselective and irreversible)\nNatural products\n Incarviatone A\nHerbal sources\n Garlic (Garlic)\n β-Carboline alkaloids (Syrian Rue, Passion Flower, Tobacco smoke, Ayahuasca)\n Harmine\n Harmaline\n Isoquinoline alkaloids\n Piperine (Black pepper)\n Rosiridin (in vitro)\n\nSee also \n Monoamine oxidase B\n Monoamine oxidase inhibitor - a class of antidepressant drugs that block or inactivate one or both MAO isoforms\n\nReferences\n\nFurther reading\n\nExternal links \n \n\nAggression\nCriminology\nEC 1.4.3\nHuman proteins\n\nde:Warrior Gene"
}