{
  "title": "Royal College of General Practitioners",
  "content": "The Royal College of General Practitioners (RCGP) is the professional body for general (medical) practitioners (GPs/Family Physicians/Primary Care Physicians) in the United Kingdom. The RCGP represents and supports GPs on key issues including licensing, education, training, research and clinical standards. It is the largest of the medical royal colleges, with over 50,000 members. The RCGP was founded in 1952 in London, England and is a registered charity. Its motto is Cum Scientia Caritas – \"Compassion [empowered] with Knowledge.\"\n\nOrganisation\nThe RCGP is unique amongst the medical royal colleges in having both a President and a Chairman. The President takes a mainly ceremonial function while the Chairman sets the college's policy direction, and leads the RCGP decision making body – the council. In 2012 the establishment of a new Trustee Board meant that members of the council were relieved of having to act in a statutory capacity relating to the college's charity status.\n\nThe council of the RCGP encompasses 32 groups ('Faculties') located across the UK, the Republic of Ireland and overseas. These are semi-autonomous units that provide local support and services for doctors, including educational events, training and personal development services. The college also incorporates devolved councils in Scotland, Wales and Northern Ireland that liaise with their own national health and primary care organisations.\n\n, the President is Dame Clare Gerada, Chair of Council is Dr Kamila Hawthorne MBE, Honorary Secretary is Michael Mulholland, Honorary Treasurer is Steve Mowle, Vice Chair Professional Development is Margaret Ikpoh and Vice Chair External Affairs is Gary Howsam.\n\nMembership\n\nPaid membership of the RCGP is split into three main groups:\n Associates – fully or provisionally registered medical practitioners who have yet to pass college assessments for membership.\n Members – medical practitioners who have successfully completed the College's assessments and applied for membership.\n Fellows – an honour and mark of achievement awarded to members who have made a significant contribution to the health and welfare of the community, to the science or practice of medicine in general, or to general practice/primary care in particular.\n\nRCGP membership is also extended to Associates in Training (doctors in specialty training for general practice) and Life Members.  the membership total stands at over 50,000. Members of the RCGP are required to abide by the RCGP constitution.\n\nThe college gained over 7,000 Associates in Training (AiTs) in 2008, when membership was made compulsory for GP trainees. The membership total has effectively doubled between 1998 and 2008.\n\nMRCGP postgraduate qualification\nMembership of the Royal College of General Practitioners (MRCGP) is a postgraduate medical qualification in the UK. The MRCGP Qualification is an integrated training and assessment system run by the RCGP. It aims to demonstrate excellence in the provision of General Practice. While the MRCGP was originally an optional qualification, it has more recently become mandatory for newly qualifying GPs and is directly linked to the GP Curriculum which the RCGP published in 2007 and regularly updates as necessary.\n\nThe award of MRCGP in addition to meeting all the criteria of the GMC along with a payment of a fee (currently £500) may lead to the award of a Certificate of Completion of Training.\n\nIn 2007 a new system of assessment was introduced, delivered locally in conjunction with deaneries, with the qualification awarded on completion of a three-year specialty training programme. Doctors with a licence to practise who successfully complete the MRCGP are eligible for inclusion on the General Medical Council's (GMC) GP Register as well use of the post nominals that indicate membership of the RCGP (MRCGP). Immediately after the introduction of the 2007 changes the term \"nMRCGP\" had helped to differentiate between old and new assessment procedures (with n meaning new). After several years, once all trainees were being assessed using the new methods, the \"n\" was dropped.\n\nTraining and assessment comprises three components, which cover the general practice specialty training curriculum.\n\n The Applied Knowledge Test (AKT) is a multiple-choice computer-based assessment that tests the knowledge base underpinning general practice in the UK.  It covers clinical medicine, critical appraisal/evidence-based clinical practice and health informatics/administrative issues.\n The Clinical Skills Assessment (CSA) assesses a doctor's ability to integrate and apply clinical, professional, communication and practical skills to general practice. It simulates patient consultations based on scenarios drawn from general practice. Each consultation is marked by a different assessor, and the role of the patient is taken by a trained role-player.\n The Workplace-Based Assessment (WPBA)  evaluates a doctor's performance over time in the twelve professional competence areas that make up \"Being a General Practitioner\". This assessment takes place in the workplace throughout a GP's training.\n\nMembership by Assessment of Performance (MAP) is the alternative route to membership. It enables established GPs, who cannot take the college's MRCGP exam, to gain membership through submission of a portfolio of evidence and potentially an oral examination. This route to membership is open to all established GPs who are registered to practice in the UK and who never took College exams.\n\nRacial discrimination in clinical skills assessment\nIn 2013 the British Association of Physicians of Indian Origin launched a legal challenge to the regulator, the General Medical Council, and the college alleging that the clinical skills assessment component of the Membership exam was discriminatory and seeking a judicial review of the way the RCGP conducted the test, because there is a \"significant difference in pass rates which cannot be explained by a lack of any knowledge, skill or competency on the part of the International Medical Graduates. 65.3% of international graduates failed their first attempt at the Clinical Skills Assessment (CSA) component of the MRCGP exam in 2011/12, compared with 9.9% of UK graduates. In 2010/11, 59.2% of the international graduates failed at the first attempt, compared with 8.2% of UK graduates, while in 2008, 43% of IMGs failed the CSA compared with 8.3% of UK graduates.\n\nAneez Esmail was asked to analyse data on more than 5,000 candidates who sat the CSA exam over a two-year period by the GMC. He found that ‘subjective bias due to racial discrimination may be a cause’ of the different pass rates for between white and non-white graduates.\n\nThe Judicial Review failed. Mr Justice John Mitting presiding over the case said that the Royal College of General Practitioners was neither racially discriminatory nor in breach of its public sector equality duty. He said the college had carried out numerous assessments that identified the disparity in performance between different groups and that it should now take action, including by selecting more representative examiners and role-players for the assessment.\n\nSubsequently, the college, BAPIO announced that they would be working in close collaboration to address supporting international medical graduates and Black and Minority Ethnic doctors in relation to training and passing the MRCGP.\n\nProfessional development\nThe RCGP runs a Continuing Professional Development (CPD) Credits scheme that offers GPs a flexible learning framework in which to produce a portfolio of work that supports the Revalidation process. Key elements of the college's work in this field include developing a quality assured appraisal system and an ePortfolio that logs evidence of GPs' learning.\n\nThe CPD scheme is supported by the Online Learning Environment and Essential Knowledge Updates (EKU), providing doctors with  e-learning tools, publications and other written materials on the latest developments in clinical practice knowledge. The provision of educational support for members includes:\n E-learning modules\n British Journal of General Practice\n InnovAiT\n Essential Knowledge Updates and Challenge\n Personal Education Programme (PEP)\n Clinical courses\n Clinical updates\n CPD Credits Scheme.\n\nThis has led to improved retention, which now exceeds 97%, and is 7% higher than the average retention rate for UK-based membership organisations charging a similar annual membership subscription fee. The RCGP has also developed Quality Programmes to support GPs and their teams. These are criteria and evidence based programmes which are designed to be voluntary, supportive and developmental in function.\n\nCourses and events\nThe RCGP runs an Annual Conference each autumn, often attracting political, national and international speakers. The RCGP also hold a variety of courses and conferences throughout the year on specific clinical topics (e.g. Certificate in the treatment of substance misuse; Minor Surgery; Commissioning of local care; and regular 'one-day essentials' such as obesity, respiratory care and dementia) – all aimed at GPs and other health professionals within primary care.\n\nInternational work\nThe RCGP  builds partnerships with overseas health organisations, runs an International Development Programme and develops postgraduate assessment through an International Membership accreditation scheme called MRCGP[INT].\n\nThe college advises international doctors wishing to study or practise in the UK, and runs an International Travel Scholarship to support the study needs of members and non-members.\n\nPublications, information services and archives\n\nThe RCGP publishes\n The British Journal of General Practice (BJGP) is an international journal publishing research, debate and analysis, and clinical guidance for family practitioners and primary care researchers worldwide, formerly known as The Journal of the Royal College of General Practitioners\n RCGP News, the college's monthly newspaper, covering events in both the college and the wider medical professions\n Free electronic bulletins, including the weekly Seven days and bi-monthly e-Bulletin\n InnovAiT\n\nThe college also produces several key documents, reports, position statements and occasionally guidance in a variety of areas each year. The college's Clinical Champions working out of its Clinical Innovation and Research Centre also produce a wide range of materials in response to identified clinical priorities, including:\n Medical Generalism: Why expertise in whole person medicine matters\n General Practice 2022 (in progress)- detailing how general practice can be the driving force for transforming the health service over the next decade\n Personal health budgets (Guide for GPs and position statement)\n Social Media Highway Code (for discussion)\n Whistle Blowing in the NHS (position statement)\n\nThe RCGP's library catalogue contains MD and PhD theses on general practice, an international selection of primary care journals and a loan collection of college publications. The library is open to all members, and to non-members by appointment.\n\nRCGP's archives provide an important insight into the origins of the college and the foundation of modern general practice. Exhibits include a variety of personal papers, historic books, college institutional records, and a museum collection of medical instruments dating back to the 17th century.\n\nPrizes and awards\nThe RCGP provides over 20 academic and monetary awards for people at different stages of their career. The awards are administered by an Awards Committee chaired by the President, and are usually presented at the college's two general meetings. The college also offers a number of International Travel Scholarships, and some regional faculties run their own awards. The college's highest award is the Honorary Fellowship, awarded to doctors and non-doctors from the UK and overseas for outstanding work towards the objectives of the college.\n\nCollege history and headquarters\n\nCo-founders of the college include Fraser Rose, John Hunt and George Abercrombie and others who joined the steering committee in 1951. The college began in November 1952 in response to growing physical, administrative and financial pressures that demoralised GPs and undermined standards of patient care. GPs now had to provide free primary care throughout the community and act as 'gatekeepers' with responsibility for referring patients to specialist consultants in NHS hospitals.\n\nThe formation of the college received widespread support throughout the medical press and individual GPs. In January 1953 'Foundation Membership' was made available to established GPs who satisfied defined criteria, and within six weeks 1,655 doctors had joined. One of the first presidents of the RCGP was William Pickles. He spoke out in favour of the foundation of the NHS and was held in high regard worldwide for his work in epidemiology.\n\nThe college's coat of arms and inscription Cum Scientia Caritas were designed by Perry Harrison, a founder member of the college. The college received the letters patent for its Arms in 1961. The elements represent historical context and themes relevant to general medical practice:\n The ancient lineage of medicine – the gavel entwined with the serpent of Asclepius (the Greek God of Medicine).\n The owl of the crest represents wisdom, and night visits; the gavel, authority and decision-making.\n The shield itself is derived from that of St Bartholomew's Hospital (the oldest extant hospital site in the UK). Its chevron in these arms represents a roof (of the house in which general practice takes place), and day and night (black/white) alluding to the 24-hour commitment of GPs to their patients.\n The lamp represents enlightenment, the importance of study/research, and links with the lamp of nursing.\n The doctor's compassionate and healing relationship with their patient is represented by the white poppy (symbolising the relief of pain) and the blue gentian (representing the restorative and rehabilitative role of the GP).\n The supporters are a unicorn (from the arms of the Society of Apothecaries, the forerunners of General Practitioners in the UK and in whose Hall the College of General Practitioners was first housed, but also representing medicine), and a lynx (from the Arms of the Company of Barbers and subsequently the Royal College of Surgeons, representing surgery). The spots on the lynx indicate its all-seeing nature, which is thought appropriate for general practice.\n The motto is Cum Scientia Caritas (Compassion [empowered] with Knowledge).\n\nFrom 1962 the headquarters of the college were at 14 Princes Gate, Kensington, London. By 1970 the college had 7,500 members.\n\nIn late October 2012 the college moved into new headquarters at 30 Euston Square, Camden, London. The building includes a Clinical Skills Assessment Centre (CSA) which means that the college has the capacity to assess several hundred candidates during sittings that are held throughout the year. Concern has been expressed about the effect on the headquarters when re-development of Euston Station takes place to accommodate the new High Speed Two development.\n\nCriticism\n\nThe RCGP has been criticised for its support of the fossil fuel industry by hosting the 2020 Oil and Gas UK Exploration Conference at its London headquarters. This was cancelled after a petition by members raised concerns.\n\nSee also\n Medical school in the United Kingdom\n List of medical schools in the United Kingdom\n\nReferences\n\nExternal links\n \n\nGeneral practice organizations\nMedical associations based in the United Kingdom\nOrganisations based in the London Borough of Camden\nOrganisations based in London with royal patronage\nOrganizations established in 1952\nGeneral Practitioners\n1952 establishments in the United Kingdom"
}