{
  "title": "The Physiological Society",
  "content": "The Physiological Society, founded in 1876, is a learned society for physiologists in the United Kingdom.\n\nHistory\nThe Physiological Society was founded in 1876 as a dining society \"for mutual benefit and protection\" by a group of 19 physiologists, led by John Burdon Sanderson and Michael Foster, as a result of the 1875 Royal Commission on Vivisection and the subsequent 1876 Cruelty to Animals Act.  Other founding members included: William Sharpey, Thomas Huxley, George Henry Lewes, Francis Galton, John Marshall, George Murray Humphry, Frederick William Pavy, Lauder Brunton, David Ferrier, Philip Pye-Smith, Walter H. Gaskell, John Gray McKendrick, Emanuel Edward Klein,  Edward Schafer, Francis Darwin, George Romanes, and Gerald Yeo. The aim was to promote the advancement of physiology. Charles Darwin and William Sharpey were elected as the society's first two Honorary Members. The society first met at Sanderson's London home. The first rules of the society offered membership to no more than 40, all of whom should be male \"working\" physiologists. Women were first admitted as members in 1915 and the centenary of this event was celebrated in 2015.\n\nMichael Foster was also founder of The Journal of Physiology in 1878, and was appointed to the first Chair of Physiology at the University of Cambridge in 1883.\n\nThe archives are held at the Wellcome Library.\n\nPresent day \nThe Society consists of over 2500 members, including 14 Nobel Laureates drawn from over 50 countries. The majority of members are engaged in research, in universities or industry, into how the body works in health and disease and in teaching physiology in schools and universities. The Society also facilitates communication between scientists and with other interested groups.\n\nThe Physiological Society publishes the academic journals The Journal of Physiology and Experimental Physiology, and with the American Physiological Society publishes the online only, open access journal Physiological Reports. It also publishes the membership magazine Physiology News.\n\nThe society is based at Hodgkin Huxley House in Farringdon, London, named for Alan Hodgkin and Andrew Huxley.\n\nPresidents \n\nThe post of president was established in 2001, and the society's current president is David Attwell. Past holders include:\n\n \n \n \n \n \n \n \n \n \n \n 2022 – 2024: David Attwell\n\nPrizes \n\nThe Society awards a number of prizes for meritorious achievement.\n\nAnnual Review Prize Lecture \n\nThe society considers its Annual Review Prize Lecture, first awarded in 1968, to be its premier award.\n\nInternational Prize Lecture\n\nBayliss-Starling Prize Lecture \n\nNamed for William Bayliss and Ernest Starling. Originally awarded every three years, since 2015 it is awarded annually alternating between established and early-career physiologists.\n\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  – Endogenous and exogenous control of gastrointestinal epithelial function: building on the legacy of Bayliss and Starling\n\nBiller Prize Lecture \n\nNamed in memory of Kathy Biller. Given to a worker in the field of renal or epithelial physiology, under 35 years old. It has now been discontinued.\n\nG L Brown Prize Lecture \n\nNamed for George Lindor Brown. These lectures are delivered at various institutions and intended to stimulate an interest in physiology.\n\nG W Harris Prize Lecture \n\nNamed in memory of Geoffrey Harris. Now discontinued.\n\nHodgkin–Huxley–Katz Prize Lecture \n\nNamed after Alan Hodgkin, Andrew Huxley and Bernard Katz, and normally awarded to a physiologist from outside the UK or Ireland.\n\n \n \n \n \n \n \n \n \n  – Calcium microdomains in cardiac myocytes\n\nJoan Mott Prize Lecture \n\nNamed for Joan Mott.\n\nMichael de Burgh Daly Prize Lecture \n\nNamed for .\n\nOtto Hutter Teaching Prize \n\nNamed for Otto Hutter, and awarded to teachers of undergraduate physiology.\n\n \n \n \n \n  – Engaging students and valuing teachers\n\nThe President's Lecture \nInitiated in 2017, the President’s Lecture is awarded by the President of The Society to a recipient of their choosing. This prestigious lecture is awarded at the discretion of The Society’s President.\n\nR Jean Banister Prize Lecture \n\nNamed for R Jean Banister. Awarded to an early-career physiologist and delivered at various institutions.\n\n  – Getting excited about pacemaking in the athletic heart: interplay of transcription factors and microRNAs in pacemaker electrophysiology.\n  – Decoding the visual cortex\n  – Physiological adaptations to traditional and novel exercise interventions as a function of age\n\nThe Paton Lecture \n\nNamed for William D.M. Paton, and given on a historical aspect of physiology.\n\nAnnual Public Lecture \n\nIntended to raise awareness and understanding of physiology among the general public and schools.\n\n \n \n \n \n \n  – How your body clock makes you tick\n  – The loving brain\n \n \n  – The science of laughter\n \n  – From mountains to the bedside: Lessons learnt from Everest\n\nSharpey-Schafer Lecture and Prize \n\nNamed after Edward Albert Sharpey-Schafer. Awarded alternating between established and early-career physiologists.\n\nWellcome Prize Lecture \n\nAwarded to young physiologists (under 40). Now discontinued.\n\nGSK Prize Lecture \n\nAwarded to early-career physiologists. Now discontinued.\n\nReferences\n\nFurther reading\n  Tansey, Tilli; Wray, Susan, ed. (1 July 2015). Women Physiologists: Centenary Celebrations and Beyond, The Physiological Society.\n\nExternal links \n The Physiological Society\n The Journal of Physiology\n Experimental Physiology\n\nBiology societies\nLearned societies of the United Kingdom\nScientific organizations established in 1876\n1876 establishments in the United Kingdom\nScientific organisations based in the United Kingdom\nPhysiology organizations"
}